Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xadc (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x404ac): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x85b1d): ../Core/Src/GNSS/GNSSCom.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4bf51): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x7be63): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x4746f): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 5 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xee1aa): unsigned char
 <1><44>: Abbrev Number: 5 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb6df2): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xc91b0): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 5 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xec5bd): short unsigned int
 <1><5e>: Abbrev Number: 5 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x1495a): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x9db69): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 5 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5dc6d): long unsigned int
 <1><78>: Abbrev Number: 5 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x70405): long long int
 <1><7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x33059): long long unsigned int
 <1><86>: Abbrev Number: 28 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 5 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x13e56): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x47471): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 29 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xb50d1): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x113a6): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 16
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 404
    <cb>   DW_AT_decl_column : 9
    <cb>   DW_AT_sibling     : <0x106>
 <2><cf>: Abbrev Number: 6 (DW_TAG_member)
    <d0>   DW_AT_name        : CCR
    <d4>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 406
    <d6>   DW_AT_decl_column : 17
    <d6>   DW_AT_type        : <0xc2>
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 3 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0xa1b92): CNDTR
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 407
    <e3>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xc2>
    <e8>   DW_AT_data_member_location: 4
 <2><e9>: Abbrev Number: 3 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0xee38c): CPAR
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 408
    <f1>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xc2>
    <f6>   DW_AT_data_member_location: 8
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x8850e): CMAR
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 409
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 12
 <2><105>: Abbrev Number: 0
 <1><106>: Abbrev Number: 15 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xe86fe): DMA_Channel_TypeDef
    <10b>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 410
    <10e>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xc7>
 <1><112>: Abbrev Number: 17 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 8
    <114>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 412
    <116>   DW_AT_decl_column : 9
    <116>   DW_AT_sibling     : <0x135>
 <2><11a>: Abbrev Number: 6 (DW_TAG_member)
    <11b>   DW_AT_name        : ISR
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 414
    <121>   DW_AT_decl_column : 17
    <121>   DW_AT_type        : <0xc2>
    <125>   DW_AT_data_member_location: 0
 <2><126>: Abbrev Number: 3 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0xac9c8): IFCR
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 415
    <12e>   DW_AT_decl_column : 17
    <12f>   DW_AT_type        : <0xc2>
    <133>   DW_AT_data_member_location: 4
 <2><134>: Abbrev Number: 0
 <1><135>: Abbrev Number: 15 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x59518): DMA_TypeDef
    <13a>   DW_AT_decl_file   : 4
    <13b>   DW_AT_decl_line   : 416
    <13d>   DW_AT_decl_column : 3
    <13d>   DW_AT_type        : <0x112>
 <1><141>: Abbrev Number: 17 (DW_TAG_structure_type)
    <142>   DW_AT_byte_size   : 44
    <143>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 950
    <145>   DW_AT_decl_column : 9
    <145>   DW_AT_sibling     : <0x20a>
 <2><149>: Abbrev Number: 6 (DW_TAG_member)
    <14a>   DW_AT_name        : CR1
    <14e>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 952
    <150>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xc2>
    <154>   DW_AT_data_member_location: 0
 <2><155>: Abbrev Number: 6 (DW_TAG_member)
    <156>   DW_AT_name        : CR2
    <15a>   DW_AT_decl_file   : 4
    <15a>   DW_AT_decl_line   : 953
    <15c>   DW_AT_decl_column : 17
    <15c>   DW_AT_type        : <0xc2>
    <160>   DW_AT_data_member_location: 4
 <2><161>: Abbrev Number: 6 (DW_TAG_member)
    <162>   DW_AT_name        : CR3
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 954
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 6 (DW_TAG_member)
    <16e>   DW_AT_name        : BRR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 955
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xc2>
    <178>   DW_AT_data_member_location: 12
 <2><179>: Abbrev Number: 3 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x4417e): GTPR
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 956
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xb1>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 3 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xe8589): RESERVED2
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 957
    <18f>   DW_AT_decl_column : 13
    <190>   DW_AT_type        : <0xa5>
    <194>   DW_AT_data_member_location: 18
 <2><195>: Abbrev Number: 3 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x91309): RTOR
    <19a>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 958
    <19d>   DW_AT_decl_column : 17
    <19e>   DW_AT_type        : <0xc2>
    <1a2>   DW_AT_data_member_location: 20
 <2><1a3>: Abbrev Number: 6 (DW_TAG_member)
    <1a4>   DW_AT_name        : RQR
    <1a8>   DW_AT_decl_file   : 4
    <1a8>   DW_AT_decl_line   : 959
    <1aa>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xb1>
    <1ae>   DW_AT_data_member_location: 24
 <2><1af>: Abbrev Number: 3 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xe8593): RESERVED3
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 960
    <1b7>   DW_AT_decl_column : 13
    <1b8>   DW_AT_type        : <0xa5>
    <1bc>   DW_AT_data_member_location: 26
 <2><1bd>: Abbrev Number: 6 (DW_TAG_member)
    <1be>   DW_AT_name        : ISR
    <1c2>   DW_AT_decl_file   : 4
    <1c2>   DW_AT_decl_line   : 961
    <1c4>   DW_AT_decl_column : 17
    <1c4>   DW_AT_type        : <0xc2>
    <1c8>   DW_AT_data_member_location: 28
 <2><1c9>: Abbrev Number: 6 (DW_TAG_member)
    <1ca>   DW_AT_name        : ICR
    <1ce>   DW_AT_decl_file   : 4
    <1ce>   DW_AT_decl_line   : 962
    <1d0>   DW_AT_decl_column : 17
    <1d0>   DW_AT_type        : <0xc2>
    <1d4>   DW_AT_data_member_location: 32
 <2><1d5>: Abbrev Number: 6 (DW_TAG_member)
    <1d6>   DW_AT_name        : RDR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 963
    <1dc>   DW_AT_decl_column : 17
    <1dc>   DW_AT_type        : <0xb1>
    <1e0>   DW_AT_data_member_location: 36
 <2><1e1>: Abbrev Number: 3 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xdeb43): RESERVED4
    <1e6>   DW_AT_decl_file   : 4
    <1e7>   DW_AT_decl_line   : 964
    <1e9>   DW_AT_decl_column : 13
    <1ea>   DW_AT_type        : <0xa5>
    <1ee>   DW_AT_data_member_location: 38
 <2><1ef>: Abbrev Number: 6 (DW_TAG_member)
    <1f0>   DW_AT_name        : TDR
    <1f4>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 965
    <1f6>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xb1>
    <1fa>   DW_AT_data_member_location: 40
 <2><1fb>: Abbrev Number: 3 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0xe85c1): RESERVED5
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 966
    <203>   DW_AT_decl_column : 13
    <204>   DW_AT_type        : <0xa5>
    <208>   DW_AT_data_member_location: 42
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0xf4745): USART_TypeDef
    <20f>   DW_AT_decl_file   : 4
    <210>   DW_AT_decl_line   : 967
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x141>
 <1><216>: Abbrev Number: 2 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xa14c): size_t
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 214
    <21d>   DW_AT_decl_column : 23
    <21e>   DW_AT_type        : <0x8d>
 <1><222>: Abbrev Number: 5 (DW_TAG_base_type)
    <223>   DW_AT_byte_size   : 8
    <224>   DW_AT_encoding    : 4	(float)
    <225>   DW_AT_name        : (indirect string, offset: 0x16757): long double
 <1><229>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <22a>   DW_AT_encoding    : 7	(unsigned)
    <22a>   DW_AT_byte_size   : 1
    <22a>   DW_AT_type        : <0x3d>
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 50
    <230>   DW_AT_decl_column : 1
    <231>   DW_AT_sibling     : <0x242>
 <2><235>: Abbrev Number: 8 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0xb5b40): HAL_UNLOCKED
    <23a>   DW_AT_const_value : 0
 <2><23b>: Abbrev Number: 8 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0xf6642): HAL_LOCKED
    <240>   DW_AT_const_value : 1
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 2 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x91286): HAL_LockTypeDef
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 53
    <249>   DW_AT_decl_column : 3
    <24a>   DW_AT_type        : <0x229>
 <1><24e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <24f>   DW_AT_byte_size   : 32
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 46
    <252>   DW_AT_decl_column : 9
    <252>   DW_AT_sibling     : <0x2bf>
 <2><256>: Abbrev Number: 1 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0xdcb48): Request
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 48
    <25d>   DW_AT_decl_column : 12
    <25e>   DW_AT_type        : <0xb6>
    <262>   DW_AT_data_member_location: 0
 <2><263>: Abbrev Number: 1 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x5aef8): Direction
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 51
    <26a>   DW_AT_decl_column : 12
    <26b>   DW_AT_type        : <0xb6>
    <26f>   DW_AT_data_member_location: 4
 <2><270>: Abbrev Number: 1 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x107a7): PeriphInc
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 55
    <277>   DW_AT_decl_column : 12
    <278>   DW_AT_type        : <0xb6>
    <27c>   DW_AT_data_member_location: 8
 <2><27d>: Abbrev Number: 1 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x264c1): MemInc
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 58
    <284>   DW_AT_decl_column : 12
    <285>   DW_AT_type        : <0xb6>
    <289>   DW_AT_data_member_location: 12
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x7aed8): PeriphDataAlignment
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 61
    <291>   DW_AT_decl_column : 12
    <292>   DW_AT_type        : <0xb6>
    <296>   DW_AT_data_member_location: 16
 <2><297>: Abbrev Number: 1 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xde6c3): MemDataAlignment
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 64
    <29e>   DW_AT_decl_column : 12
    <29f>   DW_AT_type        : <0xb6>
    <2a3>   DW_AT_data_member_location: 20
 <2><2a4>: Abbrev Number: 1 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xfc359): Mode
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 67
    <2ab>   DW_AT_decl_column : 12
    <2ac>   DW_AT_type        : <0xb6>
    <2b0>   DW_AT_data_member_location: 24
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xfbc89): Priority
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 72
    <2b8>   DW_AT_decl_column : 12
    <2b9>   DW_AT_type        : <0xb6>
    <2bd>   DW_AT_data_member_location: 28
 <2><2be>: Abbrev Number: 0
 <1><2bf>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x42044): DMA_InitTypeDef
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 74
    <2c6>   DW_AT_decl_column : 3
    <2c7>   DW_AT_type        : <0x24e>
 <1><2cb>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2cc>   DW_AT_encoding    : 7	(unsigned)
    <2cc>   DW_AT_byte_size   : 1
    <2cc>   DW_AT_type        : <0x3d>
    <2d0>   DW_AT_decl_file   : 7
    <2d1>   DW_AT_decl_line   : 80
    <2d2>   DW_AT_decl_column : 1
    <2d3>   DW_AT_sibling     : <0x2f0>
 <2><2d7>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2d8>   DW_AT_name        : (indirect string, offset: 0xb72c2): HAL_DMA_STATE_RESET
    <2dc>   DW_AT_const_value : 0
 <2><2dd>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2de>   DW_AT_name        : (indirect string, offset: 0x4368f): HAL_DMA_STATE_READY
    <2e2>   DW_AT_const_value : 1
 <2><2e3>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0xaae91): HAL_DMA_STATE_BUSY
    <2e8>   DW_AT_const_value : 2
 <2><2e9>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xf29d3): HAL_DMA_STATE_TIMEOUT
    <2ee>   DW_AT_const_value : 3
 <2><2ef>: Abbrev Number: 0
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x87cf6): HAL_DMA_StateTypeDef
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 85
    <2f7>   DW_AT_decl_column : 3
    <2f8>   DW_AT_type        : <0x2cb>
 <1><2fc>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <2fd>   DW_AT_type        : <0x2f0>
 <1><301>: Abbrev Number: 21 (DW_TAG_structure_type)
    <302>   DW_AT_name        : (indirect string, offset: 0xd1b00): __DMA_HandleTypeDef
    <306>   DW_AT_byte_size   : 72
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 112
    <309>   DW_AT_decl_column : 16
    <309>   DW_AT_sibling     : <0x3aa>
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xc8e8a): Instance
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 114
    <314>   DW_AT_decl_column : 27
    <315>   DW_AT_type        : <0x3aa>
    <319>   DW_AT_data_member_location: 0
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xfcad5): Init
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 116
    <321>   DW_AT_decl_column : 25
    <322>   DW_AT_type        : <0x2bf>
    <326>   DW_AT_data_member_location: 4
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0xaf786): Lock
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 118
    <32e>   DW_AT_decl_column : 25
    <32f>   DW_AT_type        : <0x242>
    <333>   DW_AT_data_member_location: 36
 <2><334>: Abbrev Number: 1 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xfe0b1): State
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 120
    <33b>   DW_AT_decl_column : 30
    <33c>   DW_AT_type        : <0x2fc>
    <340>   DW_AT_data_member_location: 37
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x4cf46): Parent
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 122
    <348>   DW_AT_decl_column : 26
    <349>   DW_AT_type        : <0x3af>
    <34d>   DW_AT_data_member_location: 40
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xf5600): XferCpltCallback
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 124
    <355>   DW_AT_decl_column : 11
    <356>   DW_AT_type        : <0x3c1>
    <35a>   DW_AT_data_member_location: 44
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0xbf304): XferHalfCpltCallback
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 126
    <362>   DW_AT_decl_column : 11
    <363>   DW_AT_type        : <0x3c1>
    <367>   DW_AT_data_member_location: 48
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x22fac): XferErrorCallback
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 128
    <36f>   DW_AT_decl_column : 11
    <370>   DW_AT_type        : <0x3c1>
    <374>   DW_AT_data_member_location: 52
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0xe6111): XferAbortCallback
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 130
    <37c>   DW_AT_decl_column : 11
    <37d>   DW_AT_type        : <0x3c1>
    <381>   DW_AT_data_member_location: 56
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf1056): ErrorCode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 132
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0xc2>
    <38e>   DW_AT_data_member_location: 60
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x636ec): DmaBaseAddress
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 134
    <396>   DW_AT_decl_column : 26
    <397>   DW_AT_type        : <0x3c6>
    <39b>   DW_AT_data_member_location: 64
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x32c36): ChannelIndex
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 136
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0xb6>
    <3a8>   DW_AT_data_member_location: 68
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3ab>   DW_AT_byte_size   : 4
    <3ab>   DW_AT_type        : <0x106>
 <1><3af>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
 <1><3b1>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <3b2>   DW_AT_prototyped  : 1
    <3b2>   DW_AT_sibling     : <0x3bc>
 <2><3b6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <3b7>   DW_AT_type        : <0x3bc>
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x301>
 <1><3c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c2>   DW_AT_type        : <0x3b1>
 <1><3c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x135>
 <1><3cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xd1b02): DMA_HandleTypeDef
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 153
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x301>
 <1><3d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_type        : <0x94>
 <1><3dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3dd>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3cb>
 <1><3e1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <3e2>   DW_AT_byte_size   : 32
    <3e3>   DW_AT_decl_file   : 8
    <3e4>   DW_AT_decl_line   : 46
    <3e5>   DW_AT_decl_column : 9
    <3e5>   DW_AT_sibling     : <0x452>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xe1512): BaudRate
    <3ee>   DW_AT_decl_file   : 8
    <3ef>   DW_AT_decl_line   : 48
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xb6>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x6c34): WordLength
    <3fb>   DW_AT_decl_file   : 8
    <3fc>   DW_AT_decl_line   : 68
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xb6>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xe188a): StopBits
    <408>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 71
    <40a>   DW_AT_decl_column : 12
    <40b>   DW_AT_type        : <0xb6>
    <40f>   DW_AT_data_member_location: 8
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x460eb): Parity
    <415>   DW_AT_decl_file   : 8
    <416>   DW_AT_decl_line   : 74
    <417>   DW_AT_decl_column : 12
    <418>   DW_AT_type        : <0xb6>
    <41c>   DW_AT_data_member_location: 12
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xfc359): Mode
    <422>   DW_AT_decl_file   : 8
    <423>   DW_AT_decl_line   : 81
    <424>   DW_AT_decl_column : 12
    <425>   DW_AT_type        : <0xb6>
    <429>   DW_AT_data_member_location: 16
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x846c3): HwFlowCtl
    <42f>   DW_AT_decl_file   : 8
    <430>   DW_AT_decl_line   : 84
    <431>   DW_AT_decl_column : 12
    <432>   DW_AT_type        : <0xb6>
    <436>   DW_AT_data_member_location: 20
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xcea82): OverSampling
    <43c>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 88
    <43e>   DW_AT_decl_column : 12
    <43f>   DW_AT_type        : <0xb6>
    <443>   DW_AT_data_member_location: 24
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x31ae8): OneBitSampling
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 92
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb6>
    <450>   DW_AT_data_member_location: 28
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 2 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x44daf): UART_InitTypeDef
    <457>   DW_AT_decl_file   : 8
    <458>   DW_AT_decl_line   : 101
    <459>   DW_AT_decl_column : 3
    <45a>   DW_AT_type        : <0x3e1>
 <1><45e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <45f>   DW_AT_byte_size   : 40
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 106
    <462>   DW_AT_decl_column : 9
    <462>   DW_AT_sibling     : <0x4e9>
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x2f98f): AdvFeatureInit
    <46b>   DW_AT_decl_file   : 8
    <46c>   DW_AT_decl_line   : 108
    <46d>   DW_AT_decl_column : 12
    <46e>   DW_AT_type        : <0xb6>
    <472>   DW_AT_data_member_location: 0
 <2><473>: Abbrev Number: 1 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0xe593e): TxPinLevelInvert
    <478>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 113
    <47a>   DW_AT_decl_column : 12
    <47b>   DW_AT_type        : <0xb6>
    <47f>   DW_AT_data_member_location: 4
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xceea7): RxPinLevelInvert
    <485>   DW_AT_decl_file   : 8
    <486>   DW_AT_decl_line   : 116
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0xb6>
    <48c>   DW_AT_data_member_location: 8
 <2><48d>: Abbrev Number: 1 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0xa6717): DataInvert
    <492>   DW_AT_decl_file   : 8
    <493>   DW_AT_decl_line   : 119
    <494>   DW_AT_decl_column : 12
    <495>   DW_AT_type        : <0xb6>
    <499>   DW_AT_data_member_location: 12
 <2><49a>: Abbrev Number: 1 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x4dc39): Swap
    <49f>   DW_AT_decl_file   : 8
    <4a0>   DW_AT_decl_line   : 123
    <4a1>   DW_AT_decl_column : 12
    <4a2>   DW_AT_type        : <0xb6>
    <4a6>   DW_AT_data_member_location: 16
 <2><4a7>: Abbrev Number: 1 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xbea51): OverrunDisable
    <4ac>   DW_AT_decl_file   : 8
    <4ad>   DW_AT_decl_line   : 126
    <4ae>   DW_AT_decl_column : 12
    <4af>   DW_AT_type        : <0xb6>
    <4b3>   DW_AT_data_member_location: 20
 <2><4b4>: Abbrev Number: 1 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x84bf): DMADisableonRxError
    <4b9>   DW_AT_decl_file   : 8
    <4ba>   DW_AT_decl_line   : 129
    <4bb>   DW_AT_decl_column : 12
    <4bc>   DW_AT_type        : <0xb6>
    <4c0>   DW_AT_data_member_location: 24
 <2><4c1>: Abbrev Number: 1 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xf0a4b): AutoBaudRateEnable
    <4c6>   DW_AT_decl_file   : 8
    <4c7>   DW_AT_decl_line   : 132
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xb6>
    <4cd>   DW_AT_data_member_location: 28
 <2><4ce>: Abbrev Number: 1 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xd1300): AutoBaudRateMode
    <4d3>   DW_AT_decl_file   : 8
    <4d4>   DW_AT_decl_line   : 135
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xb6>
    <4da>   DW_AT_data_member_location: 32
 <2><4db>: Abbrev Number: 1 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x6cbc1): MSBFirst
    <4e0>   DW_AT_decl_file   : 8
    <4e1>   DW_AT_decl_line   : 139
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xb6>
    <4e7>   DW_AT_data_member_location: 36
 <2><4e8>: Abbrev Number: 0
 <1><4e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ea>   DW_AT_name        : (indirect string, offset: 0xb7061): UART_AdvFeatureInitTypeDef
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 141
    <4f0>   DW_AT_decl_column : 3
    <4f1>   DW_AT_type        : <0x45e>
 <1><4f5>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x4aa1a): HAL_UART_StateTypeDef
    <4fa>   DW_AT_decl_file   : 8
    <4fb>   DW_AT_decl_line   : 183
    <4fc>   DW_AT_decl_column : 18
    <4fd>   DW_AT_type        : <0xb6>
 <1><501>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <502>   DW_AT_type        : <0x4f5>
 <1><506>: Abbrev Number: 2 (DW_TAG_typedef)
    <507>   DW_AT_name        : (indirect string, offset: 0x646e1): HAL_UART_RxTypeTypeDef
    <50b>   DW_AT_decl_file   : 8
    <50c>   DW_AT_decl_line   : 207
    <50d>   DW_AT_decl_column : 18
    <50e>   DW_AT_type        : <0xb6>
 <1><512>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <513>   DW_AT_type        : <0x506>
 <1><517>: Abbrev Number: 2 (DW_TAG_typedef)
    <518>   DW_AT_name        : (indirect string, offset: 0x1e7a9): HAL_UART_RxEventTypeTypeDef
    <51c>   DW_AT_decl_file   : 8
    <51d>   DW_AT_decl_line   : 218
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0xb6>
 <1><523>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <524>   DW_AT_type        : <0x517>
 <1><528>: Abbrev Number: 21 (DW_TAG_structure_type)
    <529>   DW_AT_name        : (indirect string, offset: 0x8eb44): __UART_HandleTypeDef
    <52d>   DW_AT_byte_size   : 136
    <52e>   DW_AT_decl_file   : 8
    <52f>   DW_AT_decl_line   : 223
    <530>   DW_AT_decl_column : 16
    <530>   DW_AT_sibling     : <0x642>
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0xc8e8a): Instance
    <539>   DW_AT_decl_file   : 8
    <53a>   DW_AT_decl_line   : 225
    <53b>   DW_AT_decl_column : 29
    <53c>   DW_AT_type        : <0x642>
    <540>   DW_AT_data_member_location: 0
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0xfcad5): Init
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 227
    <548>   DW_AT_decl_column : 28
    <549>   DW_AT_type        : <0x452>
    <54d>   DW_AT_data_member_location: 4
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0xd7f6d): AdvancedInit
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 229
    <555>   DW_AT_decl_column : 30
    <556>   DW_AT_type        : <0x4e9>
    <55a>   DW_AT_data_member_location: 36
 <2><55b>: Abbrev Number: 1 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x75e6c): pTxBuffPtr
    <560>   DW_AT_decl_file   : 8
    <561>   DW_AT_decl_line   : 231
    <562>   DW_AT_decl_column : 29
    <563>   DW_AT_type        : <0x647>
    <567>   DW_AT_data_member_location: 76
 <2><568>: Abbrev Number: 1 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x67858): TxXferSize
    <56d>   DW_AT_decl_file   : 8
    <56e>   DW_AT_decl_line   : 233
    <56f>   DW_AT_decl_column : 28
    <570>   DW_AT_type        : <0xa5>
    <574>   DW_AT_data_member_location: 80
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xfd016): TxXferCount
    <57a>   DW_AT_decl_file   : 8
    <57b>   DW_AT_decl_line   : 235
    <57c>   DW_AT_decl_column : 28
    <57d>   DW_AT_type        : <0xb1>
    <581>   DW_AT_data_member_location: 82
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xe4eff): pRxBuffPtr
    <587>   DW_AT_decl_file   : 8
    <588>   DW_AT_decl_line   : 237
    <589>   DW_AT_decl_column : 29
    <58a>   DW_AT_type        : <0x3d7>
    <58e>   DW_AT_data_member_location: 84
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x7af57): RxXferSize
    <594>   DW_AT_decl_file   : 8
    <595>   DW_AT_decl_line   : 239
    <596>   DW_AT_decl_column : 28
    <597>   DW_AT_type        : <0xa5>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 1 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xfcae2): RxXferCount
    <5a1>   DW_AT_decl_file   : 8
    <5a2>   DW_AT_decl_line   : 241
    <5a3>   DW_AT_decl_column : 28
    <5a4>   DW_AT_type        : <0xb1>
    <5a8>   DW_AT_data_member_location: 90
 <2><5a9>: Abbrev Number: 1 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xfe5c7): Mask
    <5ae>   DW_AT_decl_file   : 8
    <5af>   DW_AT_decl_line   : 243
    <5b0>   DW_AT_decl_column : 28
    <5b1>   DW_AT_type        : <0xa5>
    <5b5>   DW_AT_data_member_location: 92
 <2><5b6>: Abbrev Number: 1 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xcda1d): ReceptionType
    <5bb>   DW_AT_decl_file   : 8
    <5bc>   DW_AT_decl_line   : 254
    <5bd>   DW_AT_decl_column : 31
    <5be>   DW_AT_type        : <0x512>
    <5c2>   DW_AT_data_member_location: 96
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x1227b): RxEventType
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 256
    <5cb>   DW_AT_decl_column : 36
    <5cc>   DW_AT_type        : <0x523>
    <5d0>   DW_AT_data_member_location: 100
 <2><5d1>: Abbrev Number: 3 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xd45c7): RxISR
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 258
    <5d9>   DW_AT_decl_column : 10
    <5da>   DW_AT_type        : <0x65c>
    <5de>   DW_AT_data_member_location: 104
 <2><5df>: Abbrev Number: 3 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x7be4f): TxISR
    <5e4>   DW_AT_decl_file   : 8
    <5e5>   DW_AT_decl_line   : 260
    <5e7>   DW_AT_decl_column : 10
    <5e8>   DW_AT_type        : <0x65c>
    <5ec>   DW_AT_data_member_location: 108
 <2><5ed>: Abbrev Number: 3 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xca1c1): hdmatx
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 262
    <5f5>   DW_AT_decl_column : 29
    <5f6>   DW_AT_type        : <0x3dc>
    <5fa>   DW_AT_data_member_location: 112
 <2><5fb>: Abbrev Number: 3 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xef3a6): hdmarx
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 264
    <603>   DW_AT_decl_column : 29
    <604>   DW_AT_type        : <0x3dc>
    <608>   DW_AT_data_member_location: 116
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xaf786): Lock
    <60e>   DW_AT_decl_file   : 8
    <60f>   DW_AT_decl_line   : 266
    <611>   DW_AT_decl_column : 29
    <612>   DW_AT_type        : <0x242>
    <616>   DW_AT_data_member_location: 120
 <2><617>: Abbrev Number: 3 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x63a83): gState
    <61c>   DW_AT_decl_file   : 8
    <61d>   DW_AT_decl_line   : 268
    <61f>   DW_AT_decl_column : 33
    <620>   DW_AT_type        : <0x501>
    <624>   DW_AT_data_member_location: 124
 <2><625>: Abbrev Number: 3 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xddb6e): RxState
    <62a>   DW_AT_decl_file   : 8
    <62b>   DW_AT_decl_line   : 272
    <62d>   DW_AT_decl_column : 33
    <62e>   DW_AT_type        : <0x501>
    <632>   DW_AT_data_member_location: 128
 <2><633>: Abbrev Number: 3 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xf1056): ErrorCode
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 275
    <63b>   DW_AT_decl_column : 33
    <63c>   DW_AT_type        : <0xc2>
    <640>   DW_AT_data_member_location: 132
 <2><641>: Abbrev Number: 0
 <1><642>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <643>   DW_AT_byte_size   : 4
    <643>   DW_AT_type        : <0x20a>
 <1><647>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <648>   DW_AT_type        : <0xa0>
 <1><64c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <64d>   DW_AT_prototyped  : 1
    <64d>   DW_AT_sibling     : <0x657>
 <2><651>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <652>   DW_AT_type        : <0x657>
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <658>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x528>
 <1><65c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <65d>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x64c>
 <1><661>: Abbrev Number: 15 (DW_TAG_typedef)
    <662>   DW_AT_name        : (indirect string, offset: 0x8eb46): UART_HandleTypeDef
    <666>   DW_AT_decl_file   : 8
    <667>   DW_AT_decl_line   : 297
    <669>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x528>
 <1><66d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <66e>   DW_AT_byte_size   : 4
    <66e>   DW_AT_type        : <0x672>
 <1><672>: Abbrev Number: 5 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 1
    <674>   DW_AT_encoding    : 8	(unsigned char)
    <675>   DW_AT_name        : (indirect string, offset: 0x4f304): char
 <1><679>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <67a>   DW_AT_byte_size   : 4
    <67a>   DW_AT_type        : <0x67e>
 <1><67e>: Abbrev Number: 31 (DW_TAG_const_type)
 <1><67f>: Abbrev Number: 12 (DW_TAG_array_type)
    <680>   DW_AT_type        : <0x94>
    <684>   DW_AT_sibling     : <0x68f>
 <2><688>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <689>   DW_AT_type        : <0x8d>
    <68d>   DW_AT_upper_bound : 131
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 7 (DW_TAG_variable)
    <690>   DW_AT_name        : (indirect string, offset: 0xe2c7): commandSetGNSS_Config
    <694>   DW_AT_decl_file   : 9
    <695>   DW_AT_decl_line   : 30
    <696>   DW_AT_decl_column : 16
    <697>   DW_AT_type        : <0x67f>
    <69b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6a1>: Abbrev Number: 12 (DW_TAG_array_type)
    <6a2>   DW_AT_type        : <0x94>
    <6a6>   DW_AT_sibling     : <0x6b1>
 <2><6aa>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6ab>   DW_AT_type        : <0x8d>
    <6af>   DW_AT_upper_bound : 26
 <2><6b0>: Abbrev Number: 0
 <1><6b1>: Abbrev Number: 7 (DW_TAG_variable)
    <6b2>   DW_AT_name        : (indirect string, offset: 0xe4e0b): commandUart1Ouput
    <6b6>   DW_AT_decl_file   : 9
    <6b7>   DW_AT_decl_line   : 48
    <6b8>   DW_AT_decl_column : 16
    <6b9>   DW_AT_type        : <0x6a1>
    <6bd>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6c3>: Abbrev Number: 12 (DW_TAG_array_type)
    <6c4>   DW_AT_type        : <0x94>
    <6c8>   DW_AT_sibling     : <0x6d3>
 <2><6cc>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6cd>   DW_AT_type        : <0x8d>
    <6d1>   DW_AT_upper_bound : 10
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 7 (DW_TAG_variable)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x6e88c): commandUBXTimeUTC
    <6d8>   DW_AT_decl_file   : 9
    <6d9>   DW_AT_decl_line   : 57
    <6da>   DW_AT_decl_column : 16
    <6db>   DW_AT_type        : <0x6c3>
    <6df>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6e5>: Abbrev Number: 12 (DW_TAG_array_type)
    <6e6>   DW_AT_type        : <0x94>
    <6ea>   DW_AT_sibling     : <0x6f5>
 <2><6ee>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6ef>   DW_AT_type        : <0x8d>
    <6f3>   DW_AT_upper_bound : 7
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 7 (DW_TAG_variable)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xa4fd2): pollUBXTimeUTC
    <6fa>   DW_AT_decl_file   : 9
    <6fb>   DW_AT_decl_line   : 60
    <6fc>   DW_AT_decl_column : 16
    <6fd>   DW_AT_type        : <0x6e5>
    <701>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><707>: Abbrev Number: 12 (DW_TAG_array_type)
    <708>   DW_AT_type        : <0x94>
    <70c>   DW_AT_sibling     : <0x717>
 <2><710>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <711>   DW_AT_type        : <0x8d>
    <715>   DW_AT_upper_bound : 92
 <2><716>: Abbrev Number: 0
 <1><717>: Abbrev Number: 7 (DW_TAG_variable)
    <718>   DW_AT_name        : (indirect string, offset: 0xbba46): commandSetTP1_atNVTRate
    <71c>   DW_AT_decl_file   : 9
    <71d>   DW_AT_decl_line   : 79
    <71e>   DW_AT_decl_column : 16
    <71f>   DW_AT_type        : <0x707>
    <723>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><729>: Abbrev Number: 12 (DW_TAG_array_type)
    <72a>   DW_AT_type        : <0x94>
    <72e>   DW_AT_sibling     : <0x739>
 <2><732>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <733>   DW_AT_type        : <0x8d>
    <737>   DW_AT_upper_bound : 100
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 7 (DW_TAG_variable)
    <73a>   DW_AT_name        : (indirect string, offset: 0xcf95a): commandSetTP2
    <73e>   DW_AT_decl_file   : 9
    <73f>   DW_AT_decl_line   : 105
    <740>   DW_AT_decl_column : 16
    <741>   DW_AT_type        : <0x729>
    <745>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><74b>: Abbrev Number: 12 (DW_TAG_array_type)
    <74c>   DW_AT_type        : <0x94>
    <750>   DW_AT_sibling     : <0x75b>
 <2><754>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <755>   DW_AT_type        : <0x8d>
    <759>   DW_AT_upper_bound : 28
 <2><75a>: Abbrev Number: 0
 <1><75b>: Abbrev Number: 7 (DW_TAG_variable)
    <75c>   DW_AT_name        : (indirect string, offset: 0xdfb75): commandMeasureRate
    <760>   DW_AT_decl_file   : 9
    <761>   DW_AT_decl_line   : 122
    <762>   DW_AT_decl_column : 16
    <763>   DW_AT_type        : <0x74b>
    <767>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><76d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <76e>   DW_AT_encoding    : 7	(unsigned)
    <76e>   DW_AT_byte_size   : 1
    <76e>   DW_AT_type        : <0x3d>
    <772>   DW_AT_decl_file   : 10
    <773>   DW_AT_decl_line   : 27
    <774>   DW_AT_decl_column : 14
    <775>   DW_AT_sibling     : <0x78c>
 <2><779>: Abbrev Number: 8 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0xc775e): INIT
    <77e>   DW_AT_const_value : 0
 <2><77f>: Abbrev Number: 8 (DW_TAG_enumerator)
    <780>   DW_AT_name        : (indirect string, offset: 0x8fbc3): NMEA
    <784>   DW_AT_const_value : 1
 <2><785>: Abbrev Number: 18 (DW_TAG_enumerator)
    <786>   DW_AT_name        : UBX
    <78a>   DW_AT_const_value : 2
 <2><78b>: Abbrev Number: 0
 <1><78c>: Abbrev Number: 2 (DW_TAG_typedef)
    <78d>   DW_AT_name        : (indirect string, offset: 0xd76eb): OutputProtocol
    <791>   DW_AT_decl_file   : 10
    <792>   DW_AT_decl_line   : 31
    <793>   DW_AT_decl_column : 3
    <794>   DW_AT_type        : <0x76d>
 <1><798>: Abbrev Number: 11 (DW_TAG_structure_type)
    <799>   DW_AT_byte_size   : 8
    <79a>   DW_AT_decl_file   : 10
    <79b>   DW_AT_decl_line   : 32
    <79c>   DW_AT_decl_column : 9
    <79c>   DW_AT_sibling     : <0x7bb>
 <2><7a0>: Abbrev Number: 1 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x254ce): buffer
    <7a5>   DW_AT_decl_file   : 10
    <7a6>   DW_AT_decl_line   : 33
    <7a7>   DW_AT_decl_column : 11
    <7a8>   DW_AT_type        : <0x3d7>
    <7ac>   DW_AT_data_member_location: 0
 <2><7ad>: Abbrev Number: 1 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0xfa05c): size
    <7b2>   DW_AT_decl_file   : 10
    <7b3>   DW_AT_decl_line   : 34
    <7b4>   DW_AT_decl_column : 9
    <7b5>   DW_AT_type        : <0x216>
    <7b9>   DW_AT_data_member_location: 4
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x80b9f): DynamicBuffer
    <7c0>   DW_AT_decl_file   : 10
    <7c1>   DW_AT_decl_line   : 35
    <7c2>   DW_AT_decl_column : 3
    <7c3>   DW_AT_type        : <0x798>
 <1><7c7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <7c8>   DW_AT_byte_size   : 8
    <7c9>   DW_AT_decl_file   : 10
    <7ca>   DW_AT_decl_line   : 37
    <7cb>   DW_AT_decl_column : 9
    <7cb>   DW_AT_sibling     : <0x803>
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xd6f2c): CLASS
    <7d4>   DW_AT_decl_file   : 10
    <7d5>   DW_AT_decl_line   : 38
    <7d6>   DW_AT_decl_column : 10
    <7d7>   DW_AT_type        : <0x94>
    <7db>   DW_AT_data_member_location: 0
 <2><7dc>: Abbrev Number: 23 (DW_TAG_member)
    <7dd>   DW_AT_name        : ID
    <7e0>   DW_AT_decl_file   : 10
    <7e1>   DW_AT_decl_line   : 39
    <7e2>   DW_AT_decl_column : 10
    <7e3>   DW_AT_type        : <0x94>
    <7e7>   DW_AT_data_member_location: 1
 <2><7e8>: Abbrev Number: 1 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x1492): len_payload
    <7ed>   DW_AT_decl_file   : 10
    <7ee>   DW_AT_decl_line   : 40
    <7ef>   DW_AT_decl_column : 11
    <7f0>   DW_AT_type        : <0xa5>
    <7f4>   DW_AT_data_member_location: 2
 <2><7f5>: Abbrev Number: 1 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0xf2212): brute
    <7fa>   DW_AT_decl_file   : 10
    <7fb>   DW_AT_decl_line   : 41
    <7fc>   DW_AT_decl_column : 17
    <7fd>   DW_AT_type        : <0x803>
    <801>   DW_AT_data_member_location: 4
 <2><802>: Abbrev Number: 0
 <1><803>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <804>   DW_AT_byte_size   : 4
    <804>   DW_AT_type        : <0x7bb>
 <1><808>: Abbrev Number: 2 (DW_TAG_typedef)
    <809>   DW_AT_name        : (indirect string, offset: 0x66ec3): UBXMessage_parsed
    <80d>   DW_AT_decl_file   : 10
    <80e>   DW_AT_decl_line   : 42
    <80f>   DW_AT_decl_column : 2
    <810>   DW_AT_type        : <0x7c7>
 <1><814>: Abbrev Number: 11 (DW_TAG_structure_type)
    <815>   DW_AT_byte_size   : 4
    <816>   DW_AT_decl_file   : 10
    <817>   DW_AT_decl_line   : 44
    <818>   DW_AT_decl_column : 9
    <818>   DW_AT_sibling     : <0x82a>
 <2><81c>: Abbrev Number: 1 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x75785): NMEA_Brute
    <821>   DW_AT_decl_file   : 10
    <822>   DW_AT_decl_line   : 45
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0x66d>
    <828>   DW_AT_data_member_location: 0
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 2 (DW_TAG_typedef)
    <82b>   DW_AT_name        : (indirect string, offset: 0x75464): NMEAMessage_parsed
    <82f>   DW_AT_decl_file   : 10
    <830>   DW_AT_decl_line   : 46
    <831>   DW_AT_decl_column : 2
    <832>   DW_AT_type        : <0x814>
 <1><836>: Abbrev Number: 32 (DW_TAG_union_type)
    <837>   DW_AT_byte_size   : 4
    <838>   DW_AT_decl_file   : 10
    <839>   DW_AT_decl_line   : 48
    <83a>   DW_AT_decl_column : 9
    <83b>   DW_AT_sibling     : <0x856>
 <2><83f>: Abbrev Number: 24 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x4f08d): NMEAMessage
    <844>   DW_AT_decl_file   : 10
    <844>   DW_AT_decl_line   : 49
    <845>   DW_AT_decl_column : 22
    <846>   DW_AT_type        : <0x856>
 <2><84a>: Abbrev Number: 24 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x178d5): UBXMessage
    <84f>   DW_AT_decl_file   : 10
    <84f>   DW_AT_decl_line   : 50
    <850>   DW_AT_decl_column : 21
    <851>   DW_AT_type        : <0x85b>
 <2><855>: Abbrev Number: 0
 <1><856>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 4
    <857>   DW_AT_type        : <0x82a>
 <1><85b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <85c>   DW_AT_byte_size   : 4
    <85c>   DW_AT_type        : <0x808>
 <1><860>: Abbrev Number: 2 (DW_TAG_typedef)
    <861>   DW_AT_name        : (indirect string, offset: 0x7ea98): MessageStruct
    <865>   DW_AT_decl_file   : 10
    <866>   DW_AT_decl_line   : 51
    <867>   DW_AT_decl_column : 2
    <868>   DW_AT_type        : <0x836>
 <1><86c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <86d>   DW_AT_byte_size   : 8
    <86e>   DW_AT_decl_file   : 10
    <86f>   DW_AT_decl_line   : 53
    <870>   DW_AT_decl_column : 9
    <870>   DW_AT_sibling     : <0x88f>
 <2><874>: Abbrev Number: 1 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x21c15): typeMessage
    <879>   DW_AT_decl_file   : 10
    <87a>   DW_AT_decl_line   : 54
    <87b>   DW_AT_decl_column : 17
    <87c>   DW_AT_type        : <0x78c>
    <880>   DW_AT_data_member_location: 0
 <2><881>: Abbrev Number: 1 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0x4f091): Message
    <886>   DW_AT_decl_file   : 10
    <887>   DW_AT_decl_line   : 55
    <888>   DW_AT_decl_column : 16
    <889>   DW_AT_type        : <0x860>
    <88d>   DW_AT_data_member_location: 4
 <2><88e>: Abbrev Number: 0
 <1><88f>: Abbrev Number: 2 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0x65b71): GenericMessage
    <894>   DW_AT_decl_file   : 10
    <895>   DW_AT_decl_line   : 56
    <896>   DW_AT_decl_column : 2
    <897>   DW_AT_type        : <0x86c>
 <1><89b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <89c>   DW_AT_encoding    : 7	(unsigned)
    <89c>   DW_AT_byte_size   : 1
    <89c>   DW_AT_type        : <0x3d>
    <8a0>   DW_AT_decl_file   : 11
    <8a1>   DW_AT_decl_line   : 25
    <8a2>   DW_AT_decl_column : 14
    <8a3>   DW_AT_sibling     : <0x8ba>
 <2><8a7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : RAW
    <8ac>   DW_AT_const_value : 0
 <2><8ad>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : HEX
    <8b2>   DW_AT_const_value : 1
 <2><8b3>: Abbrev Number: 8 (DW_TAG_enumerator)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xbdd79): ASCII
    <8b8>   DW_AT_const_value : 2
 <2><8b9>: Abbrev Number: 0
 <1><8ba>: Abbrev Number: 2 (DW_TAG_typedef)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xe1f3a): OutputType
    <8bf>   DW_AT_decl_file   : 11
    <8c0>   DW_AT_decl_line   : 29
    <8c1>   DW_AT_decl_column : 3
    <8c2>   DW_AT_type        : <0x89b>
 <1><8c6>: Abbrev Number: 25 (DW_TAG_variable)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xff526): type
    <8cb>   DW_AT_decl_file   : 11
    <8cb>   DW_AT_decl_line   : 30
    <8cc>   DW_AT_decl_column : 19
    <8cd>   DW_AT_type        : <0x8ba>
    <8d1>   DW_AT_external    : 1
    <8d1>   DW_AT_declaration : 1
 <1><8d1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8d2>   DW_AT_byte_size   : 12
    <8d3>   DW_AT_decl_file   : 11
    <8d4>   DW_AT_decl_line   : 32
    <8d5>   DW_AT_decl_column : 9
    <8d5>   DW_AT_sibling     : <0x900>
 <2><8d9>: Abbrev Number: 1 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0xae6b7): huart
    <8de>   DW_AT_decl_file   : 11
    <8df>   DW_AT_decl_line   : 33
    <8e0>   DW_AT_decl_column : 22
    <8e1>   DW_AT_type        : <0x900>
    <8e5>   DW_AT_data_member_location: 0
 <2><8e6>: Abbrev Number: 1 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x8b500): huartDebug
    <8eb>   DW_AT_decl_file   : 11
    <8ec>   DW_AT_decl_line   : 34
    <8ed>   DW_AT_decl_column : 22
    <8ee>   DW_AT_type        : <0x900>
    <8f2>   DW_AT_data_member_location: 4
 <2><8f3>: Abbrev Number: 23 (DW_TAG_member)
    <8f4>   DW_AT_name        : Rx
    <8f7>   DW_AT_decl_file   : 11
    <8f8>   DW_AT_decl_line   : 35
    <8f9>   DW_AT_decl_column : 17
    <8fa>   DW_AT_type        : <0x803>
    <8fe>   DW_AT_data_member_location: 8
 <2><8ff>: Abbrev Number: 0
 <1><900>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <901>   DW_AT_byte_size   : 4
    <901>   DW_AT_type        : <0x661>
 <1><905>: Abbrev Number: 2 (DW_TAG_typedef)
    <906>   DW_AT_name        : (indirect string, offset: 0x3e54f): GNSSCom_HandleTypeDef
    <90a>   DW_AT_decl_file   : 11
    <90b>   DW_AT_decl_line   : 36
    <90c>   DW_AT_decl_column : 3
    <90d>   DW_AT_type        : <0x8d1>
 <1><911>: Abbrev Number: 25 (DW_TAG_variable)
    <912>   DW_AT_name        : (indirect string, offset: 0x41427): hGNSSCom
    <916>   DW_AT_decl_file   : 11
    <916>   DW_AT_decl_line   : 37
    <917>   DW_AT_decl_column : 30
    <918>   DW_AT_type        : <0x905>
    <91c>   DW_AT_external    : 1
    <91c>   DW_AT_declaration : 1
 <1><91c>: Abbrev Number: 26 (DW_TAG_variable)
    <91d>   DW_AT_specification: <0x911>
    <921>   DW_AT_decl_file   : 1
    <921>   DW_AT_decl_line   : 14
    <922>   DW_AT_decl_column : 23
    <923>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><929>: Abbrev Number: 26 (DW_TAG_variable)
    <92a>   DW_AT_specification: <0x8c6>
    <92e>   DW_AT_decl_file   : 1
    <92e>   DW_AT_decl_line   : 15
    <92f>   DW_AT_decl_column : 12
    <930>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><936>: Abbrev Number: 33 (DW_TAG_variable)
    <937>   DW_AT_name        : (indirect string, offset: 0x3b382): protocol
    <93b>   DW_AT_decl_file   : 1
    <93c>   DW_AT_decl_line   : 16
    <93d>   DW_AT_decl_column : 16
    <93e>   DW_AT_type        : <0x78c>
    <942>   DW_AT_external    : 1
    <942>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><948>: Abbrev Number: 19 (DW_TAG_subprogram)
    <949>   DW_AT_external    : 1
    <949>   DW_AT_name        : (indirect string, offset: 0xbfa61): memcpy
    <94d>   DW_AT_decl_file   : 12
    <94e>   DW_AT_decl_line   : 31
    <94f>   DW_AT_decl_column : 9
    <950>   DW_AT_prototyped  : 1
    <950>   DW_AT_type        : <0x3af>
    <954>   DW_AT_declaration : 1
    <954>   DW_AT_sibling     : <0x968>
 <2><958>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <959>   DW_AT_type        : <0x3af>
 <2><95d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <95e>   DW_AT_type        : <0x679>
 <2><962>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <963>   DW_AT_type        : <0x216>
 <2><967>: Abbrev Number: 0
 <1><968>: Abbrev Number: 34 (DW_TAG_subprogram)
    <969>   DW_AT_external    : 1
    <969>   DW_AT_name        : (indirect string, offset: 0x5b9c9): updateMemoryUsage
    <96d>   DW_AT_decl_file   : 15
    <96e>   DW_AT_decl_line   : 26
    <96f>   DW_AT_decl_column : 6
    <970>   DW_AT_prototyped  : 1
    <970>   DW_AT_declaration : 1
 <1><970>: Abbrev Number: 19 (DW_TAG_subprogram)
    <971>   DW_AT_external    : 1
    <971>   DW_AT_name        : (indirect string, offset: 0x69619): realloc
    <975>   DW_AT_decl_file   : 13
    <976>   DW_AT_decl_line   : 145
    <977>   DW_AT_decl_column : 7
    <978>   DW_AT_prototyped  : 1
    <978>   DW_AT_type        : <0x3af>
    <97c>   DW_AT_declaration : 1
    <97c>   DW_AT_sibling     : <0x98b>
 <2><980>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <981>   DW_AT_type        : <0x3af>
 <2><985>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <986>   DW_AT_type        : <0x216>
 <2><98a>: Abbrev Number: 0
 <1><98b>: Abbrev Number: 35 (DW_TAG_subprogram)
    <98c>   DW_AT_external    : 1
    <98c>   DW_AT_name        : (indirect string, offset: 0x4067a): vPortFree
    <990>   DW_AT_decl_file   : 14
    <991>   DW_AT_decl_line   : 164
    <992>   DW_AT_decl_column : 6
    <993>   DW_AT_prototyped  : 1
    <993>   DW_AT_declaration : 1
    <993>   DW_AT_sibling     : <0x99d>
 <2><997>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <998>   DW_AT_type        : <0x3af>
 <2><99c>: Abbrev Number: 0
 <1><99d>: Abbrev Number: 19 (DW_TAG_subprogram)
    <99e>   DW_AT_external    : 1
    <99e>   DW_AT_name        : (indirect string, offset: 0x8b9ce): pvPortMalloc
    <9a2>   DW_AT_decl_file   : 14
    <9a3>   DW_AT_decl_line   : 163
    <9a4>   DW_AT_decl_column : 7
    <9a5>   DW_AT_prototyped  : 1
    <9a5>   DW_AT_type        : <0x3af>
    <9a9>   DW_AT_declaration : 1
    <9a9>   DW_AT_sibling     : <0x9b3>
 <2><9ad>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9ae>   DW_AT_type        : <0x216>
 <2><9b2>: Abbrev Number: 0
 <1><9b3>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9b4>   DW_AT_external    : 1
    <9b4>   DW_AT_name        : (indirect string, offset: 0x88e97): GNSSCom_MessageAdapter
    <9b8>   DW_AT_decl_file   : 1
    <9b8>   DW_AT_decl_line   : 52
    <9b9>   DW_AT_decl_column : 6
    <9b9>   DW_AT_prototyped  : 1
    <9b9>   DW_AT_low_pc      : 0x80005d8
    <9bd>   DW_AT_high_pc     : 0xc4
    <9c1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9c3>   DW_AT_call_all_tail_calls: 1
    <9c3>   DW_AT_sibling     : <0xa0b>
 <2><9c7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x254ce): buffer
    <9cc>   DW_AT_decl_file   : 1
    <9cc>   DW_AT_decl_line   : 52
    <9cd>   DW_AT_decl_column : 38
    <9ce>   DW_AT_type        : <0x3d7>
    <9d2>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9d5>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9d6>   DW_AT_name        : (indirect string, offset: 0xfa05c): size
    <9da>   DW_AT_decl_file   : 1
    <9da>   DW_AT_decl_line   : 52
    <9db>   DW_AT_decl_column : 53
    <9dc>   DW_AT_type        : <0xa0b>
    <9e0>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><9e3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x5c88f): genericMessage
    <9e8>   DW_AT_decl_file   : 1
    <9e8>   DW_AT_decl_line   : 52
    <9e9>   DW_AT_decl_column : 75
    <9ea>   DW_AT_type        : <0xa10>
    <9ee>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><9f1>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <9f2>   DW_AT_low_pc      : 0x8000680
    <9f6>   DW_AT_high_pc     : 0x14
 <3><9fa>: Abbrev Number: 7 (DW_TAG_variable)
    <9fb>   DW_AT_name        : (indirect string, offset: 0x4f08d): NMEAMessage
    <9ff>   DW_AT_decl_file   : 1
    <a00>   DW_AT_decl_line   : 70
    <a01>   DW_AT_decl_column : 24
    <a02>   DW_AT_type        : <0x856>
    <a06>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><a09>: Abbrev Number: 0
 <2><a0a>: Abbrev Number: 0
 <1><a0b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a0c>   DW_AT_byte_size   : 4
    <a0c>   DW_AT_type        : <0x216>
 <1><a10>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a11>   DW_AT_byte_size   : 4
    <a11>   DW_AT_type        : <0x88f>
 <1><a15>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a16>   DW_AT_external    : 1
    <a16>   DW_AT_name        : (indirect string, offset: 0x502ed): freeBuffer
    <a1a>   DW_AT_decl_file   : 1
    <a1a>   DW_AT_decl_line   : 47
    <a1b>   DW_AT_decl_column : 6
    <a1b>   DW_AT_prototyped  : 1
    <a1b>   DW_AT_low_pc      : 0x80005b8
    <a1f>   DW_AT_high_pc     : 0x20
    <a23>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a25>   DW_AT_call_all_tail_calls: 1
    <a25>   DW_AT_sibling     : <0xa38>
 <2><a29>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a2a>   DW_AT_name        : (indirect string, offset: 0xc498b): bufferDynamic
    <a2e>   DW_AT_decl_file   : 1
    <a2e>   DW_AT_decl_line   : 47
    <a2f>   DW_AT_decl_column : 32
    <a30>   DW_AT_type        : <0x803>
    <a34>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a37>: Abbrev Number: 0
 <1><a38>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a39>   DW_AT_external    : 1
    <a39>   DW_AT_name        : (indirect string, offset: 0x71253): resizeBuffer
    <a3d>   DW_AT_decl_file   : 1
    <a3d>   DW_AT_decl_line   : 40
    <a3e>   DW_AT_decl_column : 6
    <a3e>   DW_AT_prototyped  : 1
    <a3e>   DW_AT_low_pc      : 0
    <a42>   DW_AT_high_pc     : 0x32
    <a46>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a48>   DW_AT_call_all_tail_calls: 1
    <a48>   DW_AT_sibling     : <0xa78>
 <2><a4c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a4d>   DW_AT_name        : (indirect string, offset: 0xc498b): bufferDynamic
    <a51>   DW_AT_decl_file   : 1
    <a51>   DW_AT_decl_line   : 40
    <a52>   DW_AT_decl_column : 34
    <a53>   DW_AT_type        : <0x803>
    <a57>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a5a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x2939c): newSize
    <a5f>   DW_AT_decl_file   : 1
    <a5f>   DW_AT_decl_line   : 40
    <a60>   DW_AT_decl_column : 56
    <a61>   DW_AT_type        : <0x216>
    <a65>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a68>: Abbrev Number: 7 (DW_TAG_variable)
    <a69>   DW_AT_name        : (indirect string, offset: 0x688d3): newData
    <a6d>   DW_AT_decl_file   : 1
    <a6e>   DW_AT_decl_line   : 41
    <a6f>   DW_AT_decl_column : 11
    <a70>   DW_AT_type        : <0x3d7>
    <a74>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a77>: Abbrev Number: 0
 <1><a78>: Abbrev Number: 37 (DW_TAG_subprogram)
    <a79>   DW_AT_external    : 1
    <a79>   DW_AT_name        : (indirect string, offset: 0x2f4a9): initializeBuffer
    <a7d>   DW_AT_decl_file   : 1
    <a7e>   DW_AT_decl_line   : 25
    <a7f>   DW_AT_decl_column : 16
    <a80>   DW_AT_prototyped  : 1
    <a80>   DW_AT_type        : <0x803>
    <a84>   DW_AT_low_pc      : 0x8000570
    <a88>   DW_AT_high_pc     : 0x48
    <a8c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8e>   DW_AT_call_all_tail_calls: 1
    <a8e>   DW_AT_sibling     : <0xab0>
 <2><a92>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a93>   DW_AT_name        : (indirect string, offset: 0xa5c22): initialSize
    <a97>   DW_AT_decl_file   : 1
    <a97>   DW_AT_decl_line   : 25
    <a98>   DW_AT_decl_column : 40
    <a99>   DW_AT_type        : <0x216>
    <a9d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><aa0>: Abbrev Number: 7 (DW_TAG_variable)
    <aa1>   DW_AT_name        : (indirect string, offset: 0xc498b): bufferDynamic
    <aa5>   DW_AT_decl_file   : 1
    <aa6>   DW_AT_decl_line   : 26
    <aa7>   DW_AT_decl_column : 17
    <aa8>   DW_AT_type        : <0x803>
    <aac>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><aaf>: Abbrev Number: 0
 <1><ab0>: Abbrev Number: 38 (DW_TAG_subprogram)
    <ab1>   DW_AT_external    : 1
    <ab1>   DW_AT_name        : (indirect string, offset: 0x9db5c): GNSSCom_Init
    <ab5>   DW_AT_decl_file   : 1
    <ab6>   DW_AT_decl_line   : 18
    <ab7>   DW_AT_decl_column : 6
    <ab8>   DW_AT_prototyped  : 1
    <ab8>   DW_AT_low_pc      : 0
    <abc>   DW_AT_high_pc     : 0x28
    <ac0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ac2>   DW_AT_call_all_calls: 1
 <2><ac2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ac3>   DW_AT_name        : (indirect string, offset: 0xae6b7): huart
    <ac7>   DW_AT_decl_file   : 1
    <ac7>   DW_AT_decl_line   : 18
    <ac8>   DW_AT_decl_column : 39
    <ac9>   DW_AT_type        : <0x900>
    <acd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ad0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x8b500): huartDebug
    <ad5>   DW_AT_decl_file   : 1
    <ad5>   DW_AT_decl_line   : 18
    <ad6>   DW_AT_decl_column : 65
    <ad7>   DW_AT_type        : <0x900>
    <adb>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ade>: Abbrev Number: 0
 <1><adf>: Abbrev Number: 0
  Compilation Unit @ offset 0xae0:
   Length:        0x6f2 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x245
   Pointer Size:  4
 <0><aec>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <aed>   DW_AT_producer    : (indirect string, offset: 0x404ac): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <af1>   DW_AT_language    : 29	(C11)
    <af2>   DW_AT_name        : (indirect string, offset: 0xf7878): ../Core/Src/GNSS/debugFormatter.c
    <af6>   DW_AT_comp_dir    : (indirect string, offset: 0x4bf51): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <afa>   DW_AT_ranges      : 0x38
    <afe>   DW_AT_low_pc      : 0
    <b02>   DW_AT_stmt_list   : 0xcf5
    <b06>   DW_AT_macros      : 0x26adf
 <1><b0a>: Abbrev Number: 5 (DW_TAG_base_type)
    <b0b>   DW_AT_byte_size   : 1
    <b0c>   DW_AT_encoding    : 6	(signed char)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x7be63): signed char
 <1><b11>: Abbrev Number: 4 (DW_TAG_typedef)
    <b12>   DW_AT_name        : (indirect string, offset: 0x4746f): __uint8_t
    <b16>   DW_AT_decl_file   : 2
    <b17>   DW_AT_decl_line   : 43
    <b18>   DW_AT_decl_column : 24
    <b19>   DW_AT_type        : <0xb1d>
 <1><b1d>: Abbrev Number: 5 (DW_TAG_base_type)
    <b1e>   DW_AT_byte_size   : 1
    <b1f>   DW_AT_encoding    : 8	(unsigned char)
    <b20>   DW_AT_name        : (indirect string, offset: 0xee1aa): unsigned char
 <1><b24>: Abbrev Number: 5 (DW_TAG_base_type)
    <b25>   DW_AT_byte_size   : 2
    <b26>   DW_AT_encoding    : 5	(signed)
    <b27>   DW_AT_name        : (indirect string, offset: 0xb6df2): short int
 <1><b2b>: Abbrev Number: 5 (DW_TAG_base_type)
    <b2c>   DW_AT_byte_size   : 2
    <b2d>   DW_AT_encoding    : 7	(unsigned)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xec5bd): short unsigned int
 <1><b32>: Abbrev Number: 5 (DW_TAG_base_type)
    <b33>   DW_AT_byte_size   : 4
    <b34>   DW_AT_encoding    : 5	(signed)
    <b35>   DW_AT_name        : (indirect string, offset: 0x1495a): long int
 <1><b39>: Abbrev Number: 4 (DW_TAG_typedef)
    <b3a>   DW_AT_name        : (indirect string, offset: 0x9db69): __uint32_t
    <b3e>   DW_AT_decl_file   : 2
    <b3f>   DW_AT_decl_line   : 79
    <b40>   DW_AT_decl_column : 25
    <b41>   DW_AT_type        : <0xb45>
 <1><b45>: Abbrev Number: 5 (DW_TAG_base_type)
    <b46>   DW_AT_byte_size   : 4
    <b47>   DW_AT_encoding    : 7	(unsigned)
    <b48>   DW_AT_name        : (indirect string, offset: 0x5dc6d): long unsigned int
 <1><b4c>: Abbrev Number: 5 (DW_TAG_base_type)
    <b4d>   DW_AT_byte_size   : 8
    <b4e>   DW_AT_encoding    : 5	(signed)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x70405): long long int
 <1><b53>: Abbrev Number: 5 (DW_TAG_base_type)
    <b54>   DW_AT_byte_size   : 8
    <b55>   DW_AT_encoding    : 7	(unsigned)
    <b56>   DW_AT_name        : (indirect string, offset: 0x33059): long long unsigned int
 <1><b5a>: Abbrev Number: 20 (DW_TAG_base_type)
    <b5b>   DW_AT_byte_size   : 4
    <b5c>   DW_AT_encoding    : 5	(signed)
    <b5d>   DW_AT_name        : int
 <1><b61>: Abbrev Number: 13 (DW_TAG_const_type)
    <b62>   DW_AT_type        : <0xb5a>
 <1><b66>: Abbrev Number: 5 (DW_TAG_base_type)
    <b67>   DW_AT_byte_size   : 4
    <b68>   DW_AT_encoding    : 7	(unsigned)
    <b69>   DW_AT_name        : (indirect string, offset: 0x13e56): unsigned int
 <1><b6d>: Abbrev Number: 4 (DW_TAG_typedef)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xa14c): size_t
    <b72>   DW_AT_decl_file   : 3
    <b73>   DW_AT_decl_line   : 214
    <b74>   DW_AT_decl_column : 23
    <b75>   DW_AT_type        : <0xb66>
 <1><b79>: Abbrev Number: 5 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 8
    <b7b>   DW_AT_encoding    : 4	(float)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x16757): long double
 <1><b80>: Abbrev Number: 4 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x3bf75): __gnuc_va_list
    <b85>   DW_AT_decl_file   : 4
    <b86>   DW_AT_decl_line   : 40
    <b87>   DW_AT_decl_column : 27
    <b88>   DW_AT_type        : <0xb8c>
 <1><b8c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <b8d>   DW_AT_name        : (indirect string, offset: 0xb5741): __va_list
    <b91>   DW_AT_byte_size   : 4
    <b92>   DW_AT_decl_file   : 15
    <b93>   DW_AT_decl_line   : 0
    <b94>   DW_AT_sibling     : <0xba3>
 <2><b98>: Abbrev Number: 22 (DW_TAG_member)
    <b99>   DW_AT_name        : (indirect string, offset: 0xf7805): __ap
    <b9d>   DW_AT_type        : <0xba3>
    <ba1>   DW_AT_data_member_location: 0
    <ba2>   DW_AT_artificial  : 1
 <2><ba2>: Abbrev Number: 0
 <1><ba3>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <ba4>   DW_AT_byte_size   : 4
 <1><ba5>: Abbrev Number: 4 (DW_TAG_typedef)
    <ba6>   DW_AT_name        : (indirect string, offset: 0xb5743): va_list
    <baa>   DW_AT_decl_file   : 5
    <bab>   DW_AT_decl_line   : 46
    <bac>   DW_AT_decl_column : 24
    <bad>   DW_AT_type        : <0xb80>
 <1><bb1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <bb2>   DW_AT_byte_size   : 4
    <bb2>   DW_AT_type        : <0xbb6>
 <1><bb6>: Abbrev Number: 5 (DW_TAG_base_type)
    <bb7>   DW_AT_byte_size   : 1
    <bb8>   DW_AT_encoding    : 8	(unsigned char)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x4f304): char
 <1><bbd>: Abbrev Number: 13 (DW_TAG_const_type)
    <bbe>   DW_AT_type        : <0xbb6>
 <1><bc2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <bc3>   DW_AT_byte_size   : 4
    <bc3>   DW_AT_type        : <0xbbd>
 <1><bc7>: Abbrev Number: 4 (DW_TAG_typedef)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x47471): uint8_t
    <bcc>   DW_AT_decl_file   : 6
    <bcd>   DW_AT_decl_line   : 24
    <bce>   DW_AT_decl_column : 19
    <bcf>   DW_AT_type        : <0xb11>
 <1><bd3>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x113a6): uint32_t
    <bd8>   DW_AT_decl_file   : 6
    <bd9>   DW_AT_decl_line   : 48
    <bda>   DW_AT_decl_column : 20
    <bdb>   DW_AT_type        : <0xb39>
 <1><bdf>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <be0>   DW_AT_byte_size   : 4
    <be0>   DW_AT_type        : <0xbc7>
 <1><be4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <be5>   DW_AT_byte_size   : 18
    <be6>   DW_AT_decl_file   : 7
    <be7>   DW_AT_decl_line   : 11
    <be8>   DW_AT_decl_column : 9
    <be8>   DW_AT_sibling     : <0xcc9>
 <2><bec>: Abbrev Number: 1 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0xf7815): gnssId
    <bf1>   DW_AT_decl_file   : 7
    <bf2>   DW_AT_decl_line   : 12
    <bf3>   DW_AT_decl_column : 10
    <bf4>   DW_AT_type        : <0xcc9>
    <bf8>   DW_AT_data_member_location: 0
 <2><bf9>: Abbrev Number: 1 (DW_TAG_member)
    <bfa>   DW_AT_name        : (indirect string, offset: 0xf7ad1): svId
    <bfe>   DW_AT_decl_file   : 7
    <bff>   DW_AT_decl_line   : 13
    <c00>   DW_AT_decl_column : 10
    <c01>   DW_AT_type        : <0xcc9>
    <c05>   DW_AT_data_member_location: 1
 <2><c06>: Abbrev Number: 1 (DW_TAG_member)
    <c07>   DW_AT_name        : (indirect string, offset: 0xf79a6): sigId
    <c0b>   DW_AT_decl_file   : 7
    <c0c>   DW_AT_decl_line   : 14
    <c0d>   DW_AT_decl_column : 10
    <c0e>   DW_AT_type        : <0xcc9>
    <c12>   DW_AT_data_member_location: 2
 <2><c13>: Abbrev Number: 1 (DW_TAG_member)
    <c14>   DW_AT_name        : (indirect string, offset: 0xf77fe): freqId
    <c18>   DW_AT_decl_file   : 7
    <c19>   DW_AT_decl_line   : 15
    <c1a>   DW_AT_decl_column : 10
    <c1b>   DW_AT_type        : <0xcc9>
    <c1f>   DW_AT_data_member_location: 3
 <2><c20>: Abbrev Number: 1 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0xf794c): prRes
    <c25>   DW_AT_decl_file   : 7
    <c26>   DW_AT_decl_line   : 16
    <c27>   DW_AT_decl_column : 10
    <c28>   DW_AT_type        : <0xcd9>
    <c2c>   DW_AT_data_member_location: 4
 <2><c2d>: Abbrev Number: 15 (DW_TAG_member)
    <c2e>   DW_AT_name        : cno
    <c32>   DW_AT_decl_file   : 7
    <c32>   DW_AT_decl_line   : 17
    <c33>   DW_AT_decl_column : 10
    <c34>   DW_AT_type        : <0xcc9>
    <c38>   DW_AT_data_member_location: 6
 <2><c39>: Abbrev Number: 1 (DW_TAG_member)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xf79ca): qualityInd
    <c3e>   DW_AT_decl_file   : 7
    <c3f>   DW_AT_decl_line   : 18
    <c40>   DW_AT_decl_column : 10
    <c41>   DW_AT_type        : <0xcc9>
    <c45>   DW_AT_data_member_location: 7
 <2><c46>: Abbrev Number: 1 (DW_TAG_member)
    <c47>   DW_AT_name        : (indirect string, offset: 0xf780a): corrSource
    <c4b>   DW_AT_decl_file   : 7
    <c4c>   DW_AT_decl_line   : 19
    <c4d>   DW_AT_decl_column : 10
    <c4e>   DW_AT_type        : <0xcc9>
    <c52>   DW_AT_data_member_location: 8
 <2><c53>: Abbrev Number: 1 (DW_TAG_member)
    <c54>   DW_AT_name        : (indirect string, offset: 0xf7787): ionoModel
    <c58>   DW_AT_decl_file   : 7
    <c59>   DW_AT_decl_line   : 20
    <c5a>   DW_AT_decl_column : 10
    <c5b>   DW_AT_type        : <0xcc9>
    <c5f>   DW_AT_data_member_location: 9
 <2><c60>: Abbrev Number: 1 (DW_TAG_member)
    <c61>   DW_AT_name        : (indirect string, offset: 0xf7927): health
    <c65>   DW_AT_decl_file   : 7
    <c66>   DW_AT_decl_line   : 22
    <c67>   DW_AT_decl_column : 10
    <c68>   DW_AT_type        : <0xcc9>
    <c6c>   DW_AT_data_member_location: 10
 <2><c6d>: Abbrev Number: 1 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xf78b9): prSmoothed
    <c72>   DW_AT_decl_file   : 7
    <c73>   DW_AT_decl_line   : 23
    <c74>   DW_AT_decl_column : 10
    <c75>   DW_AT_type        : <0xcc9>
    <c79>   DW_AT_data_member_location: 11
 <2><c7a>: Abbrev Number: 1 (DW_TAG_member)
    <c7b>   DW_AT_name        : (indirect string, offset: 0xf774d): prUsed
    <c7f>   DW_AT_decl_file   : 7
    <c80>   DW_AT_decl_line   : 24
    <c81>   DW_AT_decl_column : 10
    <c82>   DW_AT_type        : <0xcc9>
    <c86>   DW_AT_data_member_location: 12
 <2><c87>: Abbrev Number: 1 (DW_TAG_member)
    <c88>   DW_AT_name        : (indirect string, offset: 0xf782f): crUsed
    <c8c>   DW_AT_decl_file   : 7
    <c8d>   DW_AT_decl_line   : 25
    <c8e>   DW_AT_decl_column : 10
    <c8f>   DW_AT_type        : <0xcc9>
    <c93>   DW_AT_data_member_location: 13
 <2><c94>: Abbrev Number: 1 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0xf79fc): doUsed
    <c99>   DW_AT_decl_file   : 7
    <c9a>   DW_AT_decl_line   : 26
    <c9b>   DW_AT_decl_column : 10
    <c9c>   DW_AT_type        : <0xcc9>
    <ca0>   DW_AT_data_member_location: 14
 <2><ca1>: Abbrev Number: 1 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0xf798b): prCorrUsed
    <ca6>   DW_AT_decl_file   : 7
    <ca7>   DW_AT_decl_line   : 27
    <ca8>   DW_AT_decl_column : 10
    <ca9>   DW_AT_type        : <0xcc9>
    <cad>   DW_AT_data_member_location: 15
 <2><cae>: Abbrev Number: 1 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0xf7742): crCorrUsed
    <cb3>   DW_AT_decl_file   : 7
    <cb4>   DW_AT_decl_line   : 28
    <cb5>   DW_AT_decl_column : 10
    <cb6>   DW_AT_type        : <0xcc9>
    <cba>   DW_AT_data_member_location: 16
 <2><cbb>: Abbrev Number: 1 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0xf7952): doCorrUsed
    <cc0>   DW_AT_decl_file   : 7
    <cc1>   DW_AT_decl_line   : 29
    <cc2>   DW_AT_decl_column : 10
    <cc3>   DW_AT_type        : <0xcc9>
    <cc7>   DW_AT_data_member_location: 17
 <2><cc8>: Abbrev Number: 0
 <1><cc9>: Abbrev Number: 6 (DW_TAG_array_type)
    <cca>   DW_AT_type        : <0xbc7>
    <cce>   DW_AT_sibling     : <0xcd9>
 <2><cd2>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <cd3>   DW_AT_type        : <0xb66>
    <cd7>   DW_AT_upper_bound : 0
 <2><cd8>: Abbrev Number: 0
 <1><cd9>: Abbrev Number: 6 (DW_TAG_array_type)
    <cda>   DW_AT_type        : <0xbc7>
    <cde>   DW_AT_sibling     : <0xce9>
 <2><ce2>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <ce3>   DW_AT_type        : <0xb66>
    <ce7>   DW_AT_upper_bound : 1
 <2><ce8>: Abbrev Number: 0
 <1><ce9>: Abbrev Number: 4 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0xf7a67): repeatedGroup_UBX_NAV_SIG
    <cee>   DW_AT_decl_file   : 7
    <cef>   DW_AT_decl_line   : 30
    <cf0>   DW_AT_decl_column : 2
    <cf1>   DW_AT_type        : <0xbe4>
 <1><cf5>: Abbrev Number: 14 (DW_TAG_structure_type)
    <cf6>   DW_AT_byte_size   : 16
    <cf7>   DW_AT_decl_file   : 7
    <cf8>   DW_AT_decl_line   : 32
    <cf9>   DW_AT_decl_column : 9
    <cf9>   DW_AT_sibling     : <0xd4b>
 <2><cfd>: Abbrev Number: 1 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0xf7922): iTOW
    <d02>   DW_AT_decl_file   : 7
    <d03>   DW_AT_decl_line   : 33
    <d04>   DW_AT_decl_column : 10
    <d05>   DW_AT_type        : <0xd4b>
    <d09>   DW_AT_data_member_location: 0
 <2><d0a>: Abbrev Number: 1 (DW_TAG_member)
    <d0b>   DW_AT_name        : (indirect string, offset: 0xf789a): version
    <d0f>   DW_AT_decl_file   : 7
    <d10>   DW_AT_decl_line   : 34
    <d11>   DW_AT_decl_column : 10
    <d12>   DW_AT_type        : <0xcc9>
    <d16>   DW_AT_data_member_location: 4
 <2><d17>: Abbrev Number: 1 (DW_TAG_member)
    <d18>   DW_AT_name        : (indirect string, offset: 0xf793a): numSigs
    <d1c>   DW_AT_decl_file   : 7
    <d1d>   DW_AT_decl_line   : 35
    <d1e>   DW_AT_decl_column : 10
    <d1f>   DW_AT_type        : <0xcc9>
    <d23>   DW_AT_data_member_location: 5
 <2><d24>: Abbrev Number: 1 (DW_TAG_member)
    <d25>   DW_AT_name        : (indirect string, offset: 0xf77d4): reserved0
    <d29>   DW_AT_decl_file   : 7
    <d2a>   DW_AT_decl_line   : 36
    <d2b>   DW_AT_decl_column : 10
    <d2c>   DW_AT_type        : <0xcd9>
    <d30>   DW_AT_data_member_location: 6
 <2><d31>: Abbrev Number: 15 (DW_TAG_member)
    <d32>   DW_AT_name        : sig
    <d36>   DW_AT_decl_file   : 7
    <d36>   DW_AT_decl_line   : 37
    <d37>   DW_AT_decl_column : 29
    <d38>   DW_AT_type        : <0xd5b>
    <d3c>   DW_AT_data_member_location: 8
 <2><d3d>: Abbrev Number: 1 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0xf77de): reserved1
    <d42>   DW_AT_decl_file   : 7
    <d43>   DW_AT_decl_line   : 38
    <d44>   DW_AT_decl_column : 10
    <d45>   DW_AT_type        : <0xd4b>
    <d49>   DW_AT_data_member_location: 12
 <2><d4a>: Abbrev Number: 0
 <1><d4b>: Abbrev Number: 6 (DW_TAG_array_type)
    <d4c>   DW_AT_type        : <0xbc7>
    <d50>   DW_AT_sibling     : <0xd5b>
 <2><d54>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <d55>   DW_AT_type        : <0xb66>
    <d59>   DW_AT_upper_bound : 3
 <2><d5a>: Abbrev Number: 0
 <1><d5b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d5c>   DW_AT_byte_size   : 4
    <d5c>   DW_AT_type        : <0xce9>
 <1><d60>: Abbrev Number: 4 (DW_TAG_typedef)
    <d61>   DW_AT_name        : (indirect string, offset: 0xf7b89): UBX_NAV_SIG
    <d65>   DW_AT_decl_file   : 7
    <d66>   DW_AT_decl_line   : 39
    <d67>   DW_AT_decl_column : 2
    <d68>   DW_AT_type        : <0xcf5>
 <1><d6c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d6d>   DW_AT_byte_size   : 4
    <d6d>   DW_AT_type        : <0xd76>
 <1><d71>: Abbrev Number: 13 (DW_TAG_const_type)
    <d72>   DW_AT_type        : <0xd6c>
 <1><d76>: Abbrev Number: 24 (DW_TAG_const_type)
 <1><d77>: Abbrev Number: 4 (DW_TAG_typedef)
    <d78>   DW_AT_name        : (indirect string, offset: 0xf82bb): BaseType_t
    <d7c>   DW_AT_decl_file   : 8
    <d7d>   DW_AT_decl_line   : 56
    <d7e>   DW_AT_decl_column : 14
    <d7f>   DW_AT_type        : <0xb32>
 <1><d83>: Abbrev Number: 13 (DW_TAG_const_type)
    <d84>   DW_AT_type        : <0xd77>
 <1><d88>: Abbrev Number: 4 (DW_TAG_typedef)
    <d89>   DW_AT_name        : (indirect string, offset: 0x2ee7d): TickType_t
    <d8d>   DW_AT_decl_file   : 8
    <d8e>   DW_AT_decl_line   : 63
    <d8f>   DW_AT_decl_column : 19
    <d90>   DW_AT_type        : <0xbd3>
 <1><d94>: Abbrev Number: 4 (DW_TAG_typedef)
    <d95>   DW_AT_name        : (indirect string, offset: 0x57ae9): QueueHandle_t
    <d99>   DW_AT_decl_file   : 9
    <d9a>   DW_AT_decl_line   : 48
    <d9b>   DW_AT_decl_column : 34
    <d9c>   DW_AT_type        : <0xda0>
 <1><da0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <da1>   DW_AT_byte_size   : 4
    <da1>   DW_AT_type        : <0xda5>
 <1><da5>: Abbrev Number: 25 (DW_TAG_structure_type)
    <da6>   DW_AT_name        : (indirect string, offset: 0xf795d): QueueDefinition
    <daa>   DW_AT_declaration : 1
 <1><daa>: Abbrev Number: 26 (DW_TAG_typedef)
    <dab>   DW_AT_name        : (indirect string, offset: 0xf777a): osMessageQId
    <daf>   DW_AT_decl_file   : 10
    <db0>   DW_AT_decl_line   : 258
    <db2>   DW_AT_decl_column : 23
    <db3>   DW_AT_type        : <0xd94>
 <1><db7>: Abbrev Number: 6 (DW_TAG_array_type)
    <db8>   DW_AT_type        : <0xbc7>
    <dbc>   DW_AT_sibling     : <0xdc7>
 <2><dc0>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <dc1>   DW_AT_type        : <0xb66>
    <dc5>   DW_AT_upper_bound : 131
 <2><dc6>: Abbrev Number: 0
 <1><dc7>: Abbrev Number: 3 (DW_TAG_variable)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xe2c7): commandSetGNSS_Config
    <dcc>   DW_AT_decl_file   : 11
    <dcd>   DW_AT_decl_line   : 30
    <dce>   DW_AT_decl_column : 16
    <dcf>   DW_AT_type        : <0xdb7>
    <dd3>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><dd9>: Abbrev Number: 6 (DW_TAG_array_type)
    <dda>   DW_AT_type        : <0xbc7>
    <dde>   DW_AT_sibling     : <0xde9>
 <2><de2>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <de3>   DW_AT_type        : <0xb66>
    <de7>   DW_AT_upper_bound : 26
 <2><de8>: Abbrev Number: 0
 <1><de9>: Abbrev Number: 3 (DW_TAG_variable)
    <dea>   DW_AT_name        : (indirect string, offset: 0xe4e0b): commandUart1Ouput
    <dee>   DW_AT_decl_file   : 11
    <def>   DW_AT_decl_line   : 48
    <df0>   DW_AT_decl_column : 16
    <df1>   DW_AT_type        : <0xdd9>
    <df5>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><dfb>: Abbrev Number: 6 (DW_TAG_array_type)
    <dfc>   DW_AT_type        : <0xbc7>
    <e00>   DW_AT_sibling     : <0xe0b>
 <2><e04>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e05>   DW_AT_type        : <0xb66>
    <e09>   DW_AT_upper_bound : 10
 <2><e0a>: Abbrev Number: 0
 <1><e0b>: Abbrev Number: 3 (DW_TAG_variable)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x6e88c): commandUBXTimeUTC
    <e10>   DW_AT_decl_file   : 11
    <e11>   DW_AT_decl_line   : 57
    <e12>   DW_AT_decl_column : 16
    <e13>   DW_AT_type        : <0xdfb>
    <e17>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e1d>: Abbrev Number: 6 (DW_TAG_array_type)
    <e1e>   DW_AT_type        : <0xbc7>
    <e22>   DW_AT_sibling     : <0xe2d>
 <2><e26>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e27>   DW_AT_type        : <0xb66>
    <e2b>   DW_AT_upper_bound : 7
 <2><e2c>: Abbrev Number: 0
 <1><e2d>: Abbrev Number: 3 (DW_TAG_variable)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xa4fd2): pollUBXTimeUTC
    <e32>   DW_AT_decl_file   : 11
    <e33>   DW_AT_decl_line   : 60
    <e34>   DW_AT_decl_column : 16
    <e35>   DW_AT_type        : <0xe1d>
    <e39>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e3f>: Abbrev Number: 6 (DW_TAG_array_type)
    <e40>   DW_AT_type        : <0xbc7>
    <e44>   DW_AT_sibling     : <0xe4f>
 <2><e48>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e49>   DW_AT_type        : <0xb66>
    <e4d>   DW_AT_upper_bound : 92
 <2><e4e>: Abbrev Number: 0
 <1><e4f>: Abbrev Number: 3 (DW_TAG_variable)
    <e50>   DW_AT_name        : (indirect string, offset: 0xbba46): commandSetTP1_atNVTRate
    <e54>   DW_AT_decl_file   : 11
    <e55>   DW_AT_decl_line   : 79
    <e56>   DW_AT_decl_column : 16
    <e57>   DW_AT_type        : <0xe3f>
    <e5b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e61>: Abbrev Number: 6 (DW_TAG_array_type)
    <e62>   DW_AT_type        : <0xbc7>
    <e66>   DW_AT_sibling     : <0xe71>
 <2><e6a>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e6b>   DW_AT_type        : <0xb66>
    <e6f>   DW_AT_upper_bound : 100
 <2><e70>: Abbrev Number: 0
 <1><e71>: Abbrev Number: 3 (DW_TAG_variable)
    <e72>   DW_AT_name        : (indirect string, offset: 0xcf95a): commandSetTP2
    <e76>   DW_AT_decl_file   : 11
    <e77>   DW_AT_decl_line   : 105
    <e78>   DW_AT_decl_column : 16
    <e79>   DW_AT_type        : <0xe61>
    <e7d>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e83>: Abbrev Number: 6 (DW_TAG_array_type)
    <e84>   DW_AT_type        : <0xbc7>
    <e88>   DW_AT_sibling     : <0xe93>
 <2><e8c>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e8d>   DW_AT_type        : <0xb66>
    <e91>   DW_AT_upper_bound : 28
 <2><e92>: Abbrev Number: 0
 <1><e93>: Abbrev Number: 3 (DW_TAG_variable)
    <e94>   DW_AT_name        : (indirect string, offset: 0xdfb75): commandMeasureRate
    <e98>   DW_AT_decl_file   : 11
    <e99>   DW_AT_decl_line   : 122
    <e9a>   DW_AT_decl_column : 16
    <e9b>   DW_AT_type        : <0xe83>
    <e9f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><ea5>: Abbrev Number: 27 (DW_TAG_variable)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xf7996): UARTdebugHandle
    <eaa>   DW_AT_decl_file   : 12
    <eab>   DW_AT_decl_line   : 34
    <eac>   DW_AT_decl_column : 21
    <ead>   DW_AT_type        : <0xdaa>
    <eb1>   DW_AT_external    : 1
    <eb1>   DW_AT_declaration : 1
 <1><eb1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <eb2>   DW_AT_byte_size   : 8
    <eb3>   DW_AT_decl_file   : 12
    <eb4>   DW_AT_decl_line   : 73
    <eb5>   DW_AT_decl_column : 9
    <eb5>   DW_AT_sibling     : <0xed4>
 <2><eb9>: Abbrev Number: 1 (DW_TAG_member)
    <eba>   DW_AT_name        : (indirect string, offset: 0xf7a81): message
    <ebe>   DW_AT_decl_file   : 12
    <ebf>   DW_AT_decl_line   : 74
    <ec0>   DW_AT_decl_column : 8
    <ec1>   DW_AT_type        : <0xbb1>
    <ec5>   DW_AT_data_member_location: 0
 <2><ec6>: Abbrev Number: 1 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0xf78f7): color
    <ecb>   DW_AT_decl_file   : 12
    <ecc>   DW_AT_decl_line   : 75
    <ecd>   DW_AT_decl_column : 8
    <ece>   DW_AT_type        : <0xbb1>
    <ed2>   DW_AT_data_member_location: 4
 <2><ed3>: Abbrev Number: 0
 <1><ed4>: Abbrev Number: 4 (DW_TAG_typedef)
    <ed5>   DW_AT_name        : (indirect string, offset: 0xf7791): UARTdebugQ_t
    <ed9>   DW_AT_decl_file   : 12
    <eda>   DW_AT_decl_line   : 76
    <edb>   DW_AT_decl_column : 2
    <edc>   DW_AT_type        : <0xeb1>
 <1><ee0>: Abbrev Number: 28 (DW_TAG_subprogram)
    <ee1>   DW_AT_external    : 1
    <ee1>   DW_AT_name        : (indirect string, offset: 0x4067a): vPortFree
    <ee5>   DW_AT_decl_file   : 14
    <ee6>   DW_AT_decl_line   : 164
    <ee7>   DW_AT_decl_column : 6
    <ee8>   DW_AT_prototyped  : 1
    <ee8>   DW_AT_declaration : 1
    <ee8>   DW_AT_sibling     : <0xef2>
 <2><eec>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <eed>   DW_AT_type        : <0xba3>
 <2><ef1>: Abbrev Number: 0
 <1><ef2>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ef3>   DW_AT_external    : 1
    <ef3>   DW_AT_name        : (indirect string, offset: 0xf7942): vsnprintf
    <ef7>   DW_AT_decl_file   : 5
    <ef8>   DW_AT_decl_line   : 274
    <efa>   DW_AT_decl_column : 5
    <efb>   DW_AT_prototyped  : 1
    <efb>   DW_AT_type        : <0xb5a>
    <eff>   DW_AT_declaration : 1
    <eff>   DW_AT_sibling     : <0xf18>
 <2><f03>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f04>   DW_AT_type        : <0xbb1>
 <2><f08>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f09>   DW_AT_type        : <0xb6d>
 <2><f0d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f0e>   DW_AT_type        : <0xbc2>
 <2><f12>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f13>   DW_AT_type        : <0xb80>
 <2><f17>: Abbrev Number: 0
 <1><f18>: Abbrev Number: 11 (DW_TAG_subprogram)
    <f19>   DW_AT_external    : 1
    <f19>   DW_AT_name        : (indirect string, offset: 0xf781c): sprintf
    <f1d>   DW_AT_decl_file   : 5
    <f1e>   DW_AT_decl_line   : 250
    <f1f>   DW_AT_decl_column : 5
    <f20>   DW_AT_prototyped  : 1
    <f20>   DW_AT_type        : <0xb5a>
    <f24>   DW_AT_declaration : 1
    <f24>   DW_AT_sibling     : <0xf34>
 <2><f28>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f29>   DW_AT_type        : <0xbb1>
 <2><f2d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f2e>   DW_AT_type        : <0xbc2>
 <2><f32>: Abbrev Number: 17 (DW_TAG_unspecified_parameters)
 <2><f33>: Abbrev Number: 0
 <1><f34>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f35>   DW_AT_external    : 1
    <f35>   DW_AT_name        : (indirect string, offset: 0xf79ea): xQueueGenericSend
    <f39>   DW_AT_decl_file   : 9
    <f3a>   DW_AT_decl_line   : 650
    <f3c>   DW_AT_decl_column : 12
    <f3d>   DW_AT_prototyped  : 1
    <f3d>   DW_AT_type        : <0xd77>
    <f41>   DW_AT_declaration : 1
    <f41>   DW_AT_sibling     : <0xf5a>
 <2><f45>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f46>   DW_AT_type        : <0xd94>
 <2><f4a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4b>   DW_AT_type        : <0xd71>
 <2><f4f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f50>   DW_AT_type        : <0xd88>
 <2><f54>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f55>   DW_AT_type        : <0xd83>
 <2><f59>: Abbrev Number: 0
 <1><f5a>: Abbrev Number: 11 (DW_TAG_subprogram)
    <f5b>   DW_AT_external    : 1
    <f5b>   DW_AT_name        : (indirect string, offset: 0xf77ba): strcpy
    <f5f>   DW_AT_decl_file   : 13
    <f60>   DW_AT_decl_line   : 38
    <f61>   DW_AT_decl_column : 8
    <f62>   DW_AT_prototyped  : 1
    <f62>   DW_AT_type        : <0xbb1>
    <f66>   DW_AT_declaration : 1
    <f66>   DW_AT_sibling     : <0xf75>
 <2><f6a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f6b>   DW_AT_type        : <0xbb1>
 <2><f6f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f70>   DW_AT_type        : <0xbc2>
 <2><f74>: Abbrev Number: 0
 <1><f75>: Abbrev Number: 11 (DW_TAG_subprogram)
    <f76>   DW_AT_external    : 1
    <f76>   DW_AT_name        : (indirect string, offset: 0xf773a): strncpy
    <f7a>   DW_AT_decl_file   : 13
    <f7b>   DW_AT_decl_line   : 44
    <f7c>   DW_AT_decl_column : 8
    <f7d>   DW_AT_prototyped  : 1
    <f7d>   DW_AT_type        : <0xbb1>
    <f81>   DW_AT_declaration : 1
    <f81>   DW_AT_sibling     : <0xf95>
 <2><f85>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f86>   DW_AT_type        : <0xbb1>
 <2><f8a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f8b>   DW_AT_type        : <0xbc2>
 <2><f8f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f90>   DW_AT_type        : <0xb6d>
 <2><f94>: Abbrev Number: 0
 <1><f95>: Abbrev Number: 29 (DW_TAG_subprogram)
    <f96>   DW_AT_external    : 1
    <f96>   DW_AT_name        : (indirect string, offset: 0x5b9c9): updateMemoryUsage
    <f9a>   DW_AT_decl_file   : 16
    <f9b>   DW_AT_decl_line   : 26
    <f9c>   DW_AT_decl_column : 6
    <f9d>   DW_AT_prototyped  : 1
    <f9d>   DW_AT_declaration : 1
 <1><f9d>: Abbrev Number: 11 (DW_TAG_subprogram)
    <f9e>   DW_AT_external    : 1
    <f9e>   DW_AT_name        : (indirect string, offset: 0xf7852): strlen
    <fa2>   DW_AT_decl_file   : 13
    <fa3>   DW_AT_decl_line   : 41
    <fa4>   DW_AT_decl_column : 9
    <fa5>   DW_AT_prototyped  : 1
    <fa5>   DW_AT_type        : <0xb6d>
    <fa9>   DW_AT_declaration : 1
    <fa9>   DW_AT_sibling     : <0xfb3>
 <2><fad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <fae>   DW_AT_type        : <0xbc2>
 <2><fb2>: Abbrev Number: 0
 <1><fb3>: Abbrev Number: 11 (DW_TAG_subprogram)
    <fb4>   DW_AT_external    : 1
    <fb4>   DW_AT_name        : (indirect string, offset: 0x8b9ce): pvPortMalloc
    <fb8>   DW_AT_decl_file   : 14
    <fb9>   DW_AT_decl_line   : 163
    <fba>   DW_AT_decl_column : 7
    <fbb>   DW_AT_prototyped  : 1
    <fbb>   DW_AT_type        : <0xba3>
    <fbf>   DW_AT_declaration : 1
    <fbf>   DW_AT_sibling     : <0xfc9>
 <2><fc3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <fc4>   DW_AT_type        : <0xb6d>
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <fca>   DW_AT_external    : 1
    <fca>   DW_AT_name        : (indirect string, offset: 0xf77e8): formattedString
    <fce>   DW_AT_decl_file   : 1
    <fce>   DW_AT_decl_line   : 105
    <fcf>   DW_AT_decl_column : 6
    <fcf>   DW_AT_prototyped  : 1
    <fcf>   DW_AT_low_pc      : 0x8000c78
    <fd3>   DW_AT_high_pc     : 0x70
    <fd7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd9>   DW_AT_call_all_tail_calls: 1
    <fd9>   DW_AT_sibling     : <0x1062>
 <2><fdd>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <fde>   DW_AT_name        : (indirect string, offset: 0x254ce): buffer
    <fe2>   DW_AT_decl_file   : 1
    <fe2>   DW_AT_decl_line   : 105
    <fe3>   DW_AT_decl_column : 28
    <fe4>   DW_AT_type        : <0xbb1>
    <fe8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><feb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <fec>   DW_AT_name        : (indirect string, offset: 0xf87fe): offset
    <ff0>   DW_AT_decl_file   : 1
    <ff0>   DW_AT_decl_line   : 105
    <ff1>   DW_AT_decl_column : 44
    <ff2>   DW_AT_type        : <0x1062>
    <ff6>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><ff9>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xf7908): numArgs
    <ffe>   DW_AT_decl_file   : 1
    <ffe>   DW_AT_decl_line   : 105
    <fff>   DW_AT_decl_column : 56
    <1000>   DW_AT_type        : <0xb5a>
    <1004>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><1007>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1008>   DW_AT_name        : (indirect string, offset: 0xf7847): freeMemory
    <100c>   DW_AT_decl_file   : 1
    <100c>   DW_AT_decl_line   : 105
    <100d>   DW_AT_decl_column : 70
    <100e>   DW_AT_type        : <0x1067>
    <1012>   DW_AT_location    : 2 byte block: 91 5b 	(DW_OP_fbreg: -37)
 <2><1015>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1016>   DW_AT_name        : (indirect string, offset: 0xf77cd): format
    <101a>   DW_AT_decl_file   : 1
    <101a>   DW_AT_decl_line   : 105
    <101b>   DW_AT_decl_column : 94
    <101c>   DW_AT_type        : <0xbc2>
    <1020>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><1023>: Abbrev Number: 17 (DW_TAG_unspecified_parameters)
 <2><1024>: Abbrev Number: 3 (DW_TAG_variable)
    <1025>   DW_AT_name        : (indirect string, offset: 0x6952c): args
    <1029>   DW_AT_decl_file   : 1
    <102a>   DW_AT_decl_line   : 106
    <102b>   DW_AT_decl_column : 10
    <102c>   DW_AT_type        : <0xba5>
    <1030>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1033>: Abbrev Number: 12 (DW_TAG_lexical_block)
    <1034>   DW_AT_low_pc      : 0x8000cbc
    <1038>   DW_AT_high_pc     : 0x24
 <3><103c>: Abbrev Number: 10 (DW_TAG_variable)
    <103d>   DW_AT_name        : i
    <103f>   DW_AT_decl_file   : 1
    <103f>   DW_AT_decl_line   : 113
    <1040>   DW_AT_decl_column : 12
    <1041>   DW_AT_type        : <0xb5a>
    <1045>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><1048>: Abbrev Number: 12 (DW_TAG_lexical_block)
    <1049>   DW_AT_low_pc      : 0x8000cc2
    <104d>   DW_AT_high_pc     : 0x10
 <4><1051>: Abbrev Number: 10 (DW_TAG_variable)
    <1052>   DW_AT_name        : arg
    <1056>   DW_AT_decl_file   : 1
    <1056>   DW_AT_decl_line   : 114
    <1057>   DW_AT_decl_column : 10
    <1058>   DW_AT_type        : <0xba3>
    <105c>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <4><105f>: Abbrev Number: 0
 <3><1060>: Abbrev Number: 0
 <2><1061>: Abbrev Number: 0
 <1><1062>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <1063>   DW_AT_byte_size   : 4
    <1063>   DW_AT_type        : <0xb6d>
 <1><1067>: Abbrev Number: 5 (DW_TAG_base_type)
    <1068>   DW_AT_byte_size   : 1
    <1069>   DW_AT_encoding    : 2	(boolean)
    <106a>   DW_AT_name        : (indirect string, offset: 0xf7902): _Bool
 <1><106e>: Abbrev Number: 30 (DW_TAG_subprogram)
    <106f>   DW_AT_external    : 1
    <106f>   DW_AT_name        : (indirect string, offset: 0xf7727): uint8ArrayToString
    <1073>   DW_AT_decl_file   : 1
    <1074>   DW_AT_decl_line   : 92
    <1075>   DW_AT_decl_column : 7
    <1076>   DW_AT_prototyped  : 1
    <1076>   DW_AT_type        : <0xbb1>
    <107a>   DW_AT_low_pc      : 0x8000c04
    <107e>   DW_AT_high_pc     : 0x74
    <1082>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1084>   DW_AT_call_all_tail_calls: 1
    <1084>   DW_AT_sibling     : <0x10d7>
 <2><1088>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1089>   DW_AT_name        : (indirect string, offset: 0xf77f8): array
    <108d>   DW_AT_decl_file   : 1
    <108d>   DW_AT_decl_line   : 92
    <108e>   DW_AT_decl_column : 35
    <108f>   DW_AT_type        : <0xbdf>
    <1093>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><1096>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <1097>   DW_AT_name        : (indirect string, offset: 0xfa05c): size
    <109b>   DW_AT_decl_file   : 1
    <109b>   DW_AT_decl_line   : 92
    <109c>   DW_AT_decl_column : 49
    <109d>   DW_AT_type        : <0xb6d>
    <10a1>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><10a4>: Abbrev Number: 10 (DW_TAG_variable)
    <10a5>   DW_AT_name        : str
    <10a9>   DW_AT_decl_file   : 1
    <10a9>   DW_AT_decl_line   : 94
    <10aa>   DW_AT_decl_column : 8
    <10ab>   DW_AT_type        : <0xbb1>
    <10af>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><10b2>: Abbrev Number: 10 (DW_TAG_variable)
    <10b3>   DW_AT_name        : ptr
    <10b7>   DW_AT_decl_file   : 1
    <10b7>   DW_AT_decl_line   : 95
    <10b8>   DW_AT_decl_column : 8
    <10b9>   DW_AT_type        : <0xbb1>
    <10bd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><10c0>: Abbrev Number: 12 (DW_TAG_lexical_block)
