Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xa95 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x40479): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x85b51): ../Core/Src/GNSS/GNSSCom.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4bed7): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x7be97): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x473f5): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 5 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xee2e8): unsigned char
 <1><44>: Abbrev Number: 5 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb6ec1): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xc9291): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 5 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xec6fb): short unsigned int
 <1><5e>: Abbrev Number: 5 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x148e7): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x9dbd0): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 5 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5dc02): long unsigned int
 <1><78>: Abbrev Number: 5 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x70439): long long int
 <1><7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x3300c): long long unsigned int
 <1><86>: Abbrev Number: 27 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 5 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x13de3): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x473f7): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 28 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xb5175): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x11333): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 16
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 404
    <cb>   DW_AT_decl_column : 9
    <cb>   DW_AT_sibling     : <0x106>
 <2><cf>: Abbrev Number: 6 (DW_TAG_member)
    <d0>   DW_AT_name        : CCR
    <d4>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 406
    <d6>   DW_AT_decl_column : 17
    <d6>   DW_AT_type        : <0xc2>
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 3 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0xa1bf9): CNDTR
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 407
    <e3>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xc2>
    <e8>   DW_AT_data_member_location: 4
 <2><e9>: Abbrev Number: 3 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0xee4ca): CPAR
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 408
    <f1>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xc2>
    <f6>   DW_AT_data_member_location: 8
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x88542): CMAR
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 409
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 12
 <2><105>: Abbrev Number: 0
 <1><106>: Abbrev Number: 14 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xe883c): DMA_Channel_TypeDef
    <10b>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 410
    <10e>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xc7>
 <1><112>: Abbrev Number: 17 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 8
    <114>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 412
    <116>   DW_AT_decl_column : 9
    <116>   DW_AT_sibling     : <0x135>
 <2><11a>: Abbrev Number: 6 (DW_TAG_member)
    <11b>   DW_AT_name        : ISR
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 414
    <121>   DW_AT_decl_column : 17
    <121>   DW_AT_type        : <0xc2>
    <125>   DW_AT_data_member_location: 0
 <2><126>: Abbrev Number: 3 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0xaca53): IFCR
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 415
    <12e>   DW_AT_decl_column : 17
    <12f>   DW_AT_type        : <0xc2>
    <133>   DW_AT_data_member_location: 4
 <2><134>: Abbrev Number: 0
 <1><135>: Abbrev Number: 14 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x594a5): DMA_TypeDef
    <13a>   DW_AT_decl_file   : 4
    <13b>   DW_AT_decl_line   : 416
    <13d>   DW_AT_decl_column : 3
    <13d>   DW_AT_type        : <0x112>
 <1><141>: Abbrev Number: 17 (DW_TAG_structure_type)
    <142>   DW_AT_byte_size   : 44
    <143>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 950
    <145>   DW_AT_decl_column : 9
    <145>   DW_AT_sibling     : <0x20a>
 <2><149>: Abbrev Number: 6 (DW_TAG_member)
    <14a>   DW_AT_name        : CR1
    <14e>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 952
    <150>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xc2>
    <154>   DW_AT_data_member_location: 0
 <2><155>: Abbrev Number: 6 (DW_TAG_member)
    <156>   DW_AT_name        : CR2
    <15a>   DW_AT_decl_file   : 4
    <15a>   DW_AT_decl_line   : 953
    <15c>   DW_AT_decl_column : 17
    <15c>   DW_AT_type        : <0xc2>
    <160>   DW_AT_data_member_location: 4
 <2><161>: Abbrev Number: 6 (DW_TAG_member)
    <162>   DW_AT_name        : CR3
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 954
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 6 (DW_TAG_member)
    <16e>   DW_AT_name        : BRR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 955
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xc2>
    <178>   DW_AT_data_member_location: 12
 <2><179>: Abbrev Number: 3 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x4414b): GTPR
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 956
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xb1>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 3 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xe86c7): RESERVED2
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 957
    <18f>   DW_AT_decl_column : 13
    <190>   DW_AT_type        : <0xa5>
    <194>   DW_AT_data_member_location: 18
 <2><195>: Abbrev Number: 3 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x91357): RTOR
    <19a>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 958
    <19d>   DW_AT_decl_column : 17
    <19e>   DW_AT_type        : <0xc2>
    <1a2>   DW_AT_data_member_location: 20
 <2><1a3>: Abbrev Number: 6 (DW_TAG_member)
    <1a4>   DW_AT_name        : RQR
    <1a8>   DW_AT_decl_file   : 4
    <1a8>   DW_AT_decl_line   : 959
    <1aa>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xb1>
    <1ae>   DW_AT_data_member_location: 24
 <2><1af>: Abbrev Number: 3 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xe86d1): RESERVED3
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 960
    <1b7>   DW_AT_decl_column : 13
    <1b8>   DW_AT_type        : <0xa5>
    <1bc>   DW_AT_data_member_location: 26
 <2><1bd>: Abbrev Number: 6 (DW_TAG_member)
    <1be>   DW_AT_name        : ISR
    <1c2>   DW_AT_decl_file   : 4
    <1c2>   DW_AT_decl_line   : 961
    <1c4>   DW_AT_decl_column : 17
    <1c4>   DW_AT_type        : <0xc2>
    <1c8>   DW_AT_data_member_location: 28
 <2><1c9>: Abbrev Number: 6 (DW_TAG_member)
    <1ca>   DW_AT_name        : ICR
    <1ce>   DW_AT_decl_file   : 4
    <1ce>   DW_AT_decl_line   : 962
    <1d0>   DW_AT_decl_column : 17
    <1d0>   DW_AT_type        : <0xc2>
    <1d4>   DW_AT_data_member_location: 32
 <2><1d5>: Abbrev Number: 6 (DW_TAG_member)
    <1d6>   DW_AT_name        : RDR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 963
    <1dc>   DW_AT_decl_column : 17
    <1dc>   DW_AT_type        : <0xb1>
    <1e0>   DW_AT_data_member_location: 36
 <2><1e1>: Abbrev Number: 3 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xdec52): RESERVED4
    <1e6>   DW_AT_decl_file   : 4
    <1e7>   DW_AT_decl_line   : 964
    <1e9>   DW_AT_decl_column : 13
    <1ea>   DW_AT_type        : <0xa5>
    <1ee>   DW_AT_data_member_location: 38
 <2><1ef>: Abbrev Number: 6 (DW_TAG_member)
    <1f0>   DW_AT_name        : TDR
    <1f4>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 965
    <1f6>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xb1>
    <1fa>   DW_AT_data_member_location: 40
 <2><1fb>: Abbrev Number: 3 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0xe86ff): RESERVED5
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 966
    <203>   DW_AT_decl_column : 13
    <204>   DW_AT_type        : <0xa5>
    <208>   DW_AT_data_member_location: 42
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 14 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0xf4872): USART_TypeDef
    <20f>   DW_AT_decl_file   : 4
    <210>   DW_AT_decl_line   : 967
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x141>
 <1><216>: Abbrev Number: 2 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xa10f): size_t
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 214
    <21d>   DW_AT_decl_column : 23
    <21e>   DW_AT_type        : <0x8d>
 <1><222>: Abbrev Number: 5 (DW_TAG_base_type)
    <223>   DW_AT_byte_size   : 8
    <224>   DW_AT_encoding    : 4	(float)
    <225>   DW_AT_name        : (indirect string, offset: 0x166e4): long double
 <1><229>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <22a>   DW_AT_encoding    : 7	(unsigned)
    <22a>   DW_AT_byte_size   : 1
    <22a>   DW_AT_type        : <0x3d>
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 50
    <230>   DW_AT_decl_column : 1
    <231>   DW_AT_sibling     : <0x242>
 <2><235>: Abbrev Number: 7 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0xb5be4): HAL_UNLOCKED
    <23a>   DW_AT_const_value : 0
 <2><23b>: Abbrev Number: 7 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0xf676f): HAL_LOCKED
    <240>   DW_AT_const_value : 1
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 2 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x912d4): HAL_LockTypeDef
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 53
    <249>   DW_AT_decl_column : 3
    <24a>   DW_AT_type        : <0x229>
 <1><24e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <24f>   DW_AT_byte_size   : 32
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 46
    <252>   DW_AT_decl_column : 9
    <252>   DW_AT_sibling     : <0x2bf>
 <2><256>: Abbrev Number: 1 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0xdcc6a): Request
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 48
    <25d>   DW_AT_decl_column : 12
    <25e>   DW_AT_type        : <0xb6>
    <262>   DW_AT_data_member_location: 0
 <2><263>: Abbrev Number: 1 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x5ae85): Direction
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 51
    <26a>   DW_AT_decl_column : 12
    <26b>   DW_AT_type        : <0xb6>
    <26f>   DW_AT_data_member_location: 4
 <2><270>: Abbrev Number: 1 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x10734): PeriphInc
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 55
    <277>   DW_AT_decl_column : 12
    <278>   DW_AT_type        : <0xb6>
    <27c>   DW_AT_data_member_location: 8
 <2><27d>: Abbrev Number: 1 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x26474): MemInc
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 58
    <284>   DW_AT_decl_column : 12
    <285>   DW_AT_type        : <0xb6>
    <289>   DW_AT_data_member_location: 12
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x7af0c): PeriphDataAlignment
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 61
    <291>   DW_AT_decl_column : 12
    <292>   DW_AT_type        : <0xb6>
    <296>   DW_AT_data_member_location: 16
 <2><297>: Abbrev Number: 1 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xde7d2): MemDataAlignment
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 64
    <29e>   DW_AT_decl_column : 12
    <29f>   DW_AT_type        : <0xb6>
    <2a3>   DW_AT_data_member_location: 20
 <2><2a4>: Abbrev Number: 1 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xfc799): Mode
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 67
    <2ab>   DW_AT_decl_column : 12
    <2ac>   DW_AT_type        : <0xb6>
    <2b0>   DW_AT_data_member_location: 24
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xfc0dc): Priority
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 72
    <2b8>   DW_AT_decl_column : 12
    <2b9>   DW_AT_type        : <0xb6>
    <2bd>   DW_AT_data_member_location: 28
 <2><2be>: Abbrev Number: 0
 <1><2bf>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x42011): DMA_InitTypeDef
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 74
    <2c6>   DW_AT_decl_column : 3
    <2c7>   DW_AT_type        : <0x24e>
 <1><2cb>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <2cc>   DW_AT_encoding    : 7	(unsigned)
    <2cc>   DW_AT_byte_size   : 1
    <2cc>   DW_AT_type        : <0x3d>
    <2d0>   DW_AT_decl_file   : 7
    <2d1>   DW_AT_decl_line   : 80
    <2d2>   DW_AT_decl_column : 1
    <2d3>   DW_AT_sibling     : <0x2f0>
 <2><2d7>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2d8>   DW_AT_name        : (indirect string, offset: 0xb7391): HAL_DMA_STATE_RESET
    <2dc>   DW_AT_const_value : 0
 <2><2dd>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2de>   DW_AT_name        : (indirect string, offset: 0x4365c): HAL_DMA_STATE_READY
    <2e2>   DW_AT_const_value : 1
 <2><2e3>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0xaaf1c): HAL_DMA_STATE_BUSY
    <2e8>   DW_AT_const_value : 2
 <2><2e9>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xf2b00): HAL_DMA_STATE_TIMEOUT
    <2ee>   DW_AT_const_value : 3
 <2><2ef>: Abbrev Number: 0
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x87d2a): HAL_DMA_StateTypeDef
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 85
    <2f7>   DW_AT_decl_column : 3
    <2f8>   DW_AT_type        : <0x2cb>
 <1><2fc>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <2fd>   DW_AT_type        : <0x2f0>
 <1><301>: Abbrev Number: 19 (DW_TAG_structure_type)
    <302>   DW_AT_name        : (indirect string, offset: 0xd1c22): __DMA_HandleTypeDef
    <306>   DW_AT_byte_size   : 72
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 112
    <309>   DW_AT_decl_column : 16
    <309>   DW_AT_sibling     : <0x3aa>
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xc8f6b): Instance
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 114
    <314>   DW_AT_decl_column : 27
    <315>   DW_AT_type        : <0x3aa>
    <319>   DW_AT_data_member_location: 0
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xfcf15): Init
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 116
    <321>   DW_AT_decl_column : 25
    <322>   DW_AT_type        : <0x2bf>
    <326>   DW_AT_data_member_location: 4
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0xaf82a): Lock
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 118
    <32e>   DW_AT_decl_column : 25
    <32f>   DW_AT_type        : <0x242>
    <333>   DW_AT_data_member_location: 36
 <2><334>: Abbrev Number: 1 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xfe4f1): State
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 120
    <33b>   DW_AT_decl_column : 30
    <33c>   DW_AT_type        : <0x2fc>
    <340>   DW_AT_data_member_location: 37
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x4cecc): Parent
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 122
    <348>   DW_AT_decl_column : 26
    <349>   DW_AT_type        : <0x3af>
    <34d>   DW_AT_data_member_location: 40
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xf572d): XferCpltCallback
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 124
    <355>   DW_AT_decl_column : 11
    <356>   DW_AT_type        : <0x3c1>
    <35a>   DW_AT_data_member_location: 44
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0xbf3d3): XferHalfCpltCallback
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 126
    <362>   DW_AT_decl_column : 11
    <363>   DW_AT_type        : <0x3c1>
    <367>   DW_AT_data_member_location: 48
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x22f53): XferErrorCallback
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 128
    <36f>   DW_AT_decl_column : 11
    <370>   DW_AT_type        : <0x3c1>
    <374>   DW_AT_data_member_location: 52
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0xe624f): XferAbortCallback
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 130
    <37c>   DW_AT_decl_column : 11
    <37d>   DW_AT_type        : <0x3c1>
    <381>   DW_AT_data_member_location: 56
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf116a): ErrorCode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 132
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0xc2>
    <38e>   DW_AT_data_member_location: 60
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x636a2): DmaBaseAddress
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 134
    <396>   DW_AT_decl_column : 26
    <397>   DW_AT_type        : <0x3c6>
    <39b>   DW_AT_data_member_location: 64
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x32be9): ChannelIndex
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 136
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0xb6>
    <3a8>   DW_AT_data_member_location: 68
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3ab>   DW_AT_byte_size   : 4
    <3ab>   DW_AT_type        : <0x106>
 <1><3af>: Abbrev Number: 29 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
 <1><3b1>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <3b2>   DW_AT_prototyped  : 1
    <3b2>   DW_AT_sibling     : <0x3bc>
 <2><3b6>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3b7>   DW_AT_type        : <0x3bc>
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x301>
 <1><3c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c2>   DW_AT_type        : <0x3b1>
 <1><3c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x135>
 <1><3cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xd1c24): DMA_HandleTypeDef
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 153
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x301>
 <1><3d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_type        : <0x94>
 <1><3dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3dd>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3cb>
 <1><3e1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e2>   DW_AT_byte_size   : 32
    <3e3>   DW_AT_decl_file   : 8
    <3e4>   DW_AT_decl_line   : 46
    <3e5>   DW_AT_decl_column : 9
    <3e5>   DW_AT_sibling     : <0x452>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xe1621): BaudRate
    <3ee>   DW_AT_decl_file   : 8
    <3ef>   DW_AT_decl_line   : 48
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xb6>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x6bf7): WordLength
    <3fb>   DW_AT_decl_file   : 8
    <3fc>   DW_AT_decl_line   : 68
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xb6>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xe1999): StopBits
    <408>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 71
    <40a>   DW_AT_decl_column : 12
    <40b>   DW_AT_type        : <0xb6>
    <40f>   DW_AT_data_member_location: 8
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x46071): Parity
    <415>   DW_AT_decl_file   : 8
    <416>   DW_AT_decl_line   : 74
    <417>   DW_AT_decl_column : 12
    <418>   DW_AT_type        : <0xb6>
    <41c>   DW_AT_data_member_location: 12
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xfc799): Mode
    <422>   DW_AT_decl_file   : 8
    <423>   DW_AT_decl_line   : 81
    <424>   DW_AT_decl_column : 12
    <425>   DW_AT_type        : <0xb6>
    <429>   DW_AT_data_member_location: 16
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x846f7): HwFlowCtl
    <42f>   DW_AT_decl_file   : 8
    <430>   DW_AT_decl_line   : 84
    <431>   DW_AT_decl_column : 12
    <432>   DW_AT_type        : <0xb6>
    <436>   DW_AT_data_member_location: 20
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xceba4): OverSampling
    <43c>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 88
    <43e>   DW_AT_decl_column : 12
    <43f>   DW_AT_type        : <0xb6>
    <443>   DW_AT_data_member_location: 24
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x31a9b): OneBitSampling
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 92
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb6>
    <450>   DW_AT_data_member_location: 28
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 2 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x44d35): UART_InitTypeDef
    <457>   DW_AT_decl_file   : 8
    <458>   DW_AT_decl_line   : 101
    <459>   DW_AT_decl_column : 3
    <45a>   DW_AT_type        : <0x3e1>
 <1><45e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <45f>   DW_AT_byte_size   : 40
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 106
    <462>   DW_AT_decl_column : 9
    <462>   DW_AT_sibling     : <0x4e9>
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x2f942): AdvFeatureInit
    <46b>   DW_AT_decl_file   : 8
    <46c>   DW_AT_decl_line   : 108
    <46d>   DW_AT_decl_column : 12
    <46e>   DW_AT_type        : <0xb6>
    <472>   DW_AT_data_member_location: 0
 <2><473>: Abbrev Number: 1 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0xe5a4d): TxPinLevelInvert
    <478>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 113
    <47a>   DW_AT_decl_column : 12
    <47b>   DW_AT_type        : <0xb6>
    <47f>   DW_AT_data_member_location: 4
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xcefc9): RxPinLevelInvert
    <485>   DW_AT_decl_file   : 8
    <486>   DW_AT_decl_line   : 116
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0xb6>
    <48c>   DW_AT_data_member_location: 8
 <2><48d>: Abbrev Number: 1 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0xa677e): DataInvert
    <492>   DW_AT_decl_file   : 8
    <493>   DW_AT_decl_line   : 119
    <494>   DW_AT_decl_column : 12
    <495>   DW_AT_type        : <0xb6>
    <499>   DW_AT_data_member_location: 12
 <2><49a>: Abbrev Number: 1 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x4dbbf): Swap
    <49f>   DW_AT_decl_file   : 8
    <4a0>   DW_AT_decl_line   : 123
    <4a1>   DW_AT_decl_column : 12
    <4a2>   DW_AT_type        : <0xb6>
    <4a6>   DW_AT_data_member_location: 16
 <2><4a7>: Abbrev Number: 1 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xbeb20): OverrunDisable
    <4ac>   DW_AT_decl_file   : 8
    <4ad>   DW_AT_decl_line   : 126
    <4ae>   DW_AT_decl_column : 12
    <4af>   DW_AT_type        : <0xb6>
    <4b3>   DW_AT_data_member_location: 20
 <2><4b4>: Abbrev Number: 1 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x8482): DMADisableonRxError
    <4b9>   DW_AT_decl_file   : 8
    <4ba>   DW_AT_decl_line   : 129
    <4bb>   DW_AT_decl_column : 12
    <4bc>   DW_AT_type        : <0xb6>
    <4c0>   DW_AT_data_member_location: 24
 <2><4c1>: Abbrev Number: 1 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xf0b5f): AutoBaudRateEnable
    <4c6>   DW_AT_decl_file   : 8
    <4c7>   DW_AT_decl_line   : 132
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xb6>
    <4cd>   DW_AT_data_member_location: 28
 <2><4ce>: Abbrev Number: 1 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xd1422): AutoBaudRateMode
    <4d3>   DW_AT_decl_file   : 8
    <4d4>   DW_AT_decl_line   : 135
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xb6>
    <4da>   DW_AT_data_member_location: 32
 <2><4db>: Abbrev Number: 1 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x6cbea): MSBFirst
    <4e0>   DW_AT_decl_file   : 8
    <4e1>   DW_AT_decl_line   : 139
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xb6>
    <4e7>   DW_AT_data_member_location: 36
 <2><4e8>: Abbrev Number: 0
 <1><4e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ea>   DW_AT_name        : (indirect string, offset: 0xb7130): UART_AdvFeatureInitTypeDef
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 141
    <4f0>   DW_AT_decl_column : 3
    <4f1>   DW_AT_type        : <0x45e>
 <1><4f5>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x4a9a0): HAL_UART_StateTypeDef
    <4fa>   DW_AT_decl_file   : 8
    <4fb>   DW_AT_decl_line   : 183
    <4fc>   DW_AT_decl_column : 18
    <4fd>   DW_AT_type        : <0xb6>
 <1><501>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <502>   DW_AT_type        : <0x4f5>
 <1><506>: Abbrev Number: 2 (DW_TAG_typedef)
    <507>   DW_AT_name        : (indirect string, offset: 0x64697): HAL_UART_RxTypeTypeDef
    <50b>   DW_AT_decl_file   : 8
    <50c>   DW_AT_decl_line   : 207
    <50d>   DW_AT_decl_column : 18
    <50e>   DW_AT_type        : <0xb6>
 <1><512>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <513>   DW_AT_type        : <0x506>
 <1><517>: Abbrev Number: 2 (DW_TAG_typedef)
    <518>   DW_AT_name        : (indirect string, offset: 0x1e750): HAL_UART_RxEventTypeTypeDef
    <51c>   DW_AT_decl_file   : 8
    <51d>   DW_AT_decl_line   : 218
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0xb6>
 <1><523>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <524>   DW_AT_type        : <0x517>
 <1><528>: Abbrev Number: 19 (DW_TAG_structure_type)
    <529>   DW_AT_name        : (indirect string, offset: 0x8eb78): __UART_HandleTypeDef
    <52d>   DW_AT_byte_size   : 136
    <52e>   DW_AT_decl_file   : 8
    <52f>   DW_AT_decl_line   : 223
    <530>   DW_AT_decl_column : 16
    <530>   DW_AT_sibling     : <0x642>
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0xc8f6b): Instance
    <539>   DW_AT_decl_file   : 8
    <53a>   DW_AT_decl_line   : 225
    <53b>   DW_AT_decl_column : 29
    <53c>   DW_AT_type        : <0x642>
    <540>   DW_AT_data_member_location: 0
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0xfcf15): Init
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 227
    <548>   DW_AT_decl_column : 28
    <549>   DW_AT_type        : <0x452>
    <54d>   DW_AT_data_member_location: 4
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0xd808f): AdvancedInit
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 229
    <555>   DW_AT_decl_column : 30
    <556>   DW_AT_type        : <0x4e9>
    <55a>   DW_AT_data_member_location: 36
 <2><55b>: Abbrev Number: 1 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x75ea0): pTxBuffPtr
    <560>   DW_AT_decl_file   : 8
    <561>   DW_AT_decl_line   : 231
    <562>   DW_AT_decl_column : 29
    <563>   DW_AT_type        : <0x647>
    <567>   DW_AT_data_member_location: 76
 <2><568>: Abbrev Number: 1 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x6780e): TxXferSize
    <56d>   DW_AT_decl_file   : 8
    <56e>   DW_AT_decl_line   : 233
    <56f>   DW_AT_decl_column : 28
    <570>   DW_AT_type        : <0xa5>
    <574>   DW_AT_data_member_location: 80
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xfd456): TxXferCount
    <57a>   DW_AT_decl_file   : 8
    <57b>   DW_AT_decl_line   : 235
    <57c>   DW_AT_decl_column : 28
    <57d>   DW_AT_type        : <0xb1>
    <581>   DW_AT_data_member_location: 82
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xe500e): pRxBuffPtr
    <587>   DW_AT_decl_file   : 8
    <588>   DW_AT_decl_line   : 237
    <589>   DW_AT_decl_column : 29
    <58a>   DW_AT_type        : <0x3d7>
    <58e>   DW_AT_data_member_location: 84
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x7af8b): RxXferSize
    <594>   DW_AT_decl_file   : 8
    <595>   DW_AT_decl_line   : 239
    <596>   DW_AT_decl_column : 28
    <597>   DW_AT_type        : <0xa5>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 1 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xfcf22): RxXferCount
    <5a1>   DW_AT_decl_file   : 8
    <5a2>   DW_AT_decl_line   : 241
    <5a3>   DW_AT_decl_column : 28
    <5a4>   DW_AT_type        : <0xb1>
    <5a8>   DW_AT_data_member_location: 90
 <2><5a9>: Abbrev Number: 1 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xfea07): Mask
    <5ae>   DW_AT_decl_file   : 8
    <5af>   DW_AT_decl_line   : 243
    <5b0>   DW_AT_decl_column : 28
    <5b1>   DW_AT_type        : <0xa5>
    <5b5>   DW_AT_data_member_location: 92
 <2><5b6>: Abbrev Number: 1 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xcdb3f): ReceptionType
    <5bb>   DW_AT_decl_file   : 8
    <5bc>   DW_AT_decl_line   : 254
    <5bd>   DW_AT_decl_column : 31
    <5be>   DW_AT_type        : <0x512>
    <5c2>   DW_AT_data_member_location: 96
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x12208): RxEventType
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 256
    <5cb>   DW_AT_decl_column : 36
    <5cc>   DW_AT_type        : <0x523>
    <5d0>   DW_AT_data_member_location: 100
 <2><5d1>: Abbrev Number: 3 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xd46e9): RxISR
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 258
    <5d9>   DW_AT_decl_column : 10
    <5da>   DW_AT_type        : <0x65c>
    <5de>   DW_AT_data_member_location: 104
 <2><5df>: Abbrev Number: 3 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x7be83): TxISR
    <5e4>   DW_AT_decl_file   : 8
    <5e5>   DW_AT_decl_line   : 260
    <5e7>   DW_AT_decl_column : 10
    <5e8>   DW_AT_type        : <0x65c>
    <5ec>   DW_AT_data_member_location: 108
 <2><5ed>: Abbrev Number: 3 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xca2c2): hdmatx
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 262
    <5f5>   DW_AT_decl_column : 29
    <5f6>   DW_AT_type        : <0x3dc>
    <5fa>   DW_AT_data_member_location: 112
 <2><5fb>: Abbrev Number: 3 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xef4e4): hdmarx
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 264
    <603>   DW_AT_decl_column : 29
    <604>   DW_AT_type        : <0x3dc>
    <608>   DW_AT_data_member_location: 116
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xaf82a): Lock
    <60e>   DW_AT_decl_file   : 8
    <60f>   DW_AT_decl_line   : 266
    <611>   DW_AT_decl_column : 29
    <612>   DW_AT_type        : <0x242>
    <616>   DW_AT_data_member_location: 120
 <2><617>: Abbrev Number: 3 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x63a39): gState
    <61c>   DW_AT_decl_file   : 8
    <61d>   DW_AT_decl_line   : 268
    <61f>   DW_AT_decl_column : 33
    <620>   DW_AT_type        : <0x501>
    <624>   DW_AT_data_member_location: 124
 <2><625>: Abbrev Number: 3 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xddc7d): RxState
    <62a>   DW_AT_decl_file   : 8
    <62b>   DW_AT_decl_line   : 272
    <62d>   DW_AT_decl_column : 33
    <62e>   DW_AT_type        : <0x501>
    <632>   DW_AT_data_member_location: 128
 <2><633>: Abbrev Number: 3 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xf116a): ErrorCode
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 275
    <63b>   DW_AT_decl_column : 33
    <63c>   DW_AT_type        : <0xc2>
    <640>   DW_AT_data_member_location: 132
 <2><641>: Abbrev Number: 0
 <1><642>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <643>   DW_AT_byte_size   : 4
    <643>   DW_AT_type        : <0x20a>
 <1><647>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <648>   DW_AT_type        : <0xa0>
 <1><64c>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <64d>   DW_AT_prototyped  : 1
    <64d>   DW_AT_sibling     : <0x657>
 <2><651>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <652>   DW_AT_type        : <0x657>
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <658>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x528>
 <1><65c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <65d>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x64c>
 <1><661>: Abbrev Number: 14 (DW_TAG_typedef)
    <662>   DW_AT_name        : (indirect string, offset: 0x8eb7a): UART_HandleTypeDef
    <666>   DW_AT_decl_file   : 8
    <667>   DW_AT_decl_line   : 297
    <669>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x528>
 <1><66d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <66e>   DW_AT_byte_size   : 4
    <66e>   DW_AT_type        : <0x672>
 <1><672>: Abbrev Number: 5 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 1
    <674>   DW_AT_encoding    : 8	(unsigned char)
    <675>   DW_AT_name        : (indirect string, offset: 0x4f28a): char
 <1><679>: Abbrev Number: 11 (DW_TAG_array_type)
    <67a>   DW_AT_type        : <0x94>
    <67e>   DW_AT_sibling     : <0x689>
 <2><682>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <683>   DW_AT_type        : <0x8d>
    <687>   DW_AT_upper_bound : 131
 <2><688>: Abbrev Number: 0
 <1><689>: Abbrev Number: 8 (DW_TAG_variable)
    <68a>   DW_AT_name        : (indirect string, offset: 0xe28a): commandSetGNSS_Config
    <68e>   DW_AT_decl_file   : 9
    <68f>   DW_AT_decl_line   : 30
    <690>   DW_AT_decl_column : 16
    <691>   DW_AT_type        : <0x679>
    <695>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><69b>: Abbrev Number: 11 (DW_TAG_array_type)
    <69c>   DW_AT_type        : <0x94>
    <6a0>   DW_AT_sibling     : <0x6ab>
 <2><6a4>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6a5>   DW_AT_type        : <0x8d>
    <6a9>   DW_AT_upper_bound : 26
 <2><6aa>: Abbrev Number: 0
 <1><6ab>: Abbrev Number: 8 (DW_TAG_variable)
    <6ac>   DW_AT_name        : (indirect string, offset: 0xe4f1a): commandUart1Ouput
    <6b0>   DW_AT_decl_file   : 9
    <6b1>   DW_AT_decl_line   : 48
    <6b2>   DW_AT_decl_column : 16
    <6b3>   DW_AT_type        : <0x69b>
    <6b7>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6bd>: Abbrev Number: 11 (DW_TAG_array_type)
    <6be>   DW_AT_type        : <0x94>
    <6c2>   DW_AT_sibling     : <0x6cd>
 <2><6c6>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6c7>   DW_AT_type        : <0x8d>
    <6cb>   DW_AT_upper_bound : 10
 <2><6cc>: Abbrev Number: 0
 <1><6cd>: Abbrev Number: 8 (DW_TAG_variable)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x6e8b5): commandUBXTimeUTC
    <6d2>   DW_AT_decl_file   : 9
    <6d3>   DW_AT_decl_line   : 57
    <6d4>   DW_AT_decl_column : 16
    <6d5>   DW_AT_type        : <0x6bd>
    <6d9>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6df>: Abbrev Number: 11 (DW_TAG_array_type)
    <6e0>   DW_AT_type        : <0x94>
    <6e4>   DW_AT_sibling     : <0x6ef>
 <2><6e8>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6e9>   DW_AT_type        : <0x8d>
    <6ed>   DW_AT_upper_bound : 7
 <2><6ee>: Abbrev Number: 0
 <1><6ef>: Abbrev Number: 8 (DW_TAG_variable)
    <6f0>   DW_AT_name        : (indirect string, offset: 0xa5039): pollUBXTimeUTC
    <6f4>   DW_AT_decl_file   : 9
    <6f5>   DW_AT_decl_line   : 60
    <6f6>   DW_AT_decl_column : 16
    <6f7>   DW_AT_type        : <0x6df>
    <6fb>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><701>: Abbrev Number: 11 (DW_TAG_array_type)
    <702>   DW_AT_type        : <0x94>
    <706>   DW_AT_sibling     : <0x711>
 <2><70a>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <70b>   DW_AT_type        : <0x8d>
    <70f>   DW_AT_upper_bound : 92
 <2><710>: Abbrev Number: 0
 <1><711>: Abbrev Number: 8 (DW_TAG_variable)
    <712>   DW_AT_name        : (indirect string, offset: 0xbbb15): commandSetTP1_atNVTRate
    <716>   DW_AT_decl_file   : 9
    <717>   DW_AT_decl_line   : 79
    <718>   DW_AT_decl_column : 16
    <719>   DW_AT_type        : <0x701>
    <71d>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><723>: Abbrev Number: 11 (DW_TAG_array_type)
    <724>   DW_AT_type        : <0x94>
    <728>   DW_AT_sibling     : <0x733>
 <2><72c>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <72d>   DW_AT_type        : <0x8d>
    <731>   DW_AT_upper_bound : 100
 <2><732>: Abbrev Number: 0
 <1><733>: Abbrev Number: 8 (DW_TAG_variable)
    <734>   DW_AT_name        : (indirect string, offset: 0xcfa7c): commandSetTP2
    <738>   DW_AT_decl_file   : 9
    <739>   DW_AT_decl_line   : 105
    <73a>   DW_AT_decl_column : 16
    <73b>   DW_AT_type        : <0x723>
    <73f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><745>: Abbrev Number: 11 (DW_TAG_array_type)
    <746>   DW_AT_type        : <0x94>
    <74a>   DW_AT_sibling     : <0x755>
 <2><74e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <74f>   DW_AT_type        : <0x8d>
    <753>   DW_AT_upper_bound : 28
 <2><754>: Abbrev Number: 0
 <1><755>: Abbrev Number: 8 (DW_TAG_variable)
    <756>   DW_AT_name        : (indirect string, offset: 0xdfc84): commandMeasureRate
    <75a>   DW_AT_decl_file   : 9
    <75b>   DW_AT_decl_line   : 122
    <75c>   DW_AT_decl_column : 16
    <75d>   DW_AT_type        : <0x745>
    <761>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><767>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <768>   DW_AT_encoding    : 7	(unsigned)
    <768>   DW_AT_byte_size   : 1
    <768>   DW_AT_type        : <0x3d>
    <76c>   DW_AT_decl_file   : 10
    <76d>   DW_AT_decl_line   : 27
    <76e>   DW_AT_decl_column : 14
    <76f>   DW_AT_sibling     : <0x786>
 <2><773>: Abbrev Number: 7 (DW_TAG_enumerator)
    <774>   DW_AT_name        : (indirect string, offset: 0xc783f): INIT
    <778>   DW_AT_const_value : 0
 <2><779>: Abbrev Number: 7 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0x8fbf7): NMEA
    <77e>   DW_AT_const_value : 1
 <2><77f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <780>   DW_AT_name        : UBX
    <784>   DW_AT_const_value : 2
 <2><785>: Abbrev Number: 0
 <1><786>: Abbrev Number: 2 (DW_TAG_typedef)
    <787>   DW_AT_name        : (indirect string, offset: 0xd780d): OutputProtocol
    <78b>   DW_AT_decl_file   : 10
    <78c>   DW_AT_decl_line   : 31
    <78d>   DW_AT_decl_column : 3
    <78e>   DW_AT_type        : <0x767>
 <1><792>: Abbrev Number: 10 (DW_TAG_structure_type)
    <793>   DW_AT_byte_size   : 8
    <794>   DW_AT_decl_file   : 10
    <795>   DW_AT_decl_line   : 32
    <796>   DW_AT_decl_column : 9
    <796>   DW_AT_sibling     : <0x7b5>
 <2><79a>: Abbrev Number: 1 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x25475): buffer
    <79f>   DW_AT_decl_file   : 10
    <7a0>   DW_AT_decl_line   : 33
    <7a1>   DW_AT_decl_column : 11
    <7a2>   DW_AT_type        : <0x3d7>
    <7a6>   DW_AT_data_member_location: 0
 <2><7a7>: Abbrev Number: 1 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0xfa4af): size
    <7ac>   DW_AT_decl_file   : 10
    <7ad>   DW_AT_decl_line   : 34
    <7ae>   DW_AT_decl_column : 9
    <7af>   DW_AT_type        : <0x216>
    <7b3>   DW_AT_data_member_location: 4
 <2><7b4>: Abbrev Number: 0
 <1><7b5>: Abbrev Number: 2 (DW_TAG_typedef)
    <7b6>   DW_AT_name        : (indirect string, offset: 0x80bd3): DynamicBuffer
    <7ba>   DW_AT_decl_file   : 10
    <7bb>   DW_AT_decl_line   : 35
    <7bc>   DW_AT_decl_column : 3
    <7bd>   DW_AT_type        : <0x792>
 <1><7c1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7c2>   DW_AT_byte_size   : 8
    <7c3>   DW_AT_decl_file   : 10
    <7c4>   DW_AT_decl_line   : 37
    <7c5>   DW_AT_decl_column : 9
    <7c5>   DW_AT_sibling     : <0x7fd>
 <2><7c9>: Abbrev Number: 1 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xd704e): CLASS
    <7ce>   DW_AT_decl_file   : 10
    <7cf>   DW_AT_decl_line   : 38
    <7d0>   DW_AT_decl_column : 10
    <7d1>   DW_AT_type        : <0x94>
    <7d5>   DW_AT_data_member_location: 0
 <2><7d6>: Abbrev Number: 21 (DW_TAG_member)
    <7d7>   DW_AT_name        : ID
    <7da>   DW_AT_decl_file   : 10
    <7db>   DW_AT_decl_line   : 39
    <7dc>   DW_AT_decl_column : 10
    <7dd>   DW_AT_type        : <0x94>
    <7e1>   DW_AT_data_member_location: 1
 <2><7e2>: Abbrev Number: 1 (DW_TAG_member)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x1492): len_payload
    <7e7>   DW_AT_decl_file   : 10
    <7e8>   DW_AT_decl_line   : 40
    <7e9>   DW_AT_decl_column : 11
    <7ea>   DW_AT_type        : <0xa5>
    <7ee>   DW_AT_data_member_location: 2
 <2><7ef>: Abbrev Number: 1 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xf233f): brute
    <7f4>   DW_AT_decl_file   : 10
    <7f5>   DW_AT_decl_line   : 41
    <7f6>   DW_AT_decl_column : 17
    <7f7>   DW_AT_type        : <0x7fd>
    <7fb>   DW_AT_data_member_location: 4
 <2><7fc>: Abbrev Number: 0
 <1><7fd>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7fe>   DW_AT_byte_size   : 4
    <7fe>   DW_AT_type        : <0x7b5>
 <1><802>: Abbrev Number: 2 (DW_TAG_typedef)
    <803>   DW_AT_name        : (indirect string, offset: 0x66e79): UBXMessage_parsed
    <807>   DW_AT_decl_file   : 10
    <808>   DW_AT_decl_line   : 42
    <809>   DW_AT_decl_column : 2
    <80a>   DW_AT_type        : <0x7c1>
 <1><80e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <80f>   DW_AT_byte_size   : 4
    <810>   DW_AT_decl_file   : 10
    <811>   DW_AT_decl_line   : 44
    <812>   DW_AT_decl_column : 9
    <812>   DW_AT_sibling     : <0x824>
 <2><816>: Abbrev Number: 1 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x757b9): NMEA_Brute
    <81b>   DW_AT_decl_file   : 10
    <81c>   DW_AT_decl_line   : 45
    <81d>   DW_AT_decl_column : 8
    <81e>   DW_AT_type        : <0x66d>
    <822>   DW_AT_data_member_location: 0
 <2><823>: Abbrev Number: 0
 <1><824>: Abbrev Number: 2 (DW_TAG_typedef)
    <825>   DW_AT_name        : (indirect string, offset: 0x75498): NMEAMessage_parsed
    <829>   DW_AT_decl_file   : 10
    <82a>   DW_AT_decl_line   : 46
    <82b>   DW_AT_decl_column : 2
    <82c>   DW_AT_type        : <0x80e>
 <1><830>: Abbrev Number: 30 (DW_TAG_union_type)
    <831>   DW_AT_byte_size   : 4
    <832>   DW_AT_decl_file   : 10
    <833>   DW_AT_decl_line   : 48
    <834>   DW_AT_decl_column : 9
    <835>   DW_AT_sibling     : <0x850>
 <2><839>: Abbrev Number: 22 (DW_TAG_member)
    <83a>   DW_AT_name        : (indirect string, offset: 0x4f013): NMEAMessage
    <83e>   DW_AT_decl_file   : 10
    <83e>   DW_AT_decl_line   : 49
    <83f>   DW_AT_decl_column : 22
    <840>   DW_AT_type        : <0x850>
 <2><844>: Abbrev Number: 22 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0x17862): UBXMessage
    <849>   DW_AT_decl_file   : 10
    <849>   DW_AT_decl_line   : 50
    <84a>   DW_AT_decl_column : 21
    <84b>   DW_AT_type        : <0x855>
 <2><84f>: Abbrev Number: 0
 <1><850>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <851>   DW_AT_byte_size   : 4
    <851>   DW_AT_type        : <0x824>
 <1><855>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <856>   DW_AT_byte_size   : 4
    <856>   DW_AT_type        : <0x802>
 <1><85a>: Abbrev Number: 2 (DW_TAG_typedef)
    <85b>   DW_AT_name        : (indirect string, offset: 0x7eacc): MessageStruct
    <85f>   DW_AT_decl_file   : 10
    <860>   DW_AT_decl_line   : 51
    <861>   DW_AT_decl_column : 2
    <862>   DW_AT_type        : <0x830>
 <1><866>: Abbrev Number: 10 (DW_TAG_structure_type)
    <867>   DW_AT_byte_size   : 8
    <868>   DW_AT_decl_file   : 10
    <869>   DW_AT_decl_line   : 53
    <86a>   DW_AT_decl_column : 9
    <86a>   DW_AT_sibling     : <0x889>
 <2><86e>: Abbrev Number: 1 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0x21bbc): typeMessage
    <873>   DW_AT_decl_file   : 10
    <874>   DW_AT_decl_line   : 54
    <875>   DW_AT_decl_column : 17
    <876>   DW_AT_type        : <0x786>
    <87a>   DW_AT_data_member_location: 0
 <2><87b>: Abbrev Number: 1 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0x4f017): Message
    <880>   DW_AT_decl_file   : 10
    <881>   DW_AT_decl_line   : 55
    <882>   DW_AT_decl_column : 16
    <883>   DW_AT_type        : <0x85a>
    <887>   DW_AT_data_member_location: 4
 <2><888>: Abbrev Number: 0
 <1><889>: Abbrev Number: 2 (DW_TAG_typedef)
    <88a>   DW_AT_name        : (indirect string, offset: 0x65b27): GenericMessage
    <88e>   DW_AT_decl_file   : 10
    <88f>   DW_AT_decl_line   : 56
    <890>   DW_AT_decl_column : 2
    <891>   DW_AT_type        : <0x866>
 <1><895>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <896>   DW_AT_encoding    : 7	(unsigned)
    <896>   DW_AT_byte_size   : 1
    <896>   DW_AT_type        : <0x3d>
    <89a>   DW_AT_decl_file   : 11
    <89b>   DW_AT_decl_line   : 25
    <89c>   DW_AT_decl_column : 14
    <89d>   DW_AT_sibling     : <0x8b4>
 <2><8a1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a2>   DW_AT_name        : RAW
    <8a6>   DW_AT_const_value : 0
 <2><8a7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : HEX
    <8ac>   DW_AT_const_value : 1
 <2><8ad>: Abbrev Number: 7 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xbde48): ASCII
    <8b2>   DW_AT_const_value : 2
 <2><8b3>: Abbrev Number: 0
 <1><8b4>: Abbrev Number: 2 (DW_TAG_typedef)
    <8b5>   DW_AT_name        : (indirect string, offset: 0xe2049): OutputType
    <8b9>   DW_AT_decl_file   : 11
    <8ba>   DW_AT_decl_line   : 29
    <8bb>   DW_AT_decl_column : 3
    <8bc>   DW_AT_type        : <0x895>
 <1><8c0>: Abbrev Number: 23 (DW_TAG_variable)
    <8c1>   DW_AT_name        : (indirect string, offset: 0xff8e9): type
    <8c5>   DW_AT_decl_file   : 11
    <8c5>   DW_AT_decl_line   : 30
    <8c6>   DW_AT_decl_column : 19
    <8c7>   DW_AT_type        : <0x8b4>
    <8cb>   DW_AT_external    : 1
    <8cb>   DW_AT_declaration : 1
 <1><8cb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8cc>   DW_AT_byte_size   : 12
    <8cd>   DW_AT_decl_file   : 11
    <8ce>   DW_AT_decl_line   : 32
    <8cf>   DW_AT_decl_column : 9
    <8cf>   DW_AT_sibling     : <0x8fa>
 <2><8d3>: Abbrev Number: 1 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0xae742): huart
    <8d8>   DW_AT_decl_file   : 11
    <8d9>   DW_AT_decl_line   : 33
    <8da>   DW_AT_decl_column : 22
    <8db>   DW_AT_type        : <0x8fa>
    <8df>   DW_AT_data_member_location: 0
 <2><8e0>: Abbrev Number: 1 (DW_TAG_member)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x8b534): huartDebug
    <8e5>   DW_AT_decl_file   : 11
    <8e6>   DW_AT_decl_line   : 34
    <8e7>   DW_AT_decl_column : 22
    <8e8>   DW_AT_type        : <0x8fa>
    <8ec>   DW_AT_data_member_location: 4
 <2><8ed>: Abbrev Number: 21 (DW_TAG_member)
    <8ee>   DW_AT_name        : Rx
    <8f1>   DW_AT_decl_file   : 11
    <8f2>   DW_AT_decl_line   : 35
    <8f3>   DW_AT_decl_column : 17
    <8f4>   DW_AT_type        : <0x7fd>
    <8f8>   DW_AT_data_member_location: 8
 <2><8f9>: Abbrev Number: 0
 <1><8fa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <8fb>   DW_AT_byte_size   : 4
    <8fb>   DW_AT_type        : <0x661>
 <1><8ff>: Abbrev Number: 2 (DW_TAG_typedef)
    <900>   DW_AT_name        : (indirect string, offset: 0x3e502): GNSSCom_HandleTypeDef
    <904>   DW_AT_decl_file   : 11
    <905>   DW_AT_decl_line   : 36
    <906>   DW_AT_decl_column : 3
    <907>   DW_AT_type        : <0x8cb>
 <1><90b>: Abbrev Number: 23 (DW_TAG_variable)
    <90c>   DW_AT_name        : (indirect string, offset: 0x413f4): hGNSSCom
    <910>   DW_AT_decl_file   : 11
    <910>   DW_AT_decl_line   : 37
    <911>   DW_AT_decl_column : 30
    <912>   DW_AT_type        : <0x8ff>
    <916>   DW_AT_external    : 1
    <916>   DW_AT_declaration : 1
 <1><916>: Abbrev Number: 5 (DW_TAG_base_type)
    <917>   DW_AT_byte_size   : 1
    <918>   DW_AT_encoding    : 2	(boolean)
    <919>   DW_AT_name        : (indirect string, offset: 0x6fe50): _Bool
 <1><91d>: Abbrev Number: 24 (DW_TAG_variable)
    <91e>   DW_AT_specification: <0x90b>
    <922>   DW_AT_decl_file   : 1
    <922>   DW_AT_decl_line   : 14
    <923>   DW_AT_decl_column : 23
    <924>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><92a>: Abbrev Number: 24 (DW_TAG_variable)
    <92b>   DW_AT_specification: <0x8c0>
    <92f>   DW_AT_decl_file   : 1
    <92f>   DW_AT_decl_line   : 15
    <930>   DW_AT_decl_column : 12
    <931>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><937>: Abbrev Number: 31 (DW_TAG_variable)
    <938>   DW_AT_name        : (indirect string, offset: 0x3b335): protocol
    <93c>   DW_AT_decl_file   : 1
    <93d>   DW_AT_decl_line   : 16
    <93e>   DW_AT_decl_column : 16
    <93f>   DW_AT_type        : <0x786>
    <943>   DW_AT_external    : 1
    <943>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><949>: Abbrev Number: 32 (DW_TAG_subprogram)
    <94a>   DW_AT_external    : 1
    <94a>   DW_AT_name        : (indirect string, offset: 0x5b956): updateMemoryUsage
    <94e>   DW_AT_decl_file   : 12
    <94f>   DW_AT_decl_line   : 31
    <950>   DW_AT_decl_column : 6
    <951>   DW_AT_prototyped  : 1
    <951>   DW_AT_declaration : 1
 <1><951>: Abbrev Number: 33 (DW_TAG_subprogram)
    <952>   DW_AT_external    : 1
    <952>   DW_AT_name        : (indirect string, offset: 0x40647): vPortFree
    <956>   DW_AT_decl_file   : 13
    <957>   DW_AT_decl_line   : 164
    <958>   DW_AT_decl_column : 6
    <959>   DW_AT_prototyped  : 1
    <959>   DW_AT_declaration : 1
    <959>   DW_AT_sibling     : <0x963>
 <2><95d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <95e>   DW_AT_type        : <0x3af>
 <2><962>: Abbrev Number: 0
 <1><963>: Abbrev Number: 34 (DW_TAG_subprogram)
    <964>   DW_AT_external    : 1
    <964>   DW_AT_name        : (indirect string, offset: 0x8ba02): pvPortMalloc
    <968>   DW_AT_decl_file   : 13
    <969>   DW_AT_decl_line   : 163
    <96a>   DW_AT_decl_column : 7
    <96b>   DW_AT_prototyped  : 1
    <96b>   DW_AT_type        : <0x3af>
    <96f>   DW_AT_declaration : 1
    <96f>   DW_AT_sibling     : <0x979>
 <2><973>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <974>   DW_AT_type        : <0x216>
 <2><978>: Abbrev Number: 0
 <1><979>: Abbrev Number: 25 (DW_TAG_subprogram)
    <97a>   DW_AT_external    : 1
    <97a>   DW_AT_name        : (indirect string, offset: 0x88ecb): GNSSCom_MessageAdapter
    <97e>   DW_AT_decl_file   : 1
    <97e>   DW_AT_decl_line   : 52
    <97f>   DW_AT_decl_column : 6
    <97f>   DW_AT_prototyped  : 1
    <97f>   DW_AT_low_pc      : 0x8000f00
    <983>   DW_AT_high_pc     : 0xb4
    <987>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <989>   DW_AT_call_all_tail_calls: 1
    <989>   DW_AT_sibling     : <0x9d1>
 <2><98d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <98e>   DW_AT_name        : (indirect string, offset: 0x25475): buffer
    <992>   DW_AT_decl_file   : 1
    <992>   DW_AT_decl_line   : 52
    <993>   DW_AT_decl_column : 38
    <994>   DW_AT_type        : <0x3d7>
    <998>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><99b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <99c>   DW_AT_name        : (indirect string, offset: 0xfa4af): size
    <9a0>   DW_AT_decl_file   : 1
    <9a0>   DW_AT_decl_line   : 52
    <9a1>   DW_AT_decl_column : 53
    <9a2>   DW_AT_type        : <0x9d1>
    <9a6>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><9a9>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x5c81c): genericMessage
    <9ae>   DW_AT_decl_file   : 1
    <9ae>   DW_AT_decl_line   : 52
    <9af>   DW_AT_decl_column : 75
    <9b0>   DW_AT_type        : <0x9d6>
    <9b4>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><9b7>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <9b8>   DW_AT_low_pc      : 0x8000f98
    <9bc>   DW_AT_high_pc     : 0x14
 <3><9c0>: Abbrev Number: 8 (DW_TAG_variable)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x4f013): NMEAMessage
    <9c5>   DW_AT_decl_file   : 1
    <9c6>   DW_AT_decl_line   : 71
    <9c7>   DW_AT_decl_column : 24
    <9c8>   DW_AT_type        : <0x850>
    <9cc>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><9cf>: Abbrev Number: 0
 <2><9d0>: Abbrev Number: 0
 <1><9d1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9d2>   DW_AT_byte_size   : 4
    <9d2>   DW_AT_type        : <0x216>
 <1><9d6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <9d7>   DW_AT_byte_size   : 4
    <9d7>   DW_AT_type        : <0x889>
 <1><9db>: Abbrev Number: 25 (DW_TAG_subprogram)
    <9dc>   DW_AT_external    : 1
    <9dc>   DW_AT_name        : (indirect string, offset: 0x50273): freeBuffer
    <9e0>   DW_AT_decl_file   : 1
    <9e0>   DW_AT_decl_line   : 47
    <9e1>   DW_AT_decl_column : 6
    <9e1>   DW_AT_prototyped  : 1
    <9e1>   DW_AT_low_pc      : 0x8000ee0
    <9e5>   DW_AT_high_pc     : 0x20
    <9e9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9eb>   DW_AT_call_all_tail_calls: 1
    <9eb>   DW_AT_sibling     : <0x9fe>
 <2><9ef>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9f0>   DW_AT_name        : (indirect string, offset: 0xc4a6c): bufferDynamic
    <9f4>   DW_AT_decl_file   : 1
    <9f4>   DW_AT_decl_line   : 47
    <9f5>   DW_AT_decl_column : 32
    <9f6>   DW_AT_type        : <0x7fd>
    <9fa>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9fd>: Abbrev Number: 0
 <1><9fe>: Abbrev Number: 36 (DW_TAG_subprogram)
    <9ff>   DW_AT_external    : 1
    <9ff>   DW_AT_name        : (indirect string, offset: 0x71287): resizeBuffer
    <a03>   DW_AT_decl_file   : 1
    <a04>   DW_AT_decl_line   : 40
    <a05>   DW_AT_decl_column : 6
    <a06>   DW_AT_prototyped  : 1
    <a06>   DW_AT_low_pc      : 0
    <a0a>   DW_AT_high_pc     : 0x16
    <a0e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a10>   DW_AT_call_all_calls: 1
    <a10>   DW_AT_sibling     : <0xa31>
 <2><a14>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a15>   DW_AT_name        : (indirect string, offset: 0xc4a6c): bufferDynamic
    <a19>   DW_AT_decl_file   : 1
    <a19>   DW_AT_decl_line   : 40
    <a1a>   DW_AT_decl_column : 34
    <a1b>   DW_AT_type        : <0x7fd>
    <a1f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a22>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a23>   DW_AT_name        : (indirect string, offset: 0x2934f): newSize
    <a27>   DW_AT_decl_file   : 1
    <a27>   DW_AT_decl_line   : 40
    <a28>   DW_AT_decl_column : 56
    <a29>   DW_AT_type        : <0x216>
    <a2d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a30>: Abbrev Number: 0
 <1><a31>: Abbrev Number: 37 (DW_TAG_subprogram)
    <a32>   DW_AT_external    : 1
    <a32>   DW_AT_name        : (indirect string, offset: 0x2f45c): initializeBuffer
    <a36>   DW_AT_decl_file   : 1
    <a37>   DW_AT_decl_line   : 25
    <a38>   DW_AT_decl_column : 16
    <a39>   DW_AT_prototyped  : 1
    <a39>   DW_AT_type        : <0x7fd>
    <a3d>   DW_AT_low_pc      : 0x8000e98
    <a41>   DW_AT_high_pc     : 0x48
    <a45>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a47>   DW_AT_call_all_tail_calls: 1
    <a47>   DW_AT_sibling     : <0xa69>
 <2><a4b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xa5c89): initialSize
    <a50>   DW_AT_decl_file   : 1
    <a50>   DW_AT_decl_line   : 25
    <a51>   DW_AT_decl_column : 40
    <a52>   DW_AT_type        : <0x216>
    <a56>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a59>: Abbrev Number: 8 (DW_TAG_variable)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xc4a6c): bufferDynamic
    <a5e>   DW_AT_decl_file   : 1
    <a5f>   DW_AT_decl_line   : 26
    <a60>   DW_AT_decl_column : 17
    <a61>   DW_AT_type        : <0x7fd>
    <a65>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a68>: Abbrev Number: 0
 <1><a69>: Abbrev Number: 38 (DW_TAG_subprogram)
    <a6a>   DW_AT_external    : 1
    <a6a>   DW_AT_name        : (indirect string, offset: 0x9dbc3): GNSSCom_Init
    <a6e>   DW_AT_decl_file   : 1
    <a6f>   DW_AT_decl_line   : 18
    <a70>   DW_AT_decl_column : 6
    <a71>   DW_AT_prototyped  : 1
    <a71>   DW_AT_low_pc      : 0
    <a75>   DW_AT_high_pc     : 0x28
    <a79>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a7b>   DW_AT_call_all_calls: 1
 <2><a7b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xae742): huart
    <a80>   DW_AT_decl_file   : 1
    <a80>   DW_AT_decl_line   : 18
    <a81>   DW_AT_decl_column : 39
    <a82>   DW_AT_type        : <0x8fa>
    <a86>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a89>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x8b534): huartDebug
    <a8e>   DW_AT_decl_file   : 1
    <a8e>   DW_AT_decl_line   : 18
    <a8f>   DW_AT_decl_column : 65
    <a90>   DW_AT_type        : <0x8fa>
    <a94>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a97>: Abbrev Number: 0
 <1><a98>: Abbrev Number: 0
  Compilation Unit @ offset 0xa99:
   Length:        0x48a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x25b
   Pointer Size:  4
 <0><aa5>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <aa6>   DW_AT_producer    : (indirect string, offset: 0x40479): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <aaa>   DW_AT_language    : 29	(C11)
    <aab>   DW_AT_name        : (indirect string, offset: 0xf7960): ../Core/Src/GNSS/debug_formatter.c
    <aaf>   DW_AT_comp_dir    : (indirect string, offset: 0x4bed7): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <ab3>   DW_AT_ranges      : 0x38
    <ab7>   DW_AT_low_pc      : 0
    <abb>   DW_AT_stmt_list   : 0xce5
    <abf>   DW_AT_macros      : 0x26b40
 <1><ac3>: Abbrev Number: 7 (DW_TAG_typedef)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xf7899): __int8_t
    <ac8>   DW_AT_decl_file   : 2
    <ac9>   DW_AT_decl_line   : 41
    <aca>   DW_AT_decl_column : 23
    <acb>   DW_AT_type        : <0xacf>
 <1><acf>: Abbrev Number: 4 (DW_TAG_base_type)
    <ad0>   DW_AT_byte_size   : 1
    <ad1>   DW_AT_encoding    : 6	(signed char)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x7be97): signed char
 <1><ad6>: Abbrev Number: 7 (DW_TAG_typedef)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x473f5): __uint8_t
    <adb>   DW_AT_decl_file   : 2
    <adc>   DW_AT_decl_line   : 43
    <add>   DW_AT_decl_column : 24
    <ade>   DW_AT_type        : <0xae2>
 <1><ae2>: Abbrev Number: 4 (DW_TAG_base_type)
    <ae3>   DW_AT_byte_size   : 1
    <ae4>   DW_AT_encoding    : 8	(unsigned char)
    <ae5>   DW_AT_name        : (indirect string, offset: 0xee2e8): unsigned char
 <1><ae9>: Abbrev Number: 4 (DW_TAG_base_type)
    <aea>   DW_AT_byte_size   : 2
    <aeb>   DW_AT_encoding    : 5	(signed)
    <aec>   DW_AT_name        : (indirect string, offset: 0xb6ec1): short int
 <1><af0>: Abbrev Number: 4 (DW_TAG_base_type)
    <af1>   DW_AT_byte_size   : 2
    <af2>   DW_AT_encoding    : 7	(unsigned)
    <af3>   DW_AT_name        : (indirect string, offset: 0xec6fb): short unsigned int
 <1><af7>: Abbrev Number: 4 (DW_TAG_base_type)
    <af8>   DW_AT_byte_size   : 4
    <af9>   DW_AT_encoding    : 5	(signed)
    <afa>   DW_AT_name        : (indirect string, offset: 0x148e7): long int
 <1><afe>: Abbrev Number: 4 (DW_TAG_base_type)
    <aff>   DW_AT_byte_size   : 4
    <b00>   DW_AT_encoding    : 7	(unsigned)
    <b01>   DW_AT_name        : (indirect string, offset: 0x5dc02): long unsigned int
 <1><b05>: Abbrev Number: 4 (DW_TAG_base_type)
    <b06>   DW_AT_byte_size   : 8
    <b07>   DW_AT_encoding    : 5	(signed)
    <b08>   DW_AT_name        : (indirect string, offset: 0x70439): long long int
 <1><b0c>: Abbrev Number: 4 (DW_TAG_base_type)
    <b0d>   DW_AT_byte_size   : 8
    <b0e>   DW_AT_encoding    : 7	(unsigned)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x3300c): long long unsigned int
 <1><b13>: Abbrev Number: 16 (DW_TAG_base_type)
    <b14>   DW_AT_byte_size   : 4
    <b15>   DW_AT_encoding    : 5	(signed)
    <b16>   DW_AT_name        : int
 <1><b1a>: Abbrev Number: 4 (DW_TAG_base_type)
    <b1b>   DW_AT_byte_size   : 4
    <b1c>   DW_AT_encoding    : 7	(unsigned)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x13de3): unsigned int
 <1><b21>: Abbrev Number: 7 (DW_TAG_typedef)
    <b22>   DW_AT_name        : (indirect string, offset: 0xa10f): size_t
    <b26>   DW_AT_decl_file   : 3
    <b27>   DW_AT_decl_line   : 214
    <b28>   DW_AT_decl_column : 23
    <b29>   DW_AT_type        : <0xb1a>
 <1><b2d>: Abbrev Number: 4 (DW_TAG_base_type)
    <b2e>   DW_AT_byte_size   : 8
    <b2f>   DW_AT_encoding    : 4	(float)
    <b30>   DW_AT_name        : (indirect string, offset: 0x166e4): long double
 <1><b34>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <b35>   DW_AT_byte_size   : 4
 <1><b36>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <b37>   DW_AT_byte_size   : 4
    <b37>   DW_AT_type        : <0xb3b>
 <1><b3b>: Abbrev Number: 4 (DW_TAG_base_type)
    <b3c>   DW_AT_byte_size   : 1
    <b3d>   DW_AT_encoding    : 8	(unsigned char)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x4f28a): char
 <1><b42>: Abbrev Number: 7 (DW_TAG_typedef)
    <b43>   DW_AT_name        : (indirect string, offset: 0xf789b): int8_t
    <b47>   DW_AT_decl_file   : 4
    <b48>   DW_AT_decl_line   : 20
    <b49>   DW_AT_decl_column : 18
    <b4a>   DW_AT_type        : <0xac3>
 <1><b4e>: Abbrev Number: 7 (DW_TAG_typedef)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x473f7): uint8_t
    <b53>   DW_AT_decl_file   : 4
    <b54>   DW_AT_decl_line   : 24
    <b55>   DW_AT_decl_column : 19
    <b56>   DW_AT_type        : <0xad6>
 <1><b5a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <b5b>   DW_AT_byte_size   : 4
    <b5b>   DW_AT_type        : <0xb4e>
 <1><b5f>: Abbrev Number: 2 (DW_TAG_array_type)
    <b60>   DW_AT_type        : <0xb4e>
    <b64>   DW_AT_sibling     : <0xb6f>
 <2><b68>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <b69>   DW_AT_type        : <0xb1a>
    <b6d>   DW_AT_upper_bound : 1
 <2><b6e>: Abbrev Number: 0
 <1><b6f>: Abbrev Number: 2 (DW_TAG_array_type)
    <b70>   DW_AT_type        : <0xb4e>
    <b74>   DW_AT_sibling     : <0xb7f>
 <2><b78>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <b79>   DW_AT_type        : <0xb1a>
    <b7d>   DW_AT_upper_bound : 131
 <2><b7e>: Abbrev Number: 0
 <1><b7f>: Abbrev Number: 1 (DW_TAG_variable)
    <b80>   DW_AT_name        : (indirect string, offset: 0xe28a): commandSetGNSS_Config
    <b84>   DW_AT_decl_file   : 5
    <b85>   DW_AT_decl_line   : 30
    <b86>   DW_AT_decl_column : 16
    <b87>   DW_AT_type        : <0xb6f>
    <b8b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><b91>: Abbrev Number: 2 (DW_TAG_array_type)
    <b92>   DW_AT_type        : <0xb4e>
    <b96>   DW_AT_sibling     : <0xba1>
 <2><b9a>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <b9b>   DW_AT_type        : <0xb1a>
    <b9f>   DW_AT_upper_bound : 26
 <2><ba0>: Abbrev Number: 0
 <1><ba1>: Abbrev Number: 1 (DW_TAG_variable)
    <ba2>   DW_AT_name        : (indirect string, offset: 0xe4f1a): commandUart1Ouput
    <ba6>   DW_AT_decl_file   : 5
    <ba7>   DW_AT_decl_line   : 48
    <ba8>   DW_AT_decl_column : 16
    <ba9>   DW_AT_type        : <0xb91>
    <bad>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><bb3>: Abbrev Number: 2 (DW_TAG_array_type)
    <bb4>   DW_AT_type        : <0xb4e>
    <bb8>   DW_AT_sibling     : <0xbc3>
 <2><bbc>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <bbd>   DW_AT_type        : <0xb1a>
    <bc1>   DW_AT_upper_bound : 10
 <2><bc2>: Abbrev Number: 0
 <1><bc3>: Abbrev Number: 1 (DW_TAG_variable)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x6e8b5): commandUBXTimeUTC
    <bc8>   DW_AT_decl_file   : 5
    <bc9>   DW_AT_decl_line   : 57
    <bca>   DW_AT_decl_column : 16
    <bcb>   DW_AT_type        : <0xbb3>
    <bcf>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><bd5>: Abbrev Number: 2 (DW_TAG_array_type)
    <bd6>   DW_AT_type        : <0xb4e>
    <bda>   DW_AT_sibling     : <0xbe5>
 <2><bde>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <bdf>   DW_AT_type        : <0xb1a>
    <be3>   DW_AT_upper_bound : 7
 <2><be4>: Abbrev Number: 0
 <1><be5>: Abbrev Number: 1 (DW_TAG_variable)
    <be6>   DW_AT_name        : (indirect string, offset: 0xa5039): pollUBXTimeUTC
    <bea>   DW_AT_decl_file   : 5
    <beb>   DW_AT_decl_line   : 60
    <bec>   DW_AT_decl_column : 16
    <bed>   DW_AT_type        : <0xbd5>
    <bf1>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><bf7>: Abbrev Number: 2 (DW_TAG_array_type)
    <bf8>   DW_AT_type        : <0xb4e>
    <bfc>   DW_AT_sibling     : <0xc07>
 <2><c00>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <c01>   DW_AT_type        : <0xb1a>
    <c05>   DW_AT_upper_bound : 92
 <2><c06>: Abbrev Number: 0
 <1><c07>: Abbrev Number: 1 (DW_TAG_variable)
    <c08>   DW_AT_name        : (indirect string, offset: 0xbbb15): commandSetTP1_atNVTRate
    <c0c>   DW_AT_decl_file   : 5
    <c0d>   DW_AT_decl_line   : 79
    <c0e>   DW_AT_decl_column : 16
    <c0f>   DW_AT_type        : <0xbf7>
    <c13>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c19>: Abbrev Number: 2 (DW_TAG_array_type)
    <c1a>   DW_AT_type        : <0xb4e>
    <c1e>   DW_AT_sibling     : <0xc29>
 <2><c22>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <c23>   DW_AT_type        : <0xb1a>
    <c27>   DW_AT_upper_bound : 100
 <2><c28>: Abbrev Number: 0
 <1><c29>: Abbrev Number: 1 (DW_TAG_variable)
    <c2a>   DW_AT_name        : (indirect string, offset: 0xcfa7c): commandSetTP2
    <c2e>   DW_AT_decl_file   : 5
    <c2f>   DW_AT_decl_line   : 105
    <c30>   DW_AT_decl_column : 16
    <c31>   DW_AT_type        : <0xc19>
    <c35>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c3b>: Abbrev Number: 2 (DW_TAG_array_type)
    <c3c>   DW_AT_type        : <0xb4e>
    <c40>   DW_AT_sibling     : <0xc4b>
 <2><c44>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <c45>   DW_AT_type        : <0xb1a>
    <c49>   DW_AT_upper_bound : 28
 <2><c4a>: Abbrev Number: 0
 <1><c4b>: Abbrev Number: 1 (DW_TAG_variable)
    <c4c>   DW_AT_name        : (indirect string, offset: 0xdfc84): commandMeasureRate
    <c50>   DW_AT_decl_file   : 5
    <c51>   DW_AT_decl_line   : 122
    <c52>   DW_AT_decl_column : 16
    <c53>   DW_AT_type        : <0xc3b>
    <c57>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c5d>: Abbrev Number: 4 (DW_TAG_base_type)
    <c5e>   DW_AT_byte_size   : 1
    <c5f>   DW_AT_encoding    : 2	(boolean)
    <c60>   DW_AT_name        : (indirect string, offset: 0x6fe50): _Bool
 <1><c64>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <c65>   DW_AT_encoding    : 7	(unsigned)
    <c66>   DW_AT_byte_size   : 1
    <c67>   DW_AT_type        : <0xae2>
    <c6b>   DW_AT_decl_file   : 6
    <c6c>   DW_AT_decl_line   : 13
    <c6d>   DW_AT_decl_column : 14
    <c6e>   DW_AT_sibling     : <0xcaf>
 <2><c72>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c73>   DW_AT_name        : (indirect string, offset: 0xf7aed): TYPE_BITFIELD
    <c77>   DW_AT_const_value : 0
 <2><c78>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c79>   DW_AT_name        : (indirect string, offset: 0xf79d1): TYPE_U1
    <c7d>   DW_AT_const_value : 1
 <2><c7e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xf798e): TYPE_I1
    <c83>   DW_AT_const_value : 2
 <2><c84>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c85>   DW_AT_name        : (indirect string, offset: 0xf78c9): TYPE_X1
    <c89>   DW_AT_const_value : 3
 <2><c8a>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c8b>   DW_AT_name        : (indirect string, offset: 0xf78c1): TYPE_U2
    <c8f>   DW_AT_const_value : 4
 <2><c90>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c91>   DW_AT_name        : (indirect string, offset: 0xf78b1): TYPE_I2
    <c95>   DW_AT_const_value : 5
 <2><c96>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c97>   DW_AT_name        : (indirect string, offset: 0xf78b9): TYPE_X2
    <c9b>   DW_AT_const_value : 6
 <2><c9c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c9d>   DW_AT_name        : (indirect string, offset: 0xf79d9): TYPE_U4
    <ca1>   DW_AT_const_value : 7
 <2><ca2>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ca3>   DW_AT_name        : (indirect string, offset: 0xf7996): TYPE_I4
    <ca7>   DW_AT_const_value : 8
 <2><ca8>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ca9>   DW_AT_name        : (indirect string, offset: 0xf78d1): TYPE_X4
    <cad>   DW_AT_const_value : 9
 <2><cae>: Abbrev Number: 0
 <1><caf>: Abbrev Number: 7 (DW_TAG_typedef)
    <cb0>   DW_AT_name        : (indirect string, offset: 0xf78a8): DataType
    <cb4>   DW_AT_decl_file   : 6
    <cb5>   DW_AT_decl_line   : 25
    <cb6>   DW_AT_decl_column : 3
    <cb7>   DW_AT_type        : <0xc64>
 <1><cbb>: Abbrev Number: 8 (DW_TAG_structure_type)
    <cbc>   DW_AT_byte_size   : 1
    <cbd>   DW_AT_decl_file   : 6
    <cbd>   DW_AT_decl_line   : 27
    <cbe>   DW_AT_decl_column : 9
    <cbe>   DW_AT_sibling     : <0xcce>
 <2><cc2>: Abbrev Number: 9 (DW_TAG_member)
    <cc3>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <cc7>   DW_AT_decl_file   : 6
    <cc7>   DW_AT_decl_line   : 28
    <cc8>   DW_AT_decl_column : 10
    <cc9>   DW_AT_type        : <0xcce>
    <ccd>   DW_AT_data_member_location: 0
 <2><ccd>: Abbrev Number: 0
 <1><cce>: Abbrev Number: 2 (DW_TAG_array_type)
    <ccf>   DW_AT_type        : <0xb4e>
    <cd3>   DW_AT_sibling     : <0xcde>
 <2><cd7>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <cd8>   DW_AT_type        : <0xb1a>
    <cdc>   DW_AT_upper_bound : 0
 <2><cdd>: Abbrev Number: 0
 <1><cde>: Abbrev Number: 10 (DW_TAG_typedef)
    <cdf>   DW_AT_name        : U1
    <ce2>   DW_AT_decl_file   : 6
    <ce2>   DW_AT_decl_line   : 29
    <ce3>   DW_AT_decl_column : 2
    <ce3>   DW_AT_type        : <0xcbb>
 <1><ce7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ce8>   DW_AT_byte_size   : 1
    <ce9>   DW_AT_decl_file   : 6
    <ce9>   DW_AT_decl_line   : 31
    <cea>   DW_AT_decl_column : 9
    <cea>   DW_AT_sibling     : <0xcfa>
 <2><cee>: Abbrev Number: 9 (DW_TAG_member)
    <cef>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <cf3>   DW_AT_decl_file   : 6
    <cf3>   DW_AT_decl_line   : 32
    <cf4>   DW_AT_decl_column : 9
    <cf5>   DW_AT_type        : <0xcfa>
    <cf9>   DW_AT_data_member_location: 0
 <2><cf9>: Abbrev Number: 0
 <1><cfa>: Abbrev Number: 2 (DW_TAG_array_type)
    <cfb>   DW_AT_type        : <0xb42>
    <cff>   DW_AT_sibling     : <0xd0a>
 <2><d03>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <d04>   DW_AT_type        : <0xb1a>
    <d08>   DW_AT_upper_bound : 0
 <2><d09>: Abbrev Number: 0
 <1><d0a>: Abbrev Number: 10 (DW_TAG_typedef)
    <d0b>   DW_AT_name        : I1
    <d0e>   DW_AT_decl_file   : 6
    <d0e>   DW_AT_decl_line   : 33
    <d0f>   DW_AT_decl_column : 2
    <d0f>   DW_AT_type        : <0xce7>
 <1><d13>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d14>   DW_AT_byte_size   : 2
    <d15>   DW_AT_decl_file   : 6
    <d15>   DW_AT_decl_line   : 50
    <d16>   DW_AT_decl_column : 9
    <d16>   DW_AT_sibling     : <0xd26>
 <2><d1a>: Abbrev Number: 9 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <d1f>   DW_AT_decl_file   : 6
    <d1f>   DW_AT_decl_line   : 51
    <d20>   DW_AT_decl_column : 10
    <d21>   DW_AT_type        : <0xb5f>
    <d25>   DW_AT_data_member_location: 0
 <2><d25>: Abbrev Number: 0
 <1><d26>: Abbrev Number: 10 (DW_TAG_typedef)
    <d27>   DW_AT_name        : U2
    <d2a>   DW_AT_decl_file   : 6
    <d2a>   DW_AT_decl_line   : 52
    <d2b>   DW_AT_decl_column : 2
    <d2b>   DW_AT_type        : <0xd13>
 <1><d2f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d30>   DW_AT_byte_size   : 2
    <d31>   DW_AT_decl_file   : 6
    <d31>   DW_AT_decl_line   : 54
    <d32>   DW_AT_decl_column : 9
    <d32>   DW_AT_sibling     : <0xd42>
 <2><d36>: Abbrev Number: 9 (DW_TAG_member)
    <d37>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <d3b>   DW_AT_decl_file   : 6
    <d3b>   DW_AT_decl_line   : 55
    <d3c>   DW_AT_decl_column : 9
    <d3d>   DW_AT_type        : <0xd42>
    <d41>   DW_AT_data_member_location: 0
 <2><d41>: Abbrev Number: 0
 <1><d42>: Abbrev Number: 2 (DW_TAG_array_type)
    <d43>   DW_AT_type        : <0xb42>
    <d47>   DW_AT_sibling     : <0xd52>
 <2><d4b>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <d4c>   DW_AT_type        : <0xb1a>
    <d50>   DW_AT_upper_bound : 1
 <2><d51>: Abbrev Number: 0
 <1><d52>: Abbrev Number: 10 (DW_TAG_typedef)
    <d53>   DW_AT_name        : I2
    <d56>   DW_AT_decl_file   : 6
    <d56>   DW_AT_decl_line   : 56
    <d57>   DW_AT_decl_column : 2
    <d57>   DW_AT_type        : <0xd2f>
 <1><d5b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d5c>   DW_AT_byte_size   : 4
    <d5d>   DW_AT_decl_file   : 6
    <d5d>   DW_AT_decl_line   : 81
    <d5e>   DW_AT_decl_column : 9
    <d5e>   DW_AT_sibling     : <0xd6e>
 <2><d62>: Abbrev Number: 9 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <d67>   DW_AT_decl_file   : 6
    <d67>   DW_AT_decl_line   : 82
    <d68>   DW_AT_decl_column : 10
    <d69>   DW_AT_type        : <0xd6e>
    <d6d>   DW_AT_data_member_location: 0
 <2><d6d>: Abbrev Number: 0
 <1><d6e>: Abbrev Number: 2 (DW_TAG_array_type)
    <d6f>   DW_AT_type        : <0xb4e>
    <d73>   DW_AT_sibling     : <0xd7e>
 <2><d77>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <d78>   DW_AT_type        : <0xb1a>
    <d7c>   DW_AT_upper_bound : 3
 <2><d7d>: Abbrev Number: 0
 <1><d7e>: Abbrev Number: 10 (DW_TAG_typedef)
    <d7f>   DW_AT_name        : U4
    <d82>   DW_AT_decl_file   : 6
    <d82>   DW_AT_decl_line   : 83
    <d83>   DW_AT_decl_column : 2
    <d83>   DW_AT_type        : <0xd5b>
 <1><d87>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d88>   DW_AT_byte_size   : 4
    <d89>   DW_AT_decl_file   : 6
    <d89>   DW_AT_decl_line   : 85
    <d8a>   DW_AT_decl_column : 9
    <d8a>   DW_AT_sibling     : <0xd9a>
 <2><d8e>: Abbrev Number: 9 (DW_TAG_member)
    <d8f>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <d93>   DW_AT_decl_file   : 6
    <d93>   DW_AT_decl_line   : 86
    <d94>   DW_AT_decl_column : 9
    <d95>   DW_AT_type        : <0xd9a>
    <d99>   DW_AT_data_member_location: 0
 <2><d99>: Abbrev Number: 0
 <1><d9a>: Abbrev Number: 2 (DW_TAG_array_type)
    <d9b>   DW_AT_type        : <0xb42>
    <d9f>   DW_AT_sibling     : <0xdaa>
 <2><da3>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <da4>   DW_AT_type        : <0xb1a>
    <da8>   DW_AT_upper_bound : 3
 <2><da9>: Abbrev Number: 0
 <1><daa>: Abbrev Number: 10 (DW_TAG_typedef)
    <dab>   DW_AT_name        : I4
    <dae>   DW_AT_decl_file   : 6
    <dae>   DW_AT_decl_line   : 87
    <daf>   DW_AT_decl_column : 2
    <daf>   DW_AT_type        : <0xd87>
 <1><db3>: Abbrev Number: 14 (DW_TAG_subprogram)
    <db4>   DW_AT_external    : 1
    <db4>   DW_AT_name        : (indirect string, offset: 0xf7855): int8ArrayToString
    <db8>   DW_AT_decl_file   : 7
    <db8>   DW_AT_decl_line   : 27
    <db9>   DW_AT_decl_column : 7
    <db9>   DW_AT_prototyped  : 1
    <db9>   DW_AT_type        : <0xb36>
    <dbd>   DW_AT_declaration : 1
    <dbd>   DW_AT_sibling     : <0xdcc>
 <2><dc1>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <dc2>   DW_AT_type        : <0xdcc>
 <2><dc6>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <dc7>   DW_AT_type        : <0xb21>
 <2><dcb>: Abbrev Number: 0
 <1><dcc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <dcd>   DW_AT_byte_size   : 4
    <dcd>   DW_AT_type        : <0xb42>
 <1><dd1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <dd2>   DW_AT_external    : 1
    <dd2>   DW_AT_name        : (indirect string, offset: 0xf7854): uint8ArrayToString
    <dd6>   DW_AT_decl_file   : 7
    <dd6>   DW_AT_decl_line   : 26
    <dd7>   DW_AT_decl_column : 7
    <dd7>   DW_AT_prototyped  : 1
    <dd7>   DW_AT_type        : <0xb36>
    <ddb>   DW_AT_declaration : 1
    <ddb>   DW_AT_sibling     : <0xdea>
 <2><ddf>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <de0>   DW_AT_type        : <0xb5a>
 <2><de4>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <de5>   DW_AT_type        : <0xb21>
 <2><de9>: Abbrev Number: 0
 <1><dea>: Abbrev Number: 19 (DW_TAG_subprogram)
    <deb>   DW_AT_external    : 1
    <deb>   DW_AT_name        : (indirect string, offset: 0xf78e4): UBX_format
    <def>   DW_AT_decl_file   : 1
    <df0>   DW_AT_decl_line   : 9
    <df1>   DW_AT_decl_column : 7
    <df2>   DW_AT_prototyped  : 1
    <df2>   DW_AT_type        : <0xb36>
    <df6>   DW_AT_low_pc      : 0x8000fb4
    <dfa>   DW_AT_high_pc     : 0x154
    <dfe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e00>   DW_AT_call_all_tail_calls: 1
    <e00>   DW_AT_sibling     : <0xef4>
 <2><e04>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <e05>   DW_AT_name        : (indirect string, offset: 0xf7939): fieldToDebug
    <e09>   DW_AT_decl_file   : 1
    <e09>   DW_AT_decl_line   : 9
    <e09>   DW_AT_decl_column : 24
    <e0a>   DW_AT_type        : <0xb34>
    <e0e>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><e11>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <e12>   DW_AT_name        : (indirect string, offset: 0xff8e9): type
    <e16>   DW_AT_decl_file   : 1
    <e16>   DW_AT_decl_line   : 9
    <e16>   DW_AT_decl_column : 47
    <e17>   DW_AT_type        : <0xcaf>
    <e1b>   DW_AT_location    : 2 byte block: 91 4b 	(DW_OP_fbreg: -53)
 <2><e1e>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <e1f>   DW_AT_name        : (indirect string, offset: 0xf79f3): funcSpe
    <e23>   DW_AT_decl_file   : 1
    <e23>   DW_AT_decl_line   : 9
    <e23>   DW_AT_decl_column : 61
    <e24>   DW_AT_type        : <0xf03>
    <e28>   DW_AT_location    : 2 byte block: 91 78 	(DW_OP_fbreg: -8)
 <2><e2b>: Abbrev Number: 20 (DW_TAG_unspecified_parameters)
 <2><e2c>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <e2d>   DW_AT_low_pc      : 0x8000ff8
    <e31>   DW_AT_high_pc     : 0x26
    <e35>   DW_AT_sibling     : <0xe49>
 <3><e39>: Abbrev Number: 1 (DW_TAG_variable)
    <e3a>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <e3e>   DW_AT_decl_file   : 1
    <e3f>   DW_AT_decl_line   : 13
    <e40>   DW_AT_decl_column : 12
    <e41>   DW_AT_type        : <0xb5a>
    <e45>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><e48>: Abbrev Number: 0
 <2><e49>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <e4a>   DW_AT_low_pc      : 0x800101e
    <e4e>   DW_AT_high_pc     : 0x22
    <e52>   DW_AT_sibling     : <0xe66>
 <3><e56>: Abbrev Number: 1 (DW_TAG_variable)
    <e57>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <e5b>   DW_AT_decl_file   : 1
    <e5c>   DW_AT_decl_line   : 19
    <e5d>   DW_AT_decl_column : 7
    <e5e>   DW_AT_type        : <0xf08>
    <e62>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><e65>: Abbrev Number: 0
 <2><e66>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <e67>   DW_AT_low_pc      : 0x8001040
    <e6b>   DW_AT_high_pc     : 0x22
    <e6f>   DW_AT_sibling     : <0xe83>
 <3><e73>: Abbrev Number: 1 (DW_TAG_variable)
    <e74>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <e78>   DW_AT_decl_file   : 1
    <e79>   DW_AT_decl_line   : 26
    <e7a>   DW_AT_decl_column : 7
    <e7b>   DW_AT_type        : <0xf0d>
    <e7f>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><e82>: Abbrev Number: 0
 <2><e83>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <e84>   DW_AT_low_pc      : 0x8001062
    <e88>   DW_AT_high_pc     : 0x22
    <e8c>   DW_AT_sibling     : <0xea0>
 <3><e90>: Abbrev Number: 1 (DW_TAG_variable)
    <e91>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <e95>   DW_AT_decl_file   : 1
    <e96>   DW_AT_decl_line   : 33
    <e97>   DW_AT_decl_column : 7
    <e98>   DW_AT_type        : <0xf12>
    <e9c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><e9f>: Abbrev Number: 0
 <2><ea0>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <ea1>   DW_AT_low_pc      : 0x8001084
    <ea5>   DW_AT_high_pc     : 0x22
    <ea9>   DW_AT_sibling     : <0xebd>
 <3><ead>: Abbrev Number: 1 (DW_TAG_variable)
    <eae>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <eb2>   DW_AT_decl_file   : 1
    <eb3>   DW_AT_decl_line   : 40
    <eb4>   DW_AT_decl_column : 7
    <eb5>   DW_AT_type        : <0xf17>
    <eb9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><ebc>: Abbrev Number: 0
 <2><ebd>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <ebe>   DW_AT_low_pc      : 0x80010a6
    <ec2>   DW_AT_high_pc     : 0x22
    <ec6>   DW_AT_sibling     : <0xeda>
 <3><eca>: Abbrev Number: 1 (DW_TAG_variable)
    <ecb>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <ecf>   DW_AT_decl_file   : 1
    <ed0>   DW_AT_decl_line   : 47
    <ed1>   DW_AT_decl_column : 7
    <ed2>   DW_AT_type        : <0xf1c>
    <ed6>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><ed9>: Abbrev Number: 0
 <2><eda>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <edb>   DW_AT_low_pc      : 0x80010c8
    <edf>   DW_AT_high_pc     : 0x22
 <3><ee3>: Abbrev Number: 1 (DW_TAG_variable)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xf788d): fieldCasted
    <ee8>   DW_AT_decl_file   : 1
    <ee9>   DW_AT_decl_line   : 54
    <eea>   DW_AT_decl_column : 7
    <eeb>   DW_AT_type        : <0xf21>
    <eef>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><ef2>: Abbrev Number: 0
 <2><ef3>: Abbrev Number: 0
 <1><ef4>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <ef5>   DW_AT_prototyped  : 1
    <ef5>   DW_AT_type        : <0xb36>
    <ef9>   DW_AT_sibling     : <0xf03>
 <2><efd>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <efe>   DW_AT_type        : <0xb34>
 <2><f02>: Abbrev Number: 0
 <1><f03>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f04>   DW_AT_byte_size   : 4
    <f04>   DW_AT_type        : <0xef4>
 <1><f08>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f09>   DW_AT_byte_size   : 4
    <f09>   DW_AT_type        : <0xcde>
 <1><f0d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f0e>   DW_AT_byte_size   : 4
    <f0e>   DW_AT_type        : <0xd26>
 <1><f12>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f13>   DW_AT_byte_size   : 4
    <f13>   DW_AT_type        : <0xd7e>
 <1><f17>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f18>   DW_AT_byte_size   : 4
    <f18>   DW_AT_type        : <0xd0a>
 <1><f1c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f1d>   DW_AT_byte_size   : 4
    <f1d>   DW_AT_type        : <0xd52>
 <1><f21>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f22>   DW_AT_byte_size   : 4
    <f22>   DW_AT_type        : <0xdaa>
 <1><f26>: Abbrev Number: 0
  Compilation Unit @ offset 0xf27:
   Length:        0x3ee (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x38f
   Pointer Size:  4
 <0><f33>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <f34>   DW_AT_producer    : (indirect string, offset: 0x40479): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f38>   DW_AT_language    : 29	(C11)
    <f39>   DW_AT_name        : (indirect string, offset: 0xf7b90): ../Core/Src/GNSS/debug_getter.c
    <f3d>   DW_AT_comp_dir    : (indirect string, offset: 0x4bed7): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <f41>   DW_AT_ranges      : 0x4c
    <f45>   DW_AT_low_pc      : 0
    <f49>   DW_AT_stmt_list   : 0x19e1
    <f4d>   DW_AT_macros      : 0x27526
 <1><f51>: Abbrev Number: 8 (DW_TAG_typedef)
    <f52>   DW_AT_name        : (indirect string, offset: 0xf7899): __int8_t
    <f56>   DW_AT_decl_file   : 2
    <f57>   DW_AT_decl_line   : 41
    <f58>   DW_AT_decl_column : 23
    <f59>   DW_AT_type        : <0xf5d>
 <1><f5d>: Abbrev Number: 1 (DW_TAG_base_type)
    <f5e>   DW_AT_byte_size   : 1
    <f5f>   DW_AT_encoding    : 6	(signed char)
    <f60>   DW_AT_name        : (indirect string, offset: 0x7be97): signed char
 <1><f64>: Abbrev Number: 8 (DW_TAG_typedef)
    <f65>   DW_AT_name        : (indirect string, offset: 0x473f5): __uint8_t
    <f69>   DW_AT_decl_file   : 2
    <f6a>   DW_AT_decl_line   : 43
    <f6b>   DW_AT_decl_column : 24
    <f6c>   DW_AT_type        : <0xf70>
 <1><f70>: Abbrev Number: 1 (DW_TAG_base_type)
    <f71>   DW_AT_byte_size   : 1
    <f72>   DW_AT_encoding    : 8	(unsigned char)
    <f73>   DW_AT_name        : (indirect string, offset: 0xee2e8): unsigned char
 <1><f77>: Abbrev Number: 1 (DW_TAG_base_type)
    <f78>   DW_AT_byte_size   : 2
    <f79>   DW_AT_encoding    : 5	(signed)
    <f7a>   DW_AT_name        : (indirect string, offset: 0xb6ec1): short int
 <1><f7e>: Abbrev Number: 1 (DW_TAG_base_type)
    <f7f>   DW_AT_byte_size   : 2
    <f80>   DW_AT_encoding    : 7	(unsigned)
    <f81>   DW_AT_name        : (indirect string, offset: 0xec6fb): short unsigned int
 <1><f85>: Abbrev Number: 1 (DW_TAG_base_type)
    <f86>   DW_AT_byte_size   : 4
    <f87>   DW_AT_encoding    : 5	(signed)
    <f88>   DW_AT_name        : (indirect string, offset: 0x148e7): long int
 <1><f8c>: Abbrev Number: 1 (DW_TAG_base_type)
    <f8d>   DW_AT_byte_size   : 4
    <f8e>   DW_AT_encoding    : 7	(unsigned)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x5dc02): long unsigned int
 <1><f93>: Abbrev Number: 1 (DW_TAG_base_type)
    <f94>   DW_AT_byte_size   : 8
    <f95>   DW_AT_encoding    : 5	(signed)
    <f96>   DW_AT_name        : (indirect string, offset: 0x70439): long long int
 <1><f9a>: Abbrev Number: 1 (DW_TAG_base_type)
    <f9b>   DW_AT_byte_size   : 8
    <f9c>   DW_AT_encoding    : 7	(unsigned)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x3300c): long long unsigned int
 <1><fa1>: Abbrev Number: 16 (DW_TAG_base_type)
    <fa2>   DW_AT_byte_size   : 4
    <fa3>   DW_AT_encoding    : 5	(signed)
    <fa4>   DW_AT_name        : int
 <1><fa8>: Abbrev Number: 1 (DW_TAG_base_type)
    <fa9>   DW_AT_byte_size   : 4
    <faa>   DW_AT_encoding    : 7	(unsigned)
    <fab>   DW_AT_name        : (indirect string, offset: 0x13de3): unsigned int
 <1><faf>: Abbrev Number: 8 (DW_TAG_typedef)
    <fb0>   DW_AT_name        : (indirect string, offset: 0xa10f): size_t
    <fb4>   DW_AT_decl_file   : 3
    <fb5>   DW_AT_decl_line   : 214
    <fb6>   DW_AT_decl_column : 23
    <fb7>   DW_AT_type        : <0xfa8>
 <1><fbb>: Abbrev Number: 1 (DW_TAG_base_type)
    <fbc>   DW_AT_byte_size   : 8
    <fbd>   DW_AT_encoding    : 4	(float)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x166e4): long double
 <1><fc2>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <fc3>   DW_AT_byte_size   : 4
 <1><fc4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <fc5>   DW_AT_byte_size   : 4
    <fc5>   DW_AT_type        : <0xfc9>
 <1><fc9>: Abbrev Number: 1 (DW_TAG_base_type)
    <fca>   DW_AT_byte_size   : 1
    <fcb>   DW_AT_encoding    : 8	(unsigned char)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x4f28a): char
 <1><fd0>: Abbrev Number: 18 (DW_TAG_const_type)
    <fd1>   DW_AT_type        : <0xfc9>
 <1><fd5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <fd6>   DW_AT_byte_size   : 4
    <fd6>   DW_AT_type        : <0xfd0>
 <1><fda>: Abbrev Number: 8 (DW_TAG_typedef)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xf789b): int8_t
    <fdf>   DW_AT_decl_file   : 4
    <fe0>   DW_AT_decl_line   : 20
    <fe1>   DW_AT_decl_column : 18
    <fe2>   DW_AT_type        : <0xf51>
 <1><fe6>: Abbrev Number: 8 (DW_TAG_typedef)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x473f7): uint8_t
    <feb>   DW_AT_decl_file   : 4
    <fec>   DW_AT_decl_line   : 24
    <fed>   DW_AT_decl_column : 19
    <fee>   DW_AT_type        : <0xf64>
 <1><ff2>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ff3>   DW_AT_byte_size   : 1
    <ff4>   DW_AT_decl_file   : 5
    <ff4>   DW_AT_decl_line   : 27
    <ff5>   DW_AT_decl_column : 9
    <ff5>   DW_AT_sibling     : <0x1005>
 <2><ff9>: Abbrev Number: 12 (DW_TAG_member)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <ffe>   DW_AT_decl_file   : 5
    <ffe>   DW_AT_decl_line   : 28
    <fff>   DW_AT_decl_column : 10
    <1000>   DW_AT_type        : <0x1005>
    <1004>   DW_AT_data_member_location: 0
 <2><1004>: Abbrev Number: 0
 <1><1005>: Abbrev Number: 2 (DW_TAG_array_type)
    <1006>   DW_AT_type        : <0xfe6>
    <100a>   DW_AT_sibling     : <0x1015>
 <2><100e>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <100f>   DW_AT_type        : <0xfa8>
    <1013>   DW_AT_upper_bound : 0
 <2><1014>: Abbrev Number: 0
 <1><1015>: Abbrev Number: 13 (DW_TAG_typedef)
    <1016>   DW_AT_name        : U1
    <1019>   DW_AT_decl_file   : 5
    <1019>   DW_AT_decl_line   : 29
    <101a>   DW_AT_decl_column : 2
    <101a>   DW_AT_type        : <0xff2>
 <1><101e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <101f>   DW_AT_byte_size   : 2
    <1020>   DW_AT_decl_file   : 5
    <1020>   DW_AT_decl_line   : 54
    <1021>   DW_AT_decl_column : 9
    <1021>   DW_AT_sibling     : <0x1031>
 <2><1025>: Abbrev Number: 12 (DW_TAG_member)
    <1026>   DW_AT_name        : (indirect string, offset: 0xf78a2): bytes
    <102a>   DW_AT_decl_file   : 5
    <102a>   DW_AT_decl_line   : 55
    <102b>   DW_AT_decl_column : 9
    <102c>   DW_AT_type        : <0x1031>
    <1030>   DW_AT_data_member_location: 0
 <2><1030>: Abbrev Number: 0
 <1><1031>: Abbrev Number: 2 (DW_TAG_array_type)
    <1032>   DW_AT_type        : <0xfda>
    <1036>   DW_AT_sibling     : <0x1041>
 <2><103a>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <103b>   DW_AT_type        : <0xfa8>
    <103f>   DW_AT_upper_bound : 1
 <2><1040>: Abbrev Number: 0
 <1><1041>: Abbrev Number: 13 (DW_TAG_typedef)
    <1042>   DW_AT_name        : I2
    <1045>   DW_AT_decl_file   : 5
    <1045>   DW_AT_decl_line   : 56
    <1046>   DW_AT_decl_column : 2
    <1046>   DW_AT_type        : <0x101e>
 <1><104a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <104b>   DW_AT_byte_size   : 4
    <104b>   DW_AT_type        : <0xfe6>
 <1><104f>: Abbrev Number: 2 (DW_TAG_array_type)
    <1050>   DW_AT_type        : <0xfe6>
    <1054>   DW_AT_sibling     : <0x105f>
 <2><1058>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <1059>   DW_AT_type        : <0xfa8>
    <105d>   DW_AT_upper_bound : 131
 <2><105e>: Abbrev Number: 0
 <1><105f>: Abbrev Number: 6 (DW_TAG_variable)
    <1060>   DW_AT_name        : (indirect string, offset: 0xe28a): commandSetGNSS_Config
    <1064>   DW_AT_decl_file   : 6
    <1064>   DW_AT_decl_line   : 30
    <1065>   DW_AT_decl_column : 16
    <1065>   DW_AT_type        : <0x104f>
    <1069>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><106f>: Abbrev Number: 2 (DW_TAG_array_type)
    <1070>   DW_AT_type        : <0xfe6>
    <1074>   DW_AT_sibling     : <0x107f>
 <2><1078>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <1079>   DW_AT_type        : <0xfa8>
    <107d>   DW_AT_upper_bound : 26
 <2><107e>: Abbrev Number: 0
 <1><107f>: Abbrev Number: 6 (DW_TAG_variable)
    <1080>   DW_AT_name        : (indirect string, offset: 0xe4f1a): commandUart1Ouput
    <1084>   DW_AT_decl_file   : 6
    <1084>   DW_AT_decl_line   : 48
    <1085>   DW_AT_decl_column : 16
    <1085>   DW_AT_type        : <0x106f>
    <1089>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><108f>: Abbrev Number: 2 (DW_TAG_array_type)
    <1090>   DW_AT_type        : <0xfe6>
    <1094>   DW_AT_sibling     : <0x109f>
 <2><1098>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <1099>   DW_AT_type        : <0xfa8>
    <109d>   DW_AT_upper_bound : 10
 <2><109e>: Abbrev Number: 0
 <1><109f>: Abbrev Number: 6 (DW_TAG_variable)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x6e8b5): commandUBXTimeUTC
    <10a4>   DW_AT_decl_file   : 6
    <10a4>   DW_AT_decl_line   : 57
    <10a5>   DW_AT_decl_column : 16
    <10a5>   DW_AT_type        : <0x108f>
    <10a9>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><10af>: Abbrev Number: 2 (DW_TAG_array_type)
    <10b0>   DW_AT_type        : <0xfe6>
    <10b4>   DW_AT_sibling     : <0x10bf>
 <2><10b8>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <10b9>   DW_AT_type        : <0xfa8>
    <10bd>   DW_AT_upper_bound : 7
 <2><10be>: Abbrev Number: 0
 <1><10bf>: Abbrev Number: 6 (DW_TAG_variable)
    <10c0>   DW_AT_name        : (indirect string, offset: 0xa5039): pollUBXTimeUTC
    <10c4>   DW_AT_decl_file   : 6
    <10c4>   DW_AT_decl_line   : 60
    <10c5>   DW_AT_decl_column : 16
    <10c5>   DW_AT_type        : <0x10af>
    <10c9>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
