Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xb1e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x405a6): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x85b5e): ../Core/Src/GNSS/GNSSCom.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4c04b): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x7beb0): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x47569): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xee119): unsigned char
 <1><44>: Abbrev Number: 6 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb6d45): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xc90d2): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xec52c): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x149e6): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x9db35): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5dd9b): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x70513): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x33150): long long unsigned int
 <1><86>: Abbrev Number: 30 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x13ee2): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x4756b): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 31 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xb5024): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x113a5): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 16
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 404
    <cb>   DW_AT_decl_column : 9
    <cb>   DW_AT_sibling     : <0x106>
 <2><cf>: Abbrev Number: 7 (DW_TAG_member)
    <d0>   DW_AT_name        : CCR
    <d4>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 406
    <d6>   DW_AT_decl_column : 17
    <d6>   DW_AT_type        : <0xc2>
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 3 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0xa1b85): CNDTR
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 407
    <e3>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xc2>
    <e8>   DW_AT_data_member_location: 4
 <2><e9>: Abbrev Number: 3 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0xee2fb): CPAR
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 408
    <f1>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xc2>
    <f6>   DW_AT_data_member_location: 8
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x884f1): CMAR
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 409
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 12
 <2><105>: Abbrev Number: 0
 <1><106>: Abbrev Number: 15 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xe85e3): DMA_Channel_TypeDef
    <10b>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 410
    <10e>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xc7>
 <1><112>: Abbrev Number: 18 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 8
    <114>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 412
    <116>   DW_AT_decl_column : 9
    <116>   DW_AT_sibling     : <0x135>
 <2><11a>: Abbrev Number: 7 (DW_TAG_member)
    <11b>   DW_AT_name        : ISR
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 414
    <121>   DW_AT_decl_column : 17
    <121>   DW_AT_type        : <0xc2>
    <125>   DW_AT_data_member_location: 0
 <2><126>: Abbrev Number: 3 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0xac9b9): IFCR
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 415
    <12e>   DW_AT_decl_column : 17
    <12f>   DW_AT_type        : <0xc2>
    <133>   DW_AT_data_member_location: 4
 <2><134>: Abbrev Number: 0
 <1><135>: Abbrev Number: 15 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x59658): DMA_TypeDef
    <13a>   DW_AT_decl_file   : 4
    <13b>   DW_AT_decl_line   : 416
    <13d>   DW_AT_decl_column : 3
    <13d>   DW_AT_type        : <0x112>
 <1><141>: Abbrev Number: 18 (DW_TAG_structure_type)
    <142>   DW_AT_byte_size   : 44
    <143>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 950
    <145>   DW_AT_decl_column : 9
    <145>   DW_AT_sibling     : <0x20a>
 <2><149>: Abbrev Number: 7 (DW_TAG_member)
    <14a>   DW_AT_name        : CR1
    <14e>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 952
    <150>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xc2>
    <154>   DW_AT_data_member_location: 0
 <2><155>: Abbrev Number: 7 (DW_TAG_member)
    <156>   DW_AT_name        : CR2
    <15a>   DW_AT_decl_file   : 4
    <15a>   DW_AT_decl_line   : 953
    <15c>   DW_AT_decl_column : 17
    <15c>   DW_AT_type        : <0xc2>
    <160>   DW_AT_data_member_location: 4
 <2><161>: Abbrev Number: 7 (DW_TAG_member)
    <162>   DW_AT_name        : CR3
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 954
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 7 (DW_TAG_member)
    <16e>   DW_AT_name        : BRR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 955
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xc2>
    <178>   DW_AT_data_member_location: 12
 <2><179>: Abbrev Number: 3 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x44278): GTPR
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 956
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xb1>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 3 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xe846e): RESERVED2
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 957
    <18f>   DW_AT_decl_column : 13
    <190>   DW_AT_type        : <0xa5>
    <194>   DW_AT_data_member_location: 18
 <2><195>: Abbrev Number: 3 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x912d5): RTOR
    <19a>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 958
    <19d>   DW_AT_decl_column : 17
    <19e>   DW_AT_type        : <0xc2>
    <1a2>   DW_AT_data_member_location: 20
 <2><1a3>: Abbrev Number: 7 (DW_TAG_member)
    <1a4>   DW_AT_name        : RQR
    <1a8>   DW_AT_decl_file   : 4
    <1a8>   DW_AT_decl_line   : 959
    <1aa>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xb1>
    <1ae>   DW_AT_data_member_location: 24
 <2><1af>: Abbrev Number: 3 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xe8478): RESERVED3
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 960
    <1b7>   DW_AT_decl_column : 13
    <1b8>   DW_AT_type        : <0xa5>
    <1bc>   DW_AT_data_member_location: 26
 <2><1bd>: Abbrev Number: 7 (DW_TAG_member)
    <1be>   DW_AT_name        : ISR
    <1c2>   DW_AT_decl_file   : 4
    <1c2>   DW_AT_decl_line   : 961
    <1c4>   DW_AT_decl_column : 17
    <1c4>   DW_AT_type        : <0xc2>
    <1c8>   DW_AT_data_member_location: 28
 <2><1c9>: Abbrev Number: 7 (DW_TAG_member)
    <1ca>   DW_AT_name        : ICR
    <1ce>   DW_AT_decl_file   : 4
    <1ce>   DW_AT_decl_line   : 962
    <1d0>   DW_AT_decl_column : 17
    <1d0>   DW_AT_type        : <0xc2>
    <1d4>   DW_AT_data_member_location: 32
 <2><1d5>: Abbrev Number: 7 (DW_TAG_member)
    <1d6>   DW_AT_name        : RDR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 963
    <1dc>   DW_AT_decl_column : 17
    <1dc>   DW_AT_type        : <0xb1>
    <1e0>   DW_AT_data_member_location: 36
 <2><1e1>: Abbrev Number: 3 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xdea28): RESERVED4
    <1e6>   DW_AT_decl_file   : 4
    <1e7>   DW_AT_decl_line   : 964
    <1e9>   DW_AT_decl_column : 13
    <1ea>   DW_AT_type        : <0xa5>
    <1ee>   DW_AT_data_member_location: 38
 <2><1ef>: Abbrev Number: 7 (DW_TAG_member)
    <1f0>   DW_AT_name        : TDR
    <1f4>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 965
    <1f6>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xb1>
    <1fa>   DW_AT_data_member_location: 40
 <2><1fb>: Abbrev Number: 3 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0xe84a6): RESERVED5
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 966
    <203>   DW_AT_decl_column : 13
    <204>   DW_AT_type        : <0xa5>
    <208>   DW_AT_data_member_location: 42
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0xf46cb): USART_TypeDef
    <20f>   DW_AT_decl_file   : 4
    <210>   DW_AT_decl_line   : 967
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x141>
 <1><216>: Abbrev Number: 2 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xa16a): size_t
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 214
    <21d>   DW_AT_decl_column : 23
    <21e>   DW_AT_type        : <0x8d>
 <1><222>: Abbrev Number: 6 (DW_TAG_base_type)
    <223>   DW_AT_byte_size   : 8
    <224>   DW_AT_encoding    : 4	(float)
    <225>   DW_AT_name        : (indirect string, offset: 0x167e3): long double
 <1><229>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <22a>   DW_AT_encoding    : 7	(unsigned)
    <22a>   DW_AT_byte_size   : 1
    <22a>   DW_AT_type        : <0x3d>
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 50
    <230>   DW_AT_decl_column : 1
    <231>   DW_AT_sibling     : <0x242>
 <2><235>: Abbrev Number: 9 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0xb5a93): HAL_UNLOCKED
    <23a>   DW_AT_const_value : 0
 <2><23b>: Abbrev Number: 9 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0xf65c8): HAL_LOCKED
    <240>   DW_AT_const_value : 1
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 2 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x91252): HAL_LockTypeDef
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 53
    <249>   DW_AT_decl_column : 3
    <24a>   DW_AT_type        : <0x229>
 <1><24e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <24f>   DW_AT_byte_size   : 32
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 46
    <252>   DW_AT_decl_column : 9
    <252>   DW_AT_sibling     : <0x2bf>
 <2><256>: Abbrev Number: 1 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0xdca2d): Request
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 48
    <25d>   DW_AT_decl_column : 12
    <25e>   DW_AT_type        : <0xb6>
    <262>   DW_AT_data_member_location: 0
 <2><263>: Abbrev Number: 1 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x5b038): Direction
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 51
    <26a>   DW_AT_decl_column : 12
    <26b>   DW_AT_type        : <0xb6>
    <26f>   DW_AT_data_member_location: 4
 <2><270>: Abbrev Number: 1 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x107a6): PeriphInc
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 55
    <277>   DW_AT_decl_column : 12
    <278>   DW_AT_type        : <0xb6>
    <27c>   DW_AT_data_member_location: 8
 <2><27d>: Abbrev Number: 1 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x26597): MemInc
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 58
    <284>   DW_AT_decl_column : 12
    <285>   DW_AT_type        : <0xb6>
    <289>   DW_AT_data_member_location: 12
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x7af25): PeriphDataAlignment
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 61
    <291>   DW_AT_decl_column : 12
    <292>   DW_AT_type        : <0xb6>
    <296>   DW_AT_data_member_location: 16
 <2><297>: Abbrev Number: 1 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xde5a8): MemDataAlignment
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 64
    <29e>   DW_AT_decl_column : 12
    <29f>   DW_AT_type        : <0xb6>
    <2a3>   DW_AT_data_member_location: 20
 <2><2a4>: Abbrev Number: 1 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xfbe9b): Mode
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 67
    <2ab>   DW_AT_decl_column : 12
    <2ac>   DW_AT_type        : <0xb6>
    <2b0>   DW_AT_data_member_location: 24
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xfb7b2): Priority
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 72
    <2b8>   DW_AT_decl_column : 12
    <2b9>   DW_AT_type        : <0xb6>
    <2bd>   DW_AT_data_member_location: 28
 <2><2be>: Abbrev Number: 0
 <1><2bf>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x4213e): DMA_InitTypeDef
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 74
    <2c6>   DW_AT_decl_column : 3
    <2c7>   DW_AT_type        : <0x24e>
 <1><2cb>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2cc>   DW_AT_encoding    : 7	(unsigned)
    <2cc>   DW_AT_byte_size   : 1
    <2cc>   DW_AT_type        : <0x3d>
    <2d0>   DW_AT_decl_file   : 7
    <2d1>   DW_AT_decl_line   : 80
    <2d2>   DW_AT_decl_column : 1
    <2d3>   DW_AT_sibling     : <0x2f0>
 <2><2d7>: Abbrev Number: 9 (DW_TAG_enumerator)
    <2d8>   DW_AT_name        : (indirect string, offset: 0xb7215): HAL_DMA_STATE_RESET
    <2dc>   DW_AT_const_value : 0
 <2><2dd>: Abbrev Number: 9 (DW_TAG_enumerator)
    <2de>   DW_AT_name        : (indirect string, offset: 0x43789): HAL_DMA_STATE_READY
    <2e2>   DW_AT_const_value : 1
 <2><2e3>: Abbrev Number: 9 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0xaae82): HAL_DMA_STATE_BUSY
    <2e8>   DW_AT_const_value : 2
 <2><2e9>: Abbrev Number: 9 (DW_TAG_enumerator)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xf2959): HAL_DMA_STATE_TIMEOUT
    <2ee>   DW_AT_const_value : 3
 <2><2ef>: Abbrev Number: 0
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x87cd9): HAL_DMA_StateTypeDef
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 85
    <2f7>   DW_AT_decl_column : 3
    <2f8>   DW_AT_type        : <0x2cb>
 <1><2fc>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <2fd>   DW_AT_type        : <0x2f0>
 <1><301>: Abbrev Number: 20 (DW_TAG_structure_type)
    <302>   DW_AT_name        : (indirect string, offset: 0xd1a1a): __DMA_HandleTypeDef
    <306>   DW_AT_byte_size   : 72
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 112
    <309>   DW_AT_decl_column : 16
    <309>   DW_AT_sibling     : <0x3aa>
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xc8dac): Instance
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 114
    <314>   DW_AT_decl_column : 27
    <315>   DW_AT_type        : <0x3aa>
    <319>   DW_AT_data_member_location: 0
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xfc617): Init
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 116
    <321>   DW_AT_decl_column : 25
    <322>   DW_AT_type        : <0x2bf>
    <326>   DW_AT_data_member_location: 4
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0xaf767): Lock
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 118
    <32e>   DW_AT_decl_column : 25
    <32f>   DW_AT_type        : <0x242>
    <333>   DW_AT_data_member_location: 36
 <2><334>: Abbrev Number: 1 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xfdbf3): State
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 120
    <33b>   DW_AT_decl_column : 30
    <33c>   DW_AT_type        : <0x2fc>
    <340>   DW_AT_data_member_location: 37
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x4d040): Parent
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 122
    <348>   DW_AT_decl_column : 26
    <349>   DW_AT_type        : <0x3af>
    <34d>   DW_AT_data_member_location: 40
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xf5586): XferCpltCallback
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 124
    <355>   DW_AT_decl_column : 11
    <356>   DW_AT_type        : <0x3c1>
    <35a>   DW_AT_data_member_location: 44
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0xbf240): XferHalfCpltCallback
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 126
    <362>   DW_AT_decl_column : 11
    <363>   DW_AT_type        : <0x3c1>
    <367>   DW_AT_data_member_location: 48
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x2301e): XferErrorCallback
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 128
    <36f>   DW_AT_decl_column : 11
    <370>   DW_AT_type        : <0x3c1>
    <374>   DW_AT_data_member_location: 52
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0xe5ff6): XferAbortCallback
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 130
    <37c>   DW_AT_decl_column : 11
    <37d>   DW_AT_type        : <0x3c1>
    <381>   DW_AT_data_member_location: 56
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf0fdc): ErrorCode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 132
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0xc2>
    <38e>   DW_AT_data_member_location: 60
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x6381c): DmaBaseAddress
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 134
    <396>   DW_AT_decl_column : 26
    <397>   DW_AT_type        : <0x3c6>
    <39b>   DW_AT_data_member_location: 64
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x32d2d): ChannelIndex
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 136
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0xb6>
    <3a8>   DW_AT_data_member_location: 68
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3ab>   DW_AT_byte_size   : 4
    <3ab>   DW_AT_type        : <0x106>
 <1><3af>: Abbrev Number: 32 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
 <1><3b1>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <3b2>   DW_AT_prototyped  : 1
    <3b2>   DW_AT_sibling     : <0x3bc>
 <2><3b6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <3b7>   DW_AT_type        : <0x3bc>
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x301>
 <1><3c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c2>   DW_AT_type        : <0x3b1>
 <1><3c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x135>
 <1><3cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xd1a1c): DMA_HandleTypeDef
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 153
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x301>
 <1><3d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_type        : <0x94>
 <1><3dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3dd>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3cb>
 <1><3e1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e2>   DW_AT_byte_size   : 32
    <3e3>   DW_AT_decl_file   : 8
    <3e4>   DW_AT_decl_line   : 46
    <3e5>   DW_AT_decl_column : 9
    <3e5>   DW_AT_sibling     : <0x452>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xe13f7): BaudRate
    <3ee>   DW_AT_decl_file   : 8
    <3ef>   DW_AT_decl_line   : 48
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xb6>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x6c32): WordLength
    <3fb>   DW_AT_decl_file   : 8
    <3fc>   DW_AT_decl_line   : 68
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xb6>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xe176f): StopBits
    <408>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 71
    <40a>   DW_AT_decl_column : 12
    <40b>   DW_AT_type        : <0xb6>
    <40f>   DW_AT_data_member_location: 8
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x461e5): Parity
    <415>   DW_AT_decl_file   : 8
    <416>   DW_AT_decl_line   : 74
    <417>   DW_AT_decl_column : 12
    <418>   DW_AT_type        : <0xb6>
    <41c>   DW_AT_data_member_location: 12
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xfbe9b): Mode
    <422>   DW_AT_decl_file   : 8
    <423>   DW_AT_decl_line   : 81
    <424>   DW_AT_decl_column : 12
    <425>   DW_AT_type        : <0xb6>
    <429>   DW_AT_data_member_location: 16
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x84704): HwFlowCtl
    <42f>   DW_AT_decl_file   : 8
    <430>   DW_AT_decl_line   : 84
    <431>   DW_AT_decl_column : 12
    <432>   DW_AT_type        : <0xb6>
    <436>   DW_AT_data_member_location: 20
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xce99c): OverSampling
    <43c>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 88
    <43e>   DW_AT_decl_column : 12
    <43f>   DW_AT_type        : <0xb6>
    <443>   DW_AT_data_member_location: 24
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x31bf4): OneBitSampling
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 92
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb6>
    <450>   DW_AT_data_member_location: 28
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 2 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x44ea9): UART_InitTypeDef
    <457>   DW_AT_decl_file   : 8
    <458>   DW_AT_decl_line   : 101
    <459>   DW_AT_decl_column : 3
    <45a>   DW_AT_type        : <0x3e1>
 <1><45e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <45f>   DW_AT_byte_size   : 40
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 106
    <462>   DW_AT_decl_column : 9
    <462>   DW_AT_sibling     : <0x4e9>
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x2fa9b): AdvFeatureInit
    <46b>   DW_AT_decl_file   : 8
    <46c>   DW_AT_decl_line   : 108
    <46d>   DW_AT_decl_column : 12
    <46e>   DW_AT_type        : <0xb6>
    <472>   DW_AT_data_member_location: 0
 <2><473>: Abbrev Number: 1 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0xe5823): TxPinLevelInvert
    <478>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 113
    <47a>   DW_AT_decl_column : 12
    <47b>   DW_AT_type        : <0xb6>
    <47f>   DW_AT_data_member_location: 4
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xcedc1): RxPinLevelInvert
    <485>   DW_AT_decl_file   : 8
    <486>   DW_AT_decl_line   : 116
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0xb6>
    <48c>   DW_AT_data_member_location: 8
 <2><48d>: Abbrev Number: 1 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0xa6708): DataInvert
    <492>   DW_AT_decl_file   : 8
    <493>   DW_AT_decl_line   : 119
    <494>   DW_AT_decl_column : 12
    <495>   DW_AT_type        : <0xb6>
    <499>   DW_AT_data_member_location: 12
 <2><49a>: Abbrev Number: 1 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x4dd33): Swap
    <49f>   DW_AT_decl_file   : 8
    <4a0>   DW_AT_decl_line   : 123
    <4a1>   DW_AT_decl_column : 12
    <4a2>   DW_AT_type        : <0xb6>
    <4a6>   DW_AT_data_member_location: 16
 <2><4a7>: Abbrev Number: 1 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xbe98d): OverrunDisable
    <4ac>   DW_AT_decl_file   : 8
    <4ad>   DW_AT_decl_line   : 126
    <4ae>   DW_AT_decl_column : 12
    <4af>   DW_AT_type        : <0xb6>
    <4b3>   DW_AT_data_member_location: 20
 <2><4b4>: Abbrev Number: 1 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x84bd): DMADisableonRxError
    <4b9>   DW_AT_decl_file   : 8
    <4ba>   DW_AT_decl_line   : 129
    <4bb>   DW_AT_decl_column : 12
    <4bc>   DW_AT_type        : <0xb6>
    <4c0>   DW_AT_data_member_location: 24
 <2><4c1>: Abbrev Number: 1 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xf09ba): AutoBaudRateEnable
    <4c6>   DW_AT_decl_file   : 8
    <4c7>   DW_AT_decl_line   : 132
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xb6>
    <4cd>   DW_AT_data_member_location: 28
 <2><4ce>: Abbrev Number: 1 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xd121a): AutoBaudRateMode
    <4d3>   DW_AT_decl_file   : 8
    <4d4>   DW_AT_decl_line   : 135
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xb6>
    <4da>   DW_AT_data_member_location: 32
 <2><4db>: Abbrev Number: 1 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x6ccd6): MSBFirst
    <4e0>   DW_AT_decl_file   : 8
    <4e1>   DW_AT_decl_line   : 139
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xb6>
    <4e7>   DW_AT_data_member_location: 36
 <2><4e8>: Abbrev Number: 0
 <1><4e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ea>   DW_AT_name        : (indirect string, offset: 0xb6fb4): UART_AdvFeatureInitTypeDef
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 141
    <4f0>   DW_AT_decl_column : 3
    <4f1>   DW_AT_type        : <0x45e>
 <1><4f5>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x4ab14): HAL_UART_StateTypeDef
    <4fa>   DW_AT_decl_file   : 8
    <4fb>   DW_AT_decl_line   : 183
    <4fc>   DW_AT_decl_column : 18
    <4fd>   DW_AT_type        : <0xb6>
 <1><501>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <502>   DW_AT_type        : <0x4f5>
 <1><506>: Abbrev Number: 2 (DW_TAG_typedef)
    <507>   DW_AT_name        : (indirect string, offset: 0x6480e): HAL_UART_RxTypeTypeDef
    <50b>   DW_AT_decl_file   : 8
    <50c>   DW_AT_decl_line   : 207
    <50d>   DW_AT_decl_column : 18
    <50e>   DW_AT_type        : <0xb6>
 <1><512>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <513>   DW_AT_type        : <0x506>
 <1><517>: Abbrev Number: 2 (DW_TAG_typedef)
    <518>   DW_AT_name        : (indirect string, offset: 0x1e81f): HAL_UART_RxEventTypeTypeDef
    <51c>   DW_AT_decl_file   : 8
    <51d>   DW_AT_decl_line   : 218
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0xb6>
 <1><523>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <524>   DW_AT_type        : <0x517>
 <1><528>: Abbrev Number: 20 (DW_TAG_structure_type)
    <529>   DW_AT_name        : (indirect string, offset: 0x8eb10): __UART_HandleTypeDef
    <52d>   DW_AT_byte_size   : 136
    <52e>   DW_AT_decl_file   : 8
    <52f>   DW_AT_decl_line   : 223
    <530>   DW_AT_decl_column : 16
    <530>   DW_AT_sibling     : <0x642>
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0xc8dac): Instance
    <539>   DW_AT_decl_file   : 8
    <53a>   DW_AT_decl_line   : 225
    <53b>   DW_AT_decl_column : 29
    <53c>   DW_AT_type        : <0x642>
    <540>   DW_AT_data_member_location: 0
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0xfc617): Init
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 227
    <548>   DW_AT_decl_column : 28
    <549>   DW_AT_type        : <0x452>
    <54d>   DW_AT_data_member_location: 4
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0xd7e52): AdvancedInit
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 229
    <555>   DW_AT_decl_column : 30
    <556>   DW_AT_type        : <0x4e9>
    <55a>   DW_AT_data_member_location: 36
 <2><55b>: Abbrev Number: 1 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x75f5c): pTxBuffPtr
    <560>   DW_AT_decl_file   : 8
    <561>   DW_AT_decl_line   : 231
    <562>   DW_AT_decl_column : 29
    <563>   DW_AT_type        : <0x647>
    <567>   DW_AT_data_member_location: 76
 <2><568>: Abbrev Number: 1 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x6796c): TxXferSize
    <56d>   DW_AT_decl_file   : 8
    <56e>   DW_AT_decl_line   : 233
    <56f>   DW_AT_decl_column : 28
    <570>   DW_AT_type        : <0xa5>
    <574>   DW_AT_data_member_location: 80
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xfcb58): TxXferCount
    <57a>   DW_AT_decl_file   : 8
    <57b>   DW_AT_decl_line   : 235
    <57c>   DW_AT_decl_column : 28
    <57d>   DW_AT_type        : <0xb1>
    <581>   DW_AT_data_member_location: 82
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xe4de4): pRxBuffPtr
    <587>   DW_AT_decl_file   : 8
    <588>   DW_AT_decl_line   : 237
    <589>   DW_AT_decl_column : 29
    <58a>   DW_AT_type        : <0x3d7>
    <58e>   DW_AT_data_member_location: 84
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x7afa4): RxXferSize
    <594>   DW_AT_decl_file   : 8
    <595>   DW_AT_decl_line   : 239
    <596>   DW_AT_decl_column : 28
    <597>   DW_AT_type        : <0xa5>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 1 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xfc624): RxXferCount
    <5a1>   DW_AT_decl_file   : 8
    <5a2>   DW_AT_decl_line   : 241
    <5a3>   DW_AT_decl_column : 28
    <5a4>   DW_AT_type        : <0xb1>
    <5a8>   DW_AT_data_member_location: 90
 <2><5a9>: Abbrev Number: 1 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xfe109): Mask
    <5ae>   DW_AT_decl_file   : 8
    <5af>   DW_AT_decl_line   : 243
    <5b0>   DW_AT_decl_column : 28
    <5b1>   DW_AT_type        : <0xa5>
    <5b5>   DW_AT_data_member_location: 92
 <2><5b6>: Abbrev Number: 1 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xcd908): ReceptionType
    <5bb>   DW_AT_decl_file   : 8
    <5bc>   DW_AT_decl_line   : 254
    <5bd>   DW_AT_decl_column : 31
    <5be>   DW_AT_type        : <0x512>
    <5c2>   DW_AT_data_member_location: 96
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x1227a): RxEventType
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 256
    <5cb>   DW_AT_decl_column : 36
    <5cc>   DW_AT_type        : <0x523>
    <5d0>   DW_AT_data_member_location: 100
 <2><5d1>: Abbrev Number: 3 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xd44b2): RxISR
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 258
    <5d9>   DW_AT_decl_column : 10
    <5da>   DW_AT_type        : <0x65c>
    <5de>   DW_AT_data_member_location: 104
 <2><5df>: Abbrev Number: 3 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x7be9c): TxISR
    <5e4>   DW_AT_decl_file   : 8
    <5e5>   DW_AT_decl_line   : 260
    <5e7>   DW_AT_decl_column : 10
    <5e8>   DW_AT_type        : <0x65c>
    <5ec>   DW_AT_data_member_location: 108
 <2><5ed>: Abbrev Number: 3 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xca0e3): hdmatx
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 262
    <5f5>   DW_AT_decl_column : 29
    <5f6>   DW_AT_type        : <0x3dc>
    <5fa>   DW_AT_data_member_location: 112
 <2><5fb>: Abbrev Number: 3 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xef315): hdmarx
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 264
    <603>   DW_AT_decl_column : 29
    <604>   DW_AT_type        : <0x3dc>
    <608>   DW_AT_data_member_location: 116
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xaf767): Lock
    <60e>   DW_AT_decl_file   : 8
    <60f>   DW_AT_decl_line   : 266
    <611>   DW_AT_decl_column : 29
    <612>   DW_AT_type        : <0x242>
    <616>   DW_AT_data_member_location: 120
 <2><617>: Abbrev Number: 3 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x63bb3): gState
    <61c>   DW_AT_decl_file   : 8
    <61d>   DW_AT_decl_line   : 268
    <61f>   DW_AT_decl_column : 33
    <620>   DW_AT_type        : <0x501>
    <624>   DW_AT_data_member_location: 124
 <2><625>: Abbrev Number: 3 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xdda53): RxState
    <62a>   DW_AT_decl_file   : 8
    <62b>   DW_AT_decl_line   : 272
    <62d>   DW_AT_decl_column : 33
    <62e>   DW_AT_type        : <0x501>
    <632>   DW_AT_data_member_location: 128
 <2><633>: Abbrev Number: 3 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xf0fdc): ErrorCode
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 275
    <63b>   DW_AT_decl_column : 33
    <63c>   DW_AT_type        : <0xc2>
    <640>   DW_AT_data_member_location: 132
 <2><641>: Abbrev Number: 0
 <1><642>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <643>   DW_AT_byte_size   : 4
    <643>   DW_AT_type        : <0x20a>
 <1><647>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <648>   DW_AT_type        : <0xa0>
 <1><64c>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <64d>   DW_AT_prototyped  : 1
    <64d>   DW_AT_sibling     : <0x657>
 <2><651>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <652>   DW_AT_type        : <0x657>
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <658>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x528>
 <1><65c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <65d>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x64c>
 <1><661>: Abbrev Number: 15 (DW_TAG_typedef)
    <662>   DW_AT_name        : (indirect string, offset: 0x8eb12): UART_HandleTypeDef
    <666>   DW_AT_decl_file   : 8
    <667>   DW_AT_decl_line   : 297
    <669>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x528>
 <1><66d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <66e>   DW_AT_byte_size   : 4
    <66e>   DW_AT_type        : <0x672>
 <1><672>: Abbrev Number: 6 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 1
    <674>   DW_AT_encoding    : 8	(unsigned char)
    <675>   DW_AT_name        : (indirect string, offset: 0x4f3fe): char
 <1><679>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <67a>   DW_AT_byte_size   : 4
    <67a>   DW_AT_type        : <0x67e>
 <1><67e>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><67f>: Abbrev Number: 12 (DW_TAG_array_type)
    <680>   DW_AT_type        : <0x94>
    <684>   DW_AT_sibling     : <0x68f>
 <2><688>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <689>   DW_AT_type        : <0x8d>
    <68d>   DW_AT_upper_bound : 131
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 5 (DW_TAG_variable)
    <690>   DW_AT_name        : (indirect string, offset: 0xe2c6): commandSetGNSS_Config
    <694>   DW_AT_decl_file   : 9
    <695>   DW_AT_decl_line   : 30
    <696>   DW_AT_decl_column : 16
    <697>   DW_AT_type        : <0x67f>
    <69b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6a1>: Abbrev Number: 12 (DW_TAG_array_type)
    <6a2>   DW_AT_type        : <0x94>
    <6a6>   DW_AT_sibling     : <0x6b1>
 <2><6aa>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6ab>   DW_AT_type        : <0x8d>
    <6af>   DW_AT_upper_bound : 26
 <2><6b0>: Abbrev Number: 0
 <1><6b1>: Abbrev Number: 5 (DW_TAG_variable)
    <6b2>   DW_AT_name        : (indirect string, offset: 0xe4cf0): commandUart1Ouput
    <6b6>   DW_AT_decl_file   : 9
    <6b7>   DW_AT_decl_line   : 48
    <6b8>   DW_AT_decl_column : 16
    <6b9>   DW_AT_type        : <0x6a1>
    <6bd>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6c3>: Abbrev Number: 12 (DW_TAG_array_type)
    <6c4>   DW_AT_type        : <0x94>
    <6c8>   DW_AT_sibling     : <0x6d3>
 <2><6cc>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6cd>   DW_AT_type        : <0x8d>
    <6d1>   DW_AT_upper_bound : 10
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 5 (DW_TAG_variable)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x6e9a1): commandUBXTimeUTC
    <6d8>   DW_AT_decl_file   : 9
    <6d9>   DW_AT_decl_line   : 57
    <6da>   DW_AT_decl_column : 16
    <6db>   DW_AT_type        : <0x6c3>
    <6df>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6e5>: Abbrev Number: 12 (DW_TAG_array_type)
    <6e6>   DW_AT_type        : <0x94>
    <6ea>   DW_AT_sibling     : <0x6f5>
 <2><6ee>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6ef>   DW_AT_type        : <0x8d>
    <6f3>   DW_AT_upper_bound : 7
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 5 (DW_TAG_variable)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xa4fc3): pollUBXTimeUTC
    <6fa>   DW_AT_decl_file   : 9
    <6fb>   DW_AT_decl_line   : 60
    <6fc>   DW_AT_decl_column : 16
    <6fd>   DW_AT_type        : <0x6e5>
    <701>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><707>: Abbrev Number: 12 (DW_TAG_array_type)
    <708>   DW_AT_type        : <0x94>
    <70c>   DW_AT_sibling     : <0x717>
 <2><710>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <711>   DW_AT_type        : <0x8d>
    <715>   DW_AT_upper_bound : 92
 <2><716>: Abbrev Number: 0
 <1><717>: Abbrev Number: 5 (DW_TAG_variable)
    <718>   DW_AT_name        : (indirect string, offset: 0xbb982): commandSetTP1_atNVTRate
    <71c>   DW_AT_decl_file   : 9
    <71d>   DW_AT_decl_line   : 79
    <71e>   DW_AT_decl_column : 16
    <71f>   DW_AT_type        : <0x707>
    <723>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><729>: Abbrev Number: 12 (DW_TAG_array_type)
    <72a>   DW_AT_type        : <0x94>
    <72e>   DW_AT_sibling     : <0x739>
 <2><732>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <733>   DW_AT_type        : <0x8d>
    <737>   DW_AT_upper_bound : 100
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 5 (DW_TAG_variable)
    <73a>   DW_AT_name        : (indirect string, offset: 0xcf874): commandSetTP2
    <73e>   DW_AT_decl_file   : 9
    <73f>   DW_AT_decl_line   : 105
    <740>   DW_AT_decl_column : 16
    <741>   DW_AT_type        : <0x729>
    <745>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><74b>: Abbrev Number: 12 (DW_TAG_array_type)
    <74c>   DW_AT_type        : <0x94>
    <750>   DW_AT_sibling     : <0x75b>
 <2><754>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <755>   DW_AT_type        : <0x8d>
    <759>   DW_AT_upper_bound : 28
 <2><75a>: Abbrev Number: 0
 <1><75b>: Abbrev Number: 5 (DW_TAG_variable)
    <75c>   DW_AT_name        : (indirect string, offset: 0xdfa5a): commandMeasureRate
    <760>   DW_AT_decl_file   : 9
    <761>   DW_AT_decl_line   : 122
    <762>   DW_AT_decl_column : 16
    <763>   DW_AT_type        : <0x74b>
    <767>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><76d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <76e>   DW_AT_encoding    : 7	(unsigned)
    <76e>   DW_AT_byte_size   : 1
    <76e>   DW_AT_type        : <0x3d>
    <772>   DW_AT_decl_file   : 10
    <773>   DW_AT_decl_line   : 27
    <774>   DW_AT_decl_column : 14
    <775>   DW_AT_sibling     : <0x78c>
 <2><779>: Abbrev Number: 9 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0xc7680): INIT
    <77e>   DW_AT_const_value : 0
 <2><77f>: Abbrev Number: 9 (DW_TAG_enumerator)
    <780>   DW_AT_name        : (indirect string, offset: 0x8fb8f): NMEA
    <784>   DW_AT_const_value : 1
 <2><785>: Abbrev Number: 19 (DW_TAG_enumerator)
    <786>   DW_AT_name        : UBX
    <78a>   DW_AT_const_value : 2
 <2><78b>: Abbrev Number: 0
 <1><78c>: Abbrev Number: 2 (DW_TAG_typedef)
    <78d>   DW_AT_name        : (indirect string, offset: 0xd75d0): OutputProtocol
    <791>   DW_AT_decl_file   : 10
    <792>   DW_AT_decl_line   : 31
    <793>   DW_AT_decl_column : 3
    <794>   DW_AT_type        : <0x76d>
 <1><798>: Abbrev Number: 10 (DW_TAG_structure_type)
    <799>   DW_AT_byte_size   : 8
    <79a>   DW_AT_decl_file   : 10
    <79b>   DW_AT_decl_line   : 32
    <79c>   DW_AT_decl_column : 9
    <79c>   DW_AT_sibling     : <0x7bb>
 <2><7a0>: Abbrev Number: 1 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x25540): buffer
    <7a5>   DW_AT_decl_file   : 10
    <7a6>   DW_AT_decl_line   : 33
    <7a7>   DW_AT_decl_column : 11
    <7a8>   DW_AT_type        : <0x3d7>
    <7ac>   DW_AT_data_member_location: 0
 <2><7ad>: Abbrev Number: 1 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0xf9b8a): size
    <7b2>   DW_AT_decl_file   : 10
    <7b3>   DW_AT_decl_line   : 34
    <7b4>   DW_AT_decl_column : 9
    <7b5>   DW_AT_type        : <0x216>
    <7b9>   DW_AT_data_member_location: 4
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x80bfa): DynamicBuffer
    <7c0>   DW_AT_decl_file   : 10
    <7c1>   DW_AT_decl_line   : 35
    <7c2>   DW_AT_decl_column : 3
    <7c3>   DW_AT_type        : <0x798>
 <1><7c7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7c8>   DW_AT_byte_size   : 8
    <7c9>   DW_AT_decl_file   : 10
    <7ca>   DW_AT_decl_line   : 37
    <7cb>   DW_AT_decl_column : 9
    <7cb>   DW_AT_sibling     : <0x803>
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xd6e11): CLASS
    <7d4>   DW_AT_decl_file   : 10
    <7d5>   DW_AT_decl_line   : 38
    <7d6>   DW_AT_decl_column : 10
    <7d7>   DW_AT_type        : <0x94>
    <7db>   DW_AT_data_member_location: 0
 <2><7dc>: Abbrev Number: 22 (DW_TAG_member)
    <7dd>   DW_AT_name        : ID
    <7e0>   DW_AT_decl_file   : 10
    <7e1>   DW_AT_decl_line   : 39
    <7e2>   DW_AT_decl_column : 10
    <7e3>   DW_AT_type        : <0x94>
    <7e7>   DW_AT_data_member_location: 1
 <2><7e8>: Abbrev Number: 1 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x14b1): len_payload
    <7ed>   DW_AT_decl_file   : 10
    <7ee>   DW_AT_decl_line   : 40
    <7ef>   DW_AT_decl_column : 11
    <7f0>   DW_AT_type        : <0xa5>
    <7f4>   DW_AT_data_member_location: 2
 <2><7f5>: Abbrev Number: 1 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0xf2198): brute
    <7fa>   DW_AT_decl_file   : 10
    <7fb>   DW_AT_decl_line   : 41
    <7fc>   DW_AT_decl_column : 17
    <7fd>   DW_AT_type        : <0x803>
    <801>   DW_AT_data_member_location: 4
 <2><802>: Abbrev Number: 0
 <1><803>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <804>   DW_AT_byte_size   : 4
    <804>   DW_AT_type        : <0x7bb>
 <1><808>: Abbrev Number: 2 (DW_TAG_typedef)
    <809>   DW_AT_name        : (indirect string, offset: 0x66ff0): UBXMessage_parsed
    <80d>   DW_AT_decl_file   : 10
    <80e>   DW_AT_decl_line   : 42
    <80f>   DW_AT_decl_column : 2
    <810>   DW_AT_type        : <0x7c7>
 <1><814>: Abbrev Number: 10 (DW_TAG_structure_type)
    <815>   DW_AT_byte_size   : 4
    <816>   DW_AT_decl_file   : 10
    <817>   DW_AT_decl_line   : 44
    <818>   DW_AT_decl_column : 9
    <818>   DW_AT_sibling     : <0x82a>
 <2><81c>: Abbrev Number: 1 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x75875): NMEA_Brute
    <821>   DW_AT_decl_file   : 10
    <822>   DW_AT_decl_line   : 45
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0x66d>
    <828>   DW_AT_data_member_location: 0
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 2 (DW_TAG_typedef)
    <82b>   DW_AT_name        : (indirect string, offset: 0x75554): NMEAMessage_parsed
    <82f>   DW_AT_decl_file   : 10
    <830>   DW_AT_decl_line   : 46
    <831>   DW_AT_decl_column : 2
    <832>   DW_AT_type        : <0x814>
 <1><836>: Abbrev Number: 34 (DW_TAG_union_type)
    <837>   DW_AT_byte_size   : 4
    <838>   DW_AT_decl_file   : 10
    <839>   DW_AT_decl_line   : 48
    <83a>   DW_AT_decl_column : 9
    <83b>   DW_AT_sibling     : <0x856>
 <2><83f>: Abbrev Number: 23 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x4f187): NMEAMessage
    <844>   DW_AT_decl_file   : 10
    <844>   DW_AT_decl_line   : 49
    <845>   DW_AT_decl_column : 22
    <846>   DW_AT_type        : <0x856>
 <2><84a>: Abbrev Number: 23 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x17961): UBXMessage
    <84f>   DW_AT_decl_file   : 10
    <84f>   DW_AT_decl_line   : 50
    <850>   DW_AT_decl_column : 21
    <851>   DW_AT_type        : <0x85b>
 <2><855>: Abbrev Number: 0
 <1><856>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 4
    <857>   DW_AT_type        : <0x82a>
 <1><85b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <85c>   DW_AT_byte_size   : 4
    <85c>   DW_AT_type        : <0x808>
 <1><860>: Abbrev Number: 2 (DW_TAG_typedef)
    <861>   DW_AT_name        : (indirect string, offset: 0x7eb0b): MessageStruct
    <865>   DW_AT_decl_file   : 10
    <866>   DW_AT_decl_line   : 51
    <867>   DW_AT_decl_column : 2
    <868>   DW_AT_type        : <0x836>
 <1><86c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <86d>   DW_AT_byte_size   : 8
    <86e>   DW_AT_decl_file   : 10
    <86f>   DW_AT_decl_line   : 53
    <870>   DW_AT_decl_column : 9
    <870>   DW_AT_sibling     : <0x88f>
 <2><874>: Abbrev Number: 1 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x21c8b): typeMessage
    <879>   DW_AT_decl_file   : 10
    <87a>   DW_AT_decl_line   : 54
    <87b>   DW_AT_decl_column : 17
    <87c>   DW_AT_type        : <0x78c>
    <880>   DW_AT_data_member_location: 0
 <2><881>: Abbrev Number: 1 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0x4f18b): Message
    <886>   DW_AT_decl_file   : 10
    <887>   DW_AT_decl_line   : 55
    <888>   DW_AT_decl_column : 16
    <889>   DW_AT_type        : <0x860>
    <88d>   DW_AT_data_member_location: 4
 <2><88e>: Abbrev Number: 0
 <1><88f>: Abbrev Number: 2 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0x65c9e): GenericMessage
    <894>   DW_AT_decl_file   : 10
    <895>   DW_AT_decl_line   : 56
    <896>   DW_AT_decl_column : 2
    <897>   DW_AT_type        : <0x86c>
 <1><89b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <89c>   DW_AT_encoding    : 7	(unsigned)
    <89c>   DW_AT_byte_size   : 1
    <89c>   DW_AT_type        : <0x3d>
    <8a0>   DW_AT_decl_file   : 11
    <8a1>   DW_AT_decl_line   : 25
    <8a2>   DW_AT_decl_column : 14
    <8a3>   DW_AT_sibling     : <0x8ba>
 <2><8a7>: Abbrev Number: 19 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : RAW
    <8ac>   DW_AT_const_value : 0
 <2><8ad>: Abbrev Number: 19 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : HEX
    <8b2>   DW_AT_const_value : 1
 <2><8b3>: Abbrev Number: 9 (DW_TAG_enumerator)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xbdcb5): ASCII
    <8b8>   DW_AT_const_value : 2
 <2><8b9>: Abbrev Number: 0
 <1><8ba>: Abbrev Number: 2 (DW_TAG_typedef)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xe1e1f): OutputType
    <8bf>   DW_AT_decl_file   : 11
    <8c0>   DW_AT_decl_line   : 29
    <8c1>   DW_AT_decl_column : 3
    <8c2>   DW_AT_type        : <0x89b>
 <1><8c6>: Abbrev Number: 24 (DW_TAG_variable)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xff08b): type
    <8cb>   DW_AT_decl_file   : 11
    <8cb>   DW_AT_decl_line   : 30
    <8cc>   DW_AT_decl_column : 19
    <8cd>   DW_AT_type        : <0x8ba>
    <8d1>   DW_AT_external    : 1
    <8d1>   DW_AT_declaration : 1
 <1><8d1>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8d2>   DW_AT_byte_size   : 12
    <8d3>   DW_AT_decl_file   : 11
    <8d4>   DW_AT_decl_line   : 32
    <8d5>   DW_AT_decl_column : 9
    <8d5>   DW_AT_sibling     : <0x900>
 <2><8d9>: Abbrev Number: 1 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0xae698): huart
    <8de>   DW_AT_decl_file   : 11
    <8df>   DW_AT_decl_line   : 33
    <8e0>   DW_AT_decl_column : 22
    <8e1>   DW_AT_type        : <0x900>
    <8e5>   DW_AT_data_member_location: 0
 <2><8e6>: Abbrev Number: 1 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x8b4cc): huartDebug
    <8eb>   DW_AT_decl_file   : 11
    <8ec>   DW_AT_decl_line   : 34
    <8ed>   DW_AT_decl_column : 22
    <8ee>   DW_AT_type        : <0x900>
    <8f2>   DW_AT_data_member_location: 4
 <2><8f3>: Abbrev Number: 22 (DW_TAG_member)
    <8f4>   DW_AT_name        : Rx
    <8f7>   DW_AT_decl_file   : 11
    <8f8>   DW_AT_decl_line   : 35
    <8f9>   DW_AT_decl_column : 17
    <8fa>   DW_AT_type        : <0x803>
    <8fe>   DW_AT_data_member_location: 8
 <2><8ff>: Abbrev Number: 0
 <1><900>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <901>   DW_AT_byte_size   : 4
    <901>   DW_AT_type        : <0x661>
 <1><905>: Abbrev Number: 2 (DW_TAG_typedef)
    <906>   DW_AT_name        : (indirect string, offset: 0x3e649): GNSSCom_HandleTypeDef
    <90a>   DW_AT_decl_file   : 11
    <90b>   DW_AT_decl_line   : 36
    <90c>   DW_AT_decl_column : 3
    <90d>   DW_AT_type        : <0x8d1>
 <1><911>: Abbrev Number: 24 (DW_TAG_variable)
    <912>   DW_AT_name        : (indirect string, offset: 0x41521): hGNSSCom
    <916>   DW_AT_decl_file   : 11
    <916>   DW_AT_decl_line   : 37
    <917>   DW_AT_decl_column : 30
    <918>   DW_AT_type        : <0x905>
    <91c>   DW_AT_external    : 1
    <91c>   DW_AT_declaration : 1
 <1><91c>: Abbrev Number: 25 (DW_TAG_variable)
    <91d>   DW_AT_specification: <0x911>
    <921>   DW_AT_decl_file   : 1
    <921>   DW_AT_decl_line   : 14
    <922>   DW_AT_decl_column : 23
    <923>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><929>: Abbrev Number: 25 (DW_TAG_variable)
    <92a>   DW_AT_specification: <0x8c6>
    <92e>   DW_AT_decl_file   : 1
    <92e>   DW_AT_decl_line   : 15
    <92f>   DW_AT_decl_column : 12
    <930>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><936>: Abbrev Number: 35 (DW_TAG_variable)
    <937>   DW_AT_name        : (indirect string, offset: 0x3b47c): protocol
    <93b>   DW_AT_decl_file   : 1
    <93c>   DW_AT_decl_line   : 16
    <93d>   DW_AT_decl_column : 16
    <93e>   DW_AT_type        : <0x78c>
    <942>   DW_AT_external    : 1
    <942>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><948>: Abbrev Number: 17 (DW_TAG_subprogram)
    <949>   DW_AT_external    : 1
    <949>   DW_AT_name        : (indirect string, offset: 0xbf99d): memcpy
    <94d>   DW_AT_decl_file   : 12
    <94e>   DW_AT_decl_line   : 31
    <94f>   DW_AT_decl_column : 9
    <950>   DW_AT_prototyped  : 1
    <950>   DW_AT_type        : <0x3af>
    <954>   DW_AT_declaration : 1
    <954>   DW_AT_sibling     : <0x968>
 <2><958>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <959>   DW_AT_type        : <0x3af>
 <2><95d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <95e>   DW_AT_type        : <0x679>
 <2><962>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <963>   DW_AT_type        : <0x216>
 <2><967>: Abbrev Number: 0
 <1><968>: Abbrev Number: 17 (DW_TAG_subprogram)
    <969>   DW_AT_external    : 1
    <969>   DW_AT_name        : (indirect string, offset: 0x8649d): malloc
    <96d>   DW_AT_decl_file   : 13
    <96e>   DW_AT_decl_line   : 108
    <96f>   DW_AT_decl_column : 7
    <970>   DW_AT_prototyped  : 1
    <970>   DW_AT_type        : <0x3af>
    <974>   DW_AT_declaration : 1
    <974>   DW_AT_sibling     : <0x97e>
 <2><978>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <979>   DW_AT_type        : <0x216>
 <2><97d>: Abbrev Number: 0
 <1><97e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <97f>   DW_AT_external    : 1
    <97f>   DW_AT_name        : (indirect string, offset: 0x6972e): realloc
    <983>   DW_AT_decl_file   : 13
    <984>   DW_AT_decl_line   : 145
    <985>   DW_AT_decl_column : 7
    <986>   DW_AT_prototyped  : 1
    <986>   DW_AT_type        : <0x3af>
    <98a>   DW_AT_declaration : 1
    <98a>   DW_AT_sibling     : <0x999>
 <2><98e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <98f>   DW_AT_type        : <0x3af>
 <2><993>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <994>   DW_AT_type        : <0x216>
 <2><998>: Abbrev Number: 0
 <1><999>: Abbrev Number: 36 (DW_TAG_subprogram)
    <99a>   DW_AT_external    : 1
    <99a>   DW_AT_name        : (indirect string, offset: 0x40774): vPortFree
    <99e>   DW_AT_decl_file   : 14
    <99f>   DW_AT_decl_line   : 164
    <9a0>   DW_AT_decl_column : 6
    <9a1>   DW_AT_prototyped  : 1
    <9a1>   DW_AT_declaration : 1
    <9a1>   DW_AT_sibling     : <0x9ab>
 <2><9a5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <9a6>   DW_AT_type        : <0x3af>
 <2><9aa>: Abbrev Number: 0
 <1><9ab>: Abbrev Number: 17 (DW_TAG_subprogram)
    <9ac>   DW_AT_external    : 1
    <9ac>   DW_AT_name        : (indirect string, offset: 0x8b99a): pvPortMalloc
    <9b0>   DW_AT_decl_file   : 14
    <9b1>   DW_AT_decl_line   : 163
    <9b2>   DW_AT_decl_column : 7
    <9b3>   DW_AT_prototyped  : 1
    <9b3>   DW_AT_type        : <0x3af>
    <9b7>   DW_AT_declaration : 1
    <9b7>   DW_AT_sibling     : <0x9c1>
 <2><9bb>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <9bc>   DW_AT_type        : <0x216>
 <2><9c0>: Abbrev Number: 0
 <1><9c1>: Abbrev Number: 26 (DW_TAG_subprogram)
    <9c2>   DW_AT_external    : 1
    <9c2>   DW_AT_name        : (indirect string, offset: 0x37576): GNSSCom_Receive
    <9c6>   DW_AT_decl_file   : 1
    <9c6>   DW_AT_decl_line   : 52
    <9c7>   DW_AT_decl_column : 17
    <9c8>   DW_AT_prototyped  : 1
    <9c8>   DW_AT_type        : <0xa53>
    <9cc>   DW_AT_low_pc      : 0
    <9d0>   DW_AT_high_pc     : 0xf6
    <9d4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9d6>   DW_AT_call_all_tail_calls: 1
    <9d6>   DW_AT_sibling     : <0xa53>
 <2><9da>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <9db>   DW_AT_name        : (indirect string, offset: 0x25540): buffer
    <9df>   DW_AT_decl_file   : 1
    <9df>   DW_AT_decl_line   : 52
    <9e0>   DW_AT_decl_column : 42
    <9e1>   DW_AT_type        : <0x3d7>
    <9e5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9e8>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <9e9>   DW_AT_name        : (indirect string, offset: 0xf9b8a): size
    <9ed>   DW_AT_decl_file   : 1
    <9ed>   DW_AT_decl_line   : 52
    <9ee>   DW_AT_decl_column : 56
    <9ef>   DW_AT_type        : <0x216>
    <9f3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><9f6>: Abbrev Number: 5 (DW_TAG_variable)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x5c9bd): genericMessage
    <9fb>   DW_AT_decl_file   : 1
    <9fc>   DW_AT_decl_line   : 53
    <9fd>   DW_AT_decl_column : 18
    <9fe>   DW_AT_type        : <0xa53>
    <a02>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a05>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <a06>   DW_AT_low_pc      : 0
    <a0a>   DW_AT_high_pc     : 0xd8
 <3><a0e>: Abbrev Number: 37 (DW_TAG_variable)
    <a0f>   DW_AT_name        : i
    <a11>   DW_AT_decl_file   : 1
    <a12>   DW_AT_decl_line   : 55
    <a13>   DW_AT_decl_column : 11
    <a14>   DW_AT_type        : <0x86>
    <a18>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><a1b>: Abbrev Number: 38 (DW_TAG_lexical_block)
    <a1c>   DW_AT_low_pc      : 0
    <a20>   DW_AT_high_pc     : 0x84
    <a24>   DW_AT_sibling     : <0xa38>
 <4><a28>: Abbrev Number: 5 (DW_TAG_variable)
    <a29>   DW_AT_name        : (indirect string, offset: 0x5e94e): UbxMessage
    <a2d>   DW_AT_decl_file   : 1
    <a2e>   DW_AT_decl_line   : 59
    <a2f>   DW_AT_decl_column : 23
    <a30>   DW_AT_type        : <0x85b>
    <a34>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><a37>: Abbrev Number: 0
 <3><a38>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <a39>   DW_AT_low_pc      : 0
    <a3d>   DW_AT_high_pc     : 0x1a
 <4><a41>: Abbrev Number: 5 (DW_TAG_variable)
    <a42>   DW_AT_name        : (indirect string, offset: 0x4f187): NMEAMessage
    <a46>   DW_AT_decl_file   : 1
    <a47>   DW_AT_decl_line   : 73
    <a48>   DW_AT_decl_column : 24
    <a49>   DW_AT_type        : <0x856>
    <a4d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <4><a50>: Abbrev Number: 0
 <3><a51>: Abbrev Number: 0
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a54>   DW_AT_byte_size   : 4
    <a54>   DW_AT_type        : <0x88f>
 <1><a58>: Abbrev Number: 28 (DW_TAG_subprogram)
    <a59>   DW_AT_external    : 1
    <a59>   DW_AT_name        : (indirect string, offset: 0x503e7): freeBuffer
    <a5d>   DW_AT_decl_file   : 1
    <a5d>   DW_AT_decl_line   : 47
    <a5e>   DW_AT_decl_column : 6
    <a5e>   DW_AT_prototyped  : 1
    <a5e>   DW_AT_low_pc      : 0x80005b8
    <a62>   DW_AT_high_pc     : 0x20
    <a66>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a68>   DW_AT_call_all_tail_calls: 1
    <a68>   DW_AT_sibling     : <0xa7b>
 <2><a6c>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <a6d>   DW_AT_name        : (indirect string, offset: 0xc48ad): bufferDynamic
    <a71>   DW_AT_decl_file   : 1
    <a71>   DW_AT_decl_line   : 47
    <a72>   DW_AT_decl_column : 32
    <a73>   DW_AT_type        : <0x803>
    <a77>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a7a>: Abbrev Number: 0
 <1><a7b>: Abbrev Number: 28 (DW_TAG_subprogram)
    <a7c>   DW_AT_external    : 1
    <a7c>   DW_AT_name        : (indirect string, offset: 0x71343): resizeBuffer
    <a80>   DW_AT_decl_file   : 1
    <a80>   DW_AT_decl_line   : 40
    <a81>   DW_AT_decl_column : 6
    <a81>   DW_AT_prototyped  : 1
    <a81>   DW_AT_low_pc      : 0
    <a85>   DW_AT_high_pc     : 0x32
    <a89>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8b>   DW_AT_call_all_tail_calls: 1
    <a8b>   DW_AT_sibling     : <0xabb>
 <2><a8f>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <a90>   DW_AT_name        : (indirect string, offset: 0xc48ad): bufferDynamic
    <a94>   DW_AT_decl_file   : 1
    <a94>   DW_AT_decl_line   : 40
    <a95>   DW_AT_decl_column : 34
    <a96>   DW_AT_type        : <0x803>
    <a9a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a9d>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x29493): newSize
    <aa2>   DW_AT_decl_file   : 1
    <aa2>   DW_AT_decl_line   : 40
    <aa3>   DW_AT_decl_column : 56
    <aa4>   DW_AT_type        : <0x216>
    <aa8>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><aab>: Abbrev Number: 5 (DW_TAG_variable)
    <aac>   DW_AT_name        : (indirect string, offset: 0x689e8): newData
    <ab0>   DW_AT_decl_file   : 1
    <ab1>   DW_AT_decl_line   : 41
    <ab2>   DW_AT_decl_column : 11
    <ab3>   DW_AT_type        : <0x3d7>
    <ab7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><aba>: Abbrev Number: 0
 <1><abb>: Abbrev Number: 26 (DW_TAG_subprogram)
    <abc>   DW_AT_external    : 1
    <abc>   DW_AT_name        : (indirect string, offset: 0x2f5b5): initializeBuffer
    <ac0>   DW_AT_decl_file   : 1
    <ac0>   DW_AT_decl_line   : 25
    <ac1>   DW_AT_decl_column : 16
    <ac2>   DW_AT_prototyped  : 1
    <ac2>   DW_AT_type        : <0x803>
    <ac6>   DW_AT_low_pc      : 0x8000570
    <aca>   DW_AT_high_pc     : 0x48
    <ace>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ad0>   DW_AT_call_all_tail_calls: 1
    <ad0>   DW_AT_sibling     : <0xaf2>
 <2><ad4>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xa5c13): initialSize
    <ad9>   DW_AT_decl_file   : 1
    <ad9>   DW_AT_decl_line   : 25
    <ada>   DW_AT_decl_column : 40
    <adb>   DW_AT_type        : <0x216>
    <adf>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ae2>: Abbrev Number: 5 (DW_TAG_variable)
    <ae3>   DW_AT_name        : (indirect string, offset: 0xc48ad): bufferDynamic
    <ae7>   DW_AT_decl_file   : 1
    <ae8>   DW_AT_decl_line   : 26
    <ae9>   DW_AT_decl_column : 17
    <aea>   DW_AT_type        : <0x803>
    <aee>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><af1>: Abbrev Number: 0
 <1><af2>: Abbrev Number: 39 (DW_TAG_subprogram)
    <af3>   DW_AT_external    : 1
    <af3>   DW_AT_name        : (indirect string, offset: 0x9db28): GNSSCom_Init
    <af7>   DW_AT_decl_file   : 1
    <af8>   DW_AT_decl_line   : 18
    <af9>   DW_AT_decl_column : 6
    <afa>   DW_AT_prototyped  : 1
    <afa>   DW_AT_low_pc      : 0
    <afe>   DW_AT_high_pc     : 0x28
    <b02>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b04>   DW_AT_call_all_calls: 1
 <2><b04>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b05>   DW_AT_name        : (indirect string, offset: 0xae698): huart
    <b09>   DW_AT_decl_file   : 1
    <b09>   DW_AT_decl_line   : 18
    <b0a>   DW_AT_decl_column : 39
    <b0b>   DW_AT_type        : <0x900>
    <b0f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b12>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b13>   DW_AT_name        : (indirect string, offset: 0x8b4cc): huartDebug
    <b17>   DW_AT_decl_file   : 1
    <b17>   DW_AT_decl_line   : 18
    <b18>   DW_AT_decl_column : 65
    <b19>   DW_AT_type        : <0x900>
    <b1d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b20>: Abbrev Number: 0
 <1><b21>: Abbrev Number: 0
  Compilation Unit @ offset 0xb22:
   Length:        0x95e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x24f
   Pointer Size:  4
 <0><b2e>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <b2f>   DW_AT_producer    : (indirect string, offset: 0x405a6): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b33>   DW_AT_language    : 29	(C11)
    <b34>   DW_AT_name        : (indirect string, offset: 0xf7875): ../Core/Src/LORA/LORACom.c
    <b38>   DW_AT_comp_dir    : (indirect string, offset: 0x4c04b): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <b3c>   DW_AT_ranges      : 0x38
    <b40>   DW_AT_low_pc      : 0
    <b44>   DW_AT_stmt_list   : 0xcf8
    <b48>   DW_AT_macros      : 0x26abe
 <1><b4c>: Abbrev Number: 7 (DW_TAG_base_type)
    <b4d>   DW_AT_byte_size   : 1
    <b4e>   DW_AT_encoding    : 6	(signed char)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x7beb0): signed char
 <1><b53>: Abbrev Number: 3 (DW_TAG_typedef)
    <b54>   DW_AT_name        : (indirect string, offset: 0x47569): __uint8_t
    <b58>   DW_AT_decl_file   : 2
    <b59>   DW_AT_decl_line   : 43
    <b5a>   DW_AT_decl_column : 24
    <b5b>   DW_AT_type        : <0xb5f>
 <1><b5f>: Abbrev Number: 7 (DW_TAG_base_type)
    <b60>   DW_AT_byte_size   : 1
    <b61>   DW_AT_encoding    : 8	(unsigned char)
    <b62>   DW_AT_name        : (indirect string, offset: 0xee119): unsigned char
 <1><b66>: Abbrev Number: 7 (DW_TAG_base_type)
    <b67>   DW_AT_byte_size   : 2
    <b68>   DW_AT_encoding    : 5	(signed)
    <b69>   DW_AT_name        : (indirect string, offset: 0xb6d45): short int
 <1><b6d>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xc90d2): __uint16_t
    <b72>   DW_AT_decl_file   : 2
    <b73>   DW_AT_decl_line   : 57
    <b74>   DW_AT_decl_column : 25
    <b75>   DW_AT_type        : <0xb79>
 <1><b79>: Abbrev Number: 7 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 2
    <b7b>   DW_AT_encoding    : 7	(unsigned)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xec52c): short unsigned int
 <1><b80>: Abbrev Number: 7 (DW_TAG_base_type)
    <b81>   DW_AT_byte_size   : 4
    <b82>   DW_AT_encoding    : 5	(signed)
    <b83>   DW_AT_name        : (indirect string, offset: 0x149e6): long int
 <1><b87>: Abbrev Number: 3 (DW_TAG_typedef)
    <b88>   DW_AT_name        : (indirect string, offset: 0x9db35): __uint32_t
    <b8c>   DW_AT_decl_file   : 2
    <b8d>   DW_AT_decl_line   : 79
    <b8e>   DW_AT_decl_column : 25
    <b8f>   DW_AT_type        : <0xb93>
 <1><b93>: Abbrev Number: 7 (DW_TAG_base_type)
    <b94>   DW_AT_byte_size   : 4
    <b95>   DW_AT_encoding    : 7	(unsigned)
    <b96>   DW_AT_name        : (indirect string, offset: 0x5dd9b): long unsigned int
 <1><b9a>: Abbrev Number: 7 (DW_TAG_base_type)
    <b9b>   DW_AT_byte_size   : 8
    <b9c>   DW_AT_encoding    : 5	(signed)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x70513): long long int
 <1><ba1>: Abbrev Number: 7 (DW_TAG_base_type)
    <ba2>   DW_AT_byte_size   : 8
    <ba3>   DW_AT_encoding    : 7	(unsigned)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x33150): long long unsigned int
 <1><ba8>: Abbrev Number: 18 (DW_TAG_base_type)
    <ba9>   DW_AT_byte_size   : 4
    <baa>   DW_AT_encoding    : 5	(signed)
    <bab>   DW_AT_name        : int
 <1><baf>: Abbrev Number: 7 (DW_TAG_base_type)
    <bb0>   DW_AT_byte_size   : 4
    <bb1>   DW_AT_encoding    : 7	(unsigned)
    <bb2>   DW_AT_name        : (indirect string, offset: 0x13ee2): unsigned int
 <1><bb6>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb7>   DW_AT_name        : (indirect string, offset: 0x4756b): uint8_t
    <bbb>   DW_AT_decl_file   : 3
    <bbc>   DW_AT_decl_line   : 24
    <bbd>   DW_AT_decl_column : 19
    <bbe>   DW_AT_type        : <0xb53>
 <1><bc2>: Abbrev Number: 19 (DW_TAG_const_type)
    <bc3>   DW_AT_type        : <0xbb6>
 <1><bc7>: Abbrev Number: 3 (DW_TAG_typedef)
    <bc8>   DW_AT_name        : (indirect string, offset: 0xb5024): uint16_t
    <bcc>   DW_AT_decl_file   : 3
    <bcd>   DW_AT_decl_line   : 36
    <bce>   DW_AT_decl_column : 20
    <bcf>   DW_AT_type        : <0xb6d>
 <1><bd3>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <bd4>   DW_AT_type        : <0xbc7>
 <1><bd8>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x113a5): uint32_t
    <bdd>   DW_AT_decl_file   : 3
    <bde>   DW_AT_decl_line   : 48
    <bdf>   DW_AT_decl_column : 20
    <be0>   DW_AT_type        : <0xb87>
 <1><be4>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <be5>   DW_AT_type        : <0xbd8>
 <1><be9>: Abbrev Number: 7 (DW_TAG_base_type)
    <bea>   DW_AT_byte_size   : 8
    <beb>   DW_AT_encoding    : 4	(float)
    <bec>   DW_AT_name        : (indirect string, offset: 0x167e3): long double
 <1><bf0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <bf1>   DW_AT_byte_size   : 4
 <1><bf2>: Abbrev Number: 7 (DW_TAG_base_type)
    <bf3>   DW_AT_byte_size   : 1
    <bf4>   DW_AT_encoding    : 8	(unsigned char)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x4f3fe): char
 <1><bf9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <bfa>   DW_AT_byte_size   : 4
    <bfa>   DW_AT_type        : <0xbb6>
 <1><bfe>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bff>   DW_AT_byte_size   : 16
    <c00>   DW_AT_decl_file   : 4
    <c00>   DW_AT_decl_line   : 404
    <c02>   DW_AT_decl_column : 9
    <c02>   DW_AT_sibling     : <0xc3d>
 <2><c06>: Abbrev Number: 5 (DW_TAG_member)
    <c07>   DW_AT_name        : CCR
    <c0b>   DW_AT_decl_file   : 4
    <c0b>   DW_AT_decl_line   : 406
    <c0d>   DW_AT_decl_column : 17
    <c0d>   DW_AT_type        : <0xbe4>
    <c11>   DW_AT_data_member_location: 0
 <2><c12>: Abbrev Number: 2 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0xa1b85): CNDTR
    <c17>   DW_AT_decl_file   : 4
    <c18>   DW_AT_decl_line   : 407
    <c1a>   DW_AT_decl_column : 17
    <c1b>   DW_AT_type        : <0xbe4>
    <c1f>   DW_AT_data_member_location: 4
 <2><c20>: Abbrev Number: 2 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0xee2fb): CPAR
    <c25>   DW_AT_decl_file   : 4
    <c26>   DW_AT_decl_line   : 408
    <c28>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0xbe4>
    <c2d>   DW_AT_data_member_location: 8
 <2><c2e>: Abbrev Number: 2 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x884f1): CMAR
    <c33>   DW_AT_decl_file   : 4
    <c34>   DW_AT_decl_line   : 409
    <c36>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0xbe4>
    <c3b>   DW_AT_data_member_location: 12
 <2><c3c>: Abbrev Number: 0
 <1><c3d>: Abbrev Number: 9 (DW_TAG_typedef)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xe85e3): DMA_Channel_TypeDef
    <c42>   DW_AT_decl_file   : 4
    <c43>   DW_AT_decl_line   : 410
    <c45>   DW_AT_decl_column : 3
    <c45>   DW_AT_type        : <0xbfe>
 <1><c49>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c4a>   DW_AT_byte_size   : 8
    <c4b>   DW_AT_decl_file   : 4
    <c4b>   DW_AT_decl_line   : 412
    <c4d>   DW_AT_decl_column : 9
    <c4d>   DW_AT_sibling     : <0xc6c>
 <2><c51>: Abbrev Number: 5 (DW_TAG_member)
    <c52>   DW_AT_name        : ISR
    <c56>   DW_AT_decl_file   : 4
    <c56>   DW_AT_decl_line   : 414
    <c58>   DW_AT_decl_column : 17
    <c58>   DW_AT_type        : <0xbe4>
    <c5c>   DW_AT_data_member_location: 0
 <2><c5d>: Abbrev Number: 2 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xac9b9): IFCR
    <c62>   DW_AT_decl_file   : 4
    <c63>   DW_AT_decl_line   : 415
    <c65>   DW_AT_decl_column : 17
    <c66>   DW_AT_type        : <0xbe4>
    <c6a>   DW_AT_data_member_location: 4
 <2><c6b>: Abbrev Number: 0
 <1><c6c>: Abbrev Number: 9 (DW_TAG_typedef)
    <c6d>   DW_AT_name        : (indirect string, offset: 0x59658): DMA_TypeDef
    <c71>   DW_AT_decl_file   : 4
    <c72>   DW_AT_decl_line   : 416
    <c74>   DW_AT_decl_column : 3
    <c74>   DW_AT_type        : <0xc49>
 <1><c78>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c79>   DW_AT_byte_size   : 28
    <c7a>   DW_AT_decl_file   : 4
    <c7a>   DW_AT_decl_line   : 842
    <c7c>   DW_AT_decl_column : 9
    <c7c>   DW_AT_sibling     : <0xcd9>
 <2><c80>: Abbrev Number: 5 (DW_TAG_member)
    <c81>   DW_AT_name        : CR1
    <c85>   DW_AT_decl_file   : 4
    <c85>   DW_AT_decl_line   : 844
    <c87>   DW_AT_decl_column : 17
    <c87>   DW_AT_type        : <0xbe4>
    <c8b>   DW_AT_data_member_location: 0
 <2><c8c>: Abbrev Number: 5 (DW_TAG_member)
    <c8d>   DW_AT_name        : CR2
    <c91>   DW_AT_decl_file   : 4
    <c91>   DW_AT_decl_line   : 845
    <c93>   DW_AT_decl_column : 17
    <c93>   DW_AT_type        : <0xbe4>
    <c97>   DW_AT_data_member_location: 4
 <2><c98>: Abbrev Number: 5 (DW_TAG_member)
    <c99>   DW_AT_name        : SR
    <c9c>   DW_AT_decl_file   : 4
    <c9c>   DW_AT_decl_line   : 846
    <c9e>   DW_AT_decl_column : 17
    <c9e>   DW_AT_type        : <0xbe4>
    <ca2>   DW_AT_data_member_location: 8
 <2><ca3>: Abbrev Number: 5 (DW_TAG_member)
    <ca4>   DW_AT_name        : DR
    <ca7>   DW_AT_decl_file   : 4
    <ca7>   DW_AT_decl_line   : 847
    <ca9>   DW_AT_decl_column : 17
    <ca9>   DW_AT_type        : <0xbe4>
    <cad>   DW_AT_data_member_location: 12
 <2><cae>: Abbrev Number: 2 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0xf77a6): CRCPR
    <cb3>   DW_AT_decl_file   : 4
    <cb4>   DW_AT_decl_line   : 848
    <cb6>   DW_AT_decl_column : 17
    <cb7>   DW_AT_type        : <0xbe4>
    <cbb>   DW_AT_data_member_location: 16
 <2><cbc>: Abbrev Number: 2 (DW_TAG_member)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xf7853): RXCRCR
    <cc1>   DW_AT_decl_file   : 4
    <cc2>   DW_AT_decl_line   : 849
    <cc4>   DW_AT_decl_column : 17
    <cc5>   DW_AT_type        : <0xbe4>
    <cc9>   DW_AT_data_member_location: 20
 <2><cca>: Abbrev Number: 2 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0xf77f5): TXCRCR
    <ccf>   DW_AT_decl_file   : 4
    <cd0>   DW_AT_decl_line   : 850
    <cd2>   DW_AT_decl_column : 17
    <cd3>   DW_AT_type        : <0xbe4>
    <cd7>   DW_AT_data_member_location: 24
 <2><cd8>: Abbrev Number: 0
 <1><cd9>: Abbrev Number: 9 (DW_TAG_typedef)
    <cda>   DW_AT_name        : (indirect string, offset: 0xf779a): SPI_TypeDef
    <cde>   DW_AT_decl_file   : 4
    <cdf>   DW_AT_decl_line   : 851
    <ce1>   DW_AT_decl_column : 3
    <ce1>   DW_AT_type        : <0xc78>
 <1><ce5>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ce6>   DW_AT_byte_size   : 44
    <ce7>   DW_AT_decl_file   : 4
    <ce7>   DW_AT_decl_line   : 950
    <ce9>   DW_AT_decl_column : 9
    <ce9>   DW_AT_sibling     : <0xdae>
 <2><ced>: Abbrev Number: 5 (DW_TAG_member)
    <cee>   DW_AT_name        : CR1
    <cf2>   DW_AT_decl_file   : 4
    <cf2>   DW_AT_decl_line   : 952
    <cf4>   DW_AT_decl_column : 17
    <cf4>   DW_AT_type        : <0xbe4>
    <cf8>   DW_AT_data_member_location: 0
 <2><cf9>: Abbrev Number: 5 (DW_TAG_member)
    <cfa>   DW_AT_name        : CR2
    <cfe>   DW_AT_decl_file   : 4
    <cfe>   DW_AT_decl_line   : 953
    <d00>   DW_AT_decl_column : 17
    <d00>   DW_AT_type        : <0xbe4>
    <d04>   DW_AT_data_member_location: 4
 <2><d05>: Abbrev Number: 5 (DW_TAG_member)
    <d06>   DW_AT_name        : CR3
    <d0a>   DW_AT_decl_file   : 4
    <d0a>   DW_AT_decl_line   : 954
    <d0c>   DW_AT_decl_column : 17
    <d0c>   DW_AT_type        : <0xbe4>
    <d10>   DW_AT_data_member_location: 8
 <2><d11>: Abbrev Number: 5 (DW_TAG_member)
    <d12>   DW_AT_name        : BRR
    <d16>   DW_AT_decl_file   : 4
    <d16>   DW_AT_decl_line   : 955
    <d18>   DW_AT_decl_column : 17
    <d18>   DW_AT_type        : <0xbe4>
    <d1c>   DW_AT_data_member_location: 12
 <2><d1d>: Abbrev Number: 2 (DW_TAG_member)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x44278): GTPR
    <d22>   DW_AT_decl_file   : 4
    <d23>   DW_AT_decl_line   : 956
    <d25>   DW_AT_decl_column : 17
    <d26>   DW_AT_type        : <0xbd3>
    <d2a>   DW_AT_data_member_location: 16
 <2><d2b>: Abbrev Number: 2 (DW_TAG_member)
    <d2c>   DW_AT_name        : (indirect string, offset: 0xe846e): RESERVED2
    <d30>   DW_AT_decl_file   : 4
    <d31>   DW_AT_decl_line   : 957
    <d33>   DW_AT_decl_column : 13
    <d34>   DW_AT_type        : <0xbc7>
    <d38>   DW_AT_data_member_location: 18
 <2><d39>: Abbrev Number: 2 (DW_TAG_member)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x912d5): RTOR
    <d3e>   DW_AT_decl_file   : 4
    <d3f>   DW_AT_decl_line   : 958
    <d41>   DW_AT_decl_column : 17
    <d42>   DW_AT_type        : <0xbe4>
    <d46>   DW_AT_data_member_location: 20
 <2><d47>: Abbrev Number: 5 (DW_TAG_member)
    <d48>   DW_AT_name        : RQR
    <d4c>   DW_AT_decl_file   : 4
    <d4c>   DW_AT_decl_line   : 959
    <d4e>   DW_AT_decl_column : 17
    <d4e>   DW_AT_type        : <0xbd3>
    <d52>   DW_AT_data_member_location: 24
 <2><d53>: Abbrev Number: 2 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0xe8478): RESERVED3
    <d58>   DW_AT_decl_file   : 4
    <d59>   DW_AT_decl_line   : 960
    <d5b>   DW_AT_decl_column : 13
    <d5c>   DW_AT_type        : <0xbc7>
    <d60>   DW_AT_data_member_location: 26
 <2><d61>: Abbrev Number: 5 (DW_TAG_member)
    <d62>   DW_AT_name        : ISR
    <d66>   DW_AT_decl_file   : 4
    <d66>   DW_AT_decl_line   : 961
    <d68>   DW_AT_decl_column : 17
    <d68>   DW_AT_type        : <0xbe4>
    <d6c>   DW_AT_data_member_location: 28
 <2><d6d>: Abbrev Number: 5 (DW_TAG_member)
    <d6e>   DW_AT_name        : ICR
    <d72>   DW_AT_decl_file   : 4
    <d72>   DW_AT_decl_line   : 962
    <d74>   DW_AT_decl_column : 17
    <d74>   DW_AT_type        : <0xbe4>
    <d78>   DW_AT_data_member_location: 32
 <2><d79>: Abbrev Number: 5 (DW_TAG_member)
    <d7a>   DW_AT_name        : RDR
    <d7e>   DW_AT_decl_file   : 4
    <d7e>   DW_AT_decl_line   : 963
    <d80>   DW_AT_decl_column : 17
    <d80>   DW_AT_type        : <0xbd3>
    <d84>   DW_AT_data_member_location: 36
 <2><d85>: Abbrev Number: 2 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0xdea28): RESERVED4
    <d8a>   DW_AT_decl_file   : 4
    <d8b>   DW_AT_decl_line   : 964
    <d8d>   DW_AT_decl_column : 13
    <d8e>   DW_AT_type        : <0xbc7>
    <d92>   DW_AT_data_member_location: 38
 <2><d93>: Abbrev Number: 5 (DW_TAG_member)
    <d94>   DW_AT_name        : TDR
    <d98>   DW_AT_decl_file   : 4
    <d98>   DW_AT_decl_line   : 965
    <d9a>   DW_AT_decl_column : 17
    <d9a>   DW_AT_type        : <0xbd3>
    <d9e>   DW_AT_data_member_location: 40
 <2><d9f>: Abbrev Number: 2 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0xe84a6): RESERVED5
    <da4>   DW_AT_decl_file   : 4
    <da5>   DW_AT_decl_line   : 966
    <da7>   DW_AT_decl_column : 13
    <da8>   DW_AT_type        : <0xbc7>
    <dac>   DW_AT_data_member_location: 42
 <2><dad>: Abbrev Number: 0
 <1><dae>: Abbrev Number: 9 (DW_TAG_typedef)
    <daf>   DW_AT_name        : (indirect string, offset: 0xf46cb): USART_TypeDef
    <db3>   DW_AT_decl_file   : 4
    <db4>   DW_AT_decl_line   : 967
    <db6>   DW_AT_decl_column : 3
    <db6>   DW_AT_type        : <0xce5>
 <1><dba>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <dbb>   DW_AT_encoding    : 7	(unsigned)
    <dbb>   DW_AT_byte_size   : 1
    <dbb>   DW_AT_type        : <0xb5f>
    <dbf>   DW_AT_decl_file   : 5
    <dc0>   DW_AT_decl_line   : 50
    <dc1>   DW_AT_decl_column : 1
    <dc1>   DW_AT_sibling     : <0xdd2>
 <2><dc5>: Abbrev Number: 6 (DW_TAG_enumerator)
    <dc6>   DW_AT_name        : (indirect string, offset: 0xb5a93): HAL_UNLOCKED
    <dca>   DW_AT_const_value : 0
 <2><dcb>: Abbrev Number: 6 (DW_TAG_enumerator)
    <dcc>   DW_AT_name        : (indirect string, offset: 0xf65c8): HAL_LOCKED
    <dd0>   DW_AT_const_value : 1
 <2><dd1>: Abbrev Number: 0
 <1><dd2>: Abbrev Number: 3 (DW_TAG_typedef)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x91252): HAL_LockTypeDef
    <dd7>   DW_AT_decl_file   : 5
    <dd8>   DW_AT_decl_line   : 53
    <dd9>   DW_AT_decl_column : 3
    <dda>   DW_AT_type        : <0xdba>
 <1><dde>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ddf>   DW_AT_byte_size   : 32
    <de0>   DW_AT_decl_file   : 6
    <de1>   DW_AT_decl_line   : 46
    <de2>   DW_AT_decl_column : 9
    <de2>   DW_AT_sibling     : <0xe4f>
 <2><de6>: Abbrev Number: 1 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0xdca2d): Request
    <deb>   DW_AT_decl_file   : 6
    <dec>   DW_AT_decl_line   : 48
    <ded>   DW_AT_decl_column : 12
    <dee>   DW_AT_type        : <0xbd8>
    <df2>   DW_AT_data_member_location: 0
 <2><df3>: Abbrev Number: 1 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x5b038): Direction
    <df8>   DW_AT_decl_file   : 6
    <df9>   DW_AT_decl_line   : 51
    <dfa>   DW_AT_decl_column : 12
    <dfb>   DW_AT_type        : <0xbd8>
    <dff>   DW_AT_data_member_location: 4
 <2><e00>: Abbrev Number: 1 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x107a6): PeriphInc
    <e05>   DW_AT_decl_file   : 6
    <e06>   DW_AT_decl_line   : 55
    <e07>   DW_AT_decl_column : 12
    <e08>   DW_AT_type        : <0xbd8>
    <e0c>   DW_AT_data_member_location: 8
 <2><e0d>: Abbrev Number: 1 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x26597): MemInc
    <e12>   DW_AT_decl_file   : 6
    <e13>   DW_AT_decl_line   : 58
    <e14>   DW_AT_decl_column : 12
    <e15>   DW_AT_type        : <0xbd8>
    <e19>   DW_AT_data_member_location: 12
 <2><e1a>: Abbrev Number: 1 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x7af25): PeriphDataAlignment
    <e1f>   DW_AT_decl_file   : 6
    <e20>   DW_AT_decl_line   : 61
    <e21>   DW_AT_decl_column : 12
    <e22>   DW_AT_type        : <0xbd8>
    <e26>   DW_AT_data_member_location: 16
 <2><e27>: Abbrev Number: 1 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0xde5a8): MemDataAlignment
    <e2c>   DW_AT_decl_file   : 6
    <e2d>   DW_AT_decl_line   : 64
    <e2e>   DW_AT_decl_column : 12
    <e2f>   DW_AT_type        : <0xbd8>
    <e33>   DW_AT_data_member_location: 20
 <2><e34>: Abbrev Number: 1 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0xfbe9b): Mode
    <e39>   DW_AT_decl_file   : 6
    <e3a>   DW_AT_decl_line   : 67
    <e3b>   DW_AT_decl_column : 12
    <e3c>   DW_AT_type        : <0xbd8>
    <e40>   DW_AT_data_member_location: 24
 <2><e41>: Abbrev Number: 1 (DW_TAG_member)
    <e42>   DW_AT_name        : (indirect string, offset: 0xfb7b2): Priority
    <e46>   DW_AT_decl_file   : 6
    <e47>   DW_AT_decl_line   : 72
    <e48>   DW_AT_decl_column : 12
    <e49>   DW_AT_type        : <0xbd8>
    <e4d>   DW_AT_data_member_location: 28
 <2><e4e>: Abbrev Number: 0
 <1><e4f>: Abbrev Number: 3 (DW_TAG_typedef)
    <e50>   DW_AT_name        : (indirect string, offset: 0x4213e): DMA_InitTypeDef
    <e54>   DW_AT_decl_file   : 6
    <e55>   DW_AT_decl_line   : 74
    <e56>   DW_AT_decl_column : 3
    <e57>   DW_AT_type        : <0xdde>
 <1><e5b>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <e5c>   DW_AT_encoding    : 7	(unsigned)
    <e5c>   DW_AT_byte_size   : 1
    <e5c>   DW_AT_type        : <0xb5f>
    <e60>   DW_AT_decl_file   : 6
    <e61>   DW_AT_decl_line   : 80
    <e62>   DW_AT_decl_column : 1
    <e62>   DW_AT_sibling     : <0xe7f>
 <2><e66>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e67>   DW_AT_name        : (indirect string, offset: 0xb7215): HAL_DMA_STATE_RESET
    <e6b>   DW_AT_const_value : 0
 <2><e6c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x43789): HAL_DMA_STATE_READY
    <e71>   DW_AT_const_value : 1
 <2><e72>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e73>   DW_AT_name        : (indirect string, offset: 0xaae82): HAL_DMA_STATE_BUSY
    <e77>   DW_AT_const_value : 2
 <2><e78>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e79>   DW_AT_name        : (indirect string, offset: 0xf2959): HAL_DMA_STATE_TIMEOUT
    <e7d>   DW_AT_const_value : 3
 <2><e7e>: Abbrev Number: 0
 <1><e7f>: Abbrev Number: 3 (DW_TAG_typedef)
    <e80>   DW_AT_name        : (indirect string, offset: 0x87cd9): HAL_DMA_StateTypeDef
    <e84>   DW_AT_decl_file   : 6
    <e85>   DW_AT_decl_line   : 85
    <e86>   DW_AT_decl_column : 3
    <e87>   DW_AT_type        : <0xe5b>
 <1><e8b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <e8c>   DW_AT_type        : <0xe7f>
 <1><e90>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e91>   DW_AT_name        : (indirect string, offset: 0xd1a1a): __DMA_HandleTypeDef
    <e95>   DW_AT_byte_size   : 72
    <e96>   DW_AT_decl_file   : 6
    <e97>   DW_AT_decl_line   : 112
    <e98>   DW_AT_decl_column : 16
    <e98>   DW_AT_sibling     : <0xf39>
 <2><e9c>: Abbrev Number: 1 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0xc8dac): Instance
    <ea1>   DW_AT_decl_file   : 6
    <ea2>   DW_AT_decl_line   : 114
    <ea3>   DW_AT_decl_column : 27
    <ea4>   DW_AT_type        : <0xf39>
    <ea8>   DW_AT_data_member_location: 0
 <2><ea9>: Abbrev Number: 1 (DW_TAG_member)
    <eaa>   DW_AT_name        : (indirect string, offset: 0xfc617): Init
    <eae>   DW_AT_decl_file   : 6
    <eaf>   DW_AT_decl_line   : 116
    <eb0>   DW_AT_decl_column : 25
    <eb1>   DW_AT_type        : <0xe4f>
    <eb5>   DW_AT_data_member_location: 4
 <2><eb6>: Abbrev Number: 1 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xaf767): Lock
    <ebb>   DW_AT_decl_file   : 6
    <ebc>   DW_AT_decl_line   : 118
    <ebd>   DW_AT_decl_column : 25
    <ebe>   DW_AT_type        : <0xdd2>
    <ec2>   DW_AT_data_member_location: 36
 <2><ec3>: Abbrev Number: 1 (DW_TAG_member)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xfdbf3): State
    <ec8>   DW_AT_decl_file   : 6
    <ec9>   DW_AT_decl_line   : 120
    <eca>   DW_AT_decl_column : 30
    <ecb>   DW_AT_type        : <0xe8b>
    <ecf>   DW_AT_data_member_location: 37
 <2><ed0>: Abbrev Number: 1 (DW_TAG_member)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x4d040): Parent
    <ed5>   DW_AT_decl_file   : 6
    <ed6>   DW_AT_decl_line   : 122
    <ed7>   DW_AT_decl_column : 26
    <ed8>   DW_AT_type        : <0xbf0>
    <edc>   DW_AT_data_member_location: 40
 <2><edd>: Abbrev Number: 1 (DW_TAG_member)
    <ede>   DW_AT_name        : (indirect string, offset: 0xf5586): XferCpltCallback
    <ee2>   DW_AT_decl_file   : 6
    <ee3>   DW_AT_decl_line   : 124
    <ee4>   DW_AT_decl_column : 11
    <ee5>   DW_AT_type        : <0xf4e>
    <ee9>   DW_AT_data_member_location: 44
 <2><eea>: Abbrev Number: 1 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xbf240): XferHalfCpltCallback
    <eef>   DW_AT_decl_file   : 6
    <ef0>   DW_AT_decl_line   : 126
    <ef1>   DW_AT_decl_column : 11
    <ef2>   DW_AT_type        : <0xf4e>
    <ef6>   DW_AT_data_member_location: 48
 <2><ef7>: Abbrev Number: 1 (DW_TAG_member)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x2301e): XferErrorCallback
    <efc>   DW_AT_decl_file   : 6
    <efd>   DW_AT_decl_line   : 128
    <efe>   DW_AT_decl_column : 11
    <eff>   DW_AT_type        : <0xf4e>
    <f03>   DW_AT_data_member_location: 52
 <2><f04>: Abbrev Number: 1 (DW_TAG_member)
    <f05>   DW_AT_name        : (indirect string, offset: 0xe5ff6): XferAbortCallback
    <f09>   DW_AT_decl_file   : 6
    <f0a>   DW_AT_decl_line   : 130
    <f0b>   DW_AT_decl_column : 11
    <f0c>   DW_AT_type        : <0xf4e>
    <f10>   DW_AT_data_member_location: 56
 <2><f11>: Abbrev Number: 1 (DW_TAG_member)
    <f12>   DW_AT_name        : (indirect string, offset: 0xf0fdc): ErrorCode
    <f16>   DW_AT_decl_file   : 6
    <f17>   DW_AT_decl_line   : 132
    <f18>   DW_AT_decl_column : 25
    <f19>   DW_AT_type        : <0xbe4>
    <f1d>   DW_AT_data_member_location: 60
 <2><f1e>: Abbrev Number: 1 (DW_TAG_member)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x6381c): DmaBaseAddress
    <f23>   DW_AT_decl_file   : 6
    <f24>   DW_AT_decl_line   : 134
    <f25>   DW_AT_decl_column : 26
    <f26>   DW_AT_type        : <0xf53>
    <f2a>   DW_AT_data_member_location: 64
 <2><f2b>: Abbrev Number: 1 (DW_TAG_member)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x32d2d): ChannelIndex
    <f30>   DW_AT_decl_file   : 6
    <f31>   DW_AT_decl_line   : 136
    <f32>   DW_AT_decl_column : 25
    <f33>   DW_AT_type        : <0xbd8>
    <f37>   DW_AT_data_member_location: 68
 <2><f38>: Abbrev Number: 0
 <1><f39>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3a>   DW_AT_byte_size   : 4
    <f3a>   DW_AT_type        : <0xc3d>
 <1><f3e>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <f3f>   DW_AT_prototyped  : 1
    <f3f>   DW_AT_sibling     : <0xf49>
 <2><f43>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <f44>   DW_AT_type        : <0xf49>
 <2><f48>: Abbrev Number: 0
 <1><f49>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4a>   DW_AT_byte_size   : 4
    <f4a>   DW_AT_type        : <0xe90>
 <1><f4e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4f>   DW_AT_byte_size   : 4
    <f4f>   DW_AT_type        : <0xf3e>
 <1><f53>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f54>   DW_AT_byte_size   : 4
    <f54>   DW_AT_type        : <0xc6c>
 <1><f58>: Abbrev Number: 3 (DW_TAG_typedef)
    <f59>   DW_AT_name        : (indirect string, offset: 0xd1a1c): DMA_HandleTypeDef
    <f5d>   DW_AT_decl_file   : 6
    <f5e>   DW_AT_decl_line   : 153
    <f5f>   DW_AT_decl_column : 3
    <f60>   DW_AT_type        : <0xe90>
 <1><f64>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f65>   DW_AT_byte_size   : 52
    <f66>   DW_AT_decl_file   : 7
    <f67>   DW_AT_decl_line   : 46
    <f68>   DW_AT_decl_column : 9
    <f68>   DW_AT_sibling     : <0x1016>
 <2><f6c>: Abbrev Number: 1 (DW_TAG_member)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xfbe9b): Mode
    <f71>   DW_AT_decl_file   : 7
    <f72>   DW_AT_decl_line   : 48
    <f73>   DW_AT_decl_column : 12
    <f74>   DW_AT_type        : <0xbd8>
    <f78>   DW_AT_data_member_location: 0
 <2><f79>: Abbrev Number: 1 (DW_TAG_member)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x5b038): Direction
    <f7e>   DW_AT_decl_file   : 7
    <f7f>   DW_AT_decl_line   : 51
    <f80>   DW_AT_decl_column : 12
    <f81>   DW_AT_type        : <0xbd8>
    <f85>   DW_AT_data_member_location: 4
 <2><f86>: Abbrev Number: 1 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0xf78d8): DataSize
    <f8b>   DW_AT_decl_file   : 7
    <f8c>   DW_AT_decl_line   : 54
    <f8d>   DW_AT_decl_column : 12
    <f8e>   DW_AT_type        : <0xbd8>
    <f92>   DW_AT_data_member_location: 8
 <2><f93>: Abbrev Number: 1 (DW_TAG_member)
    <f94>   DW_AT_name        : (indirect string, offset: 0xf778e): CLKPolarity
    <f98>   DW_AT_decl_file   : 7
    <f99>   DW_AT_decl_line   : 57
    <f9a>   DW_AT_decl_column : 12
    <f9b>   DW_AT_type        : <0xbd8>
    <f9f>   DW_AT_data_member_location: 12
 <2><fa0>: Abbrev Number: 1 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0xf77ac): CLKPhase
    <fa5>   DW_AT_decl_file   : 7
    <fa6>   DW_AT_decl_line   : 60
    <fa7>   DW_AT_decl_column : 12
    <fa8>   DW_AT_type        : <0xbd8>
    <fac>   DW_AT_data_member_location: 16
 <2><fad>: Abbrev Number: 21 (DW_TAG_member)
    <fae>   DW_AT_name        : NSS
    <fb2>   DW_AT_decl_file   : 7
    <fb3>   DW_AT_decl_line   : 63
    <fb4>   DW_AT_decl_column : 12
    <fb5>   DW_AT_type        : <0xbd8>
    <fb9>   DW_AT_data_member_location: 20
 <2><fba>: Abbrev Number: 1 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xf76ad): BaudRatePrescaler
    <fbf>   DW_AT_decl_file   : 7
    <fc0>   DW_AT_decl_line   : 67
    <fc1>   DW_AT_decl_column : 12
    <fc2>   DW_AT_type        : <0xbd8>
    <fc6>   DW_AT_data_member_location: 24
 <2><fc7>: Abbrev Number: 1 (DW_TAG_member)
    <fc8>   DW_AT_name        : (indirect string, offset: 0xf7914): FirstBit
    <fcc>   DW_AT_decl_file   : 7
    <fcd>   DW_AT_decl_line   : 73
    <fce>   DW_AT_decl_column : 12
    <fcf>   DW_AT_type        : <0xbd8>
    <fd3>   DW_AT_data_member_location: 28
 <2><fd4>: Abbrev Number: 1 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0xf784c): TIMode
    <fd9>   DW_AT_decl_file   : 7
    <fda>   DW_AT_decl_line   : 76
    <fdb>   DW_AT_decl_column : 12
    <fdc>   DW_AT_type        : <0xbd8>
    <fe0>   DW_AT_data_member_location: 32
 <2><fe1>: Abbrev Number: 1 (DW_TAG_member)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xf78c9): CRCCalculation
    <fe6>   DW_AT_decl_file   : 7
    <fe7>   DW_AT_decl_line   : 79
    <fe8>   DW_AT_decl_column : 12
    <fe9>   DW_AT_type        : <0xbd8>
    <fed>   DW_AT_data_member_location: 36
 <2><fee>: Abbrev Number: 1 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0xf7812): CRCPolynomial
    <ff3>   DW_AT_decl_file   : 7
    <ff4>   DW_AT_decl_line   : 82
    <ff5>   DW_AT_decl_column : 12
    <ff6>   DW_AT_type        : <0xbd8>
    <ffa>   DW_AT_data_member_location: 40
 <2><ffb>: Abbrev Number: 1 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0xf78bf): CRCLength
    <1000>   DW_AT_decl_file   : 7
    <1001>   DW_AT_decl_line   : 85
    <1002>   DW_AT_decl_column : 12
    <1003>   DW_AT_type        : <0xbd8>
    <1007>   DW_AT_data_member_location: 44
 <2><1008>: Abbrev Number: 1 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0xf77ec): NSSPMode
    <100d>   DW_AT_decl_file   : 7
    <100e>   DW_AT_decl_line   : 89
    <100f>   DW_AT_decl_column : 12
    <1010>   DW_AT_type        : <0xbd8>
    <1014>   DW_AT_data_member_location: 48
 <2><1015>: Abbrev Number: 0
 <1><1016>: Abbrev Number: 3 (DW_TAG_typedef)
    <1017>   DW_AT_name        : (indirect string, offset: 0xf7755): SPI_InitTypeDef
    <101b>   DW_AT_decl_file   : 7
    <101c>   DW_AT_decl_line   : 95
    <101d>   DW_AT_decl_column : 3
    <101e>   DW_AT_type        : <0xf64>
 <1><1022>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <1023>   DW_AT_encoding    : 7	(unsigned)
    <1023>   DW_AT_byte_size   : 1
    <1023>   DW_AT_type        : <0xb5f>
    <1027>   DW_AT_decl_file   : 7
    <1028>   DW_AT_decl_line   : 101
    <1029>   DW_AT_decl_column : 1
    <1029>   DW_AT_sibling     : <0x105e>
 <2><102d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <102e>   DW_AT_name        : (indirect string, offset: 0xf7890): HAL_SPI_STATE_RESET
    <1032>   DW_AT_const_value : 0
 <2><1033>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1034>   DW_AT_name        : (indirect string, offset: 0xf7765): HAL_SPI_STATE_READY
    <1038>   DW_AT_const_value : 1
 <2><1039>: Abbrev Number: 6 (DW_TAG_enumerator)
    <103a>   DW_AT_name        : (indirect string, offset: 0xf76dd): HAL_SPI_STATE_BUSY
    <103e>   DW_AT_const_value : 2
 <2><103f>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1040>   DW_AT_name        : (indirect string, offset: 0xf7820): HAL_SPI_STATE_BUSY_TX
    <1044>   DW_AT_const_value : 3
 <2><1045>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1046>   DW_AT_name        : (indirect string, offset: 0xf77fc): HAL_SPI_STATE_BUSY_RX
    <104a>   DW_AT_const_value : 4
 <2><104b>: Abbrev Number: 6 (DW_TAG_enumerator)
    <104c>   DW_AT_name        : (indirect string, offset: 0xf773c): HAL_SPI_STATE_BUSY_TX_RX
    <1050>   DW_AT_const_value : 5
 <2><1051>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1052>   DW_AT_name        : (indirect string, offset: 0xf78e1): HAL_SPI_STATE_ERROR
    <1056>   DW_AT_const_value : 6
 <2><1057>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1058>   DW_AT_name        : (indirect string, offset: 0xf7728): HAL_SPI_STATE_ABORT
    <105c>   DW_AT_const_value : 7
 <2><105d>: Abbrev Number: 0
 <1><105e>: Abbrev Number: 3 (DW_TAG_typedef)
    <105f>   DW_AT_name        : (indirect string, offset: 0xf76f0): HAL_SPI_StateTypeDef
    <1063>   DW_AT_decl_file   : 7
    <1064>   DW_AT_decl_line   : 110
    <1065>   DW_AT_decl_column : 3
    <1066>   DW_AT_type        : <0x1022>
 <1><106a>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <106b>   DW_AT_type        : <0x105e>
 <1><106f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1070>   DW_AT_name        : (indirect string, offset: 0xf7900): __SPI_HandleTypeDef
    <1074>   DW_AT_byte_size   : 100
    <1075>   DW_AT_decl_file   : 7
    <1076>   DW_AT_decl_line   : 115
    <1077>   DW_AT_decl_column : 16
    <1077>   DW_AT_sibling     : <0x114c>
 <2><107b>: Abbrev Number: 1 (DW_TAG_member)
    <107c>   DW_AT_name        : (indirect string, offset: 0xc8dac): Instance
    <1080>   DW_AT_decl_file   : 7
    <1081>   DW_AT_decl_line   : 117
    <1082>   DW_AT_decl_column : 31
    <1083>   DW_AT_type        : <0x114c>
    <1087>   DW_AT_data_member_location: 0
 <2><1088>: Abbrev Number: 1 (DW_TAG_member)
    <1089>   DW_AT_name        : (indirect string, offset: 0xfc617): Init
    <108d>   DW_AT_decl_file   : 7
    <108e>   DW_AT_decl_line   : 119
    <108f>   DW_AT_decl_column : 30
