Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xae3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x405f9): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x85c7a): ../Core/Src/GNSS/GNSSCom.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4c09e): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x7bfda): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x475bc): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 5 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xee2d5): unsigned char
 <1><44>: Abbrev Number: 5 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb6eda): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xc9298): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 5 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xec6e8): short unsigned int
 <1><5e>: Abbrev Number: 5 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x14a21): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x9dcf9): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 5 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5ddc9): long unsigned int
 <1><78>: Abbrev Number: 5 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x705c4): long long int
 <1><7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x331bf): long long unsigned int
 <1><86>: Abbrev Number: 28 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 5 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x13f1d): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x475be): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 29 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xb51b9): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x113c5): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 16
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 404
    <cb>   DW_AT_decl_column : 9
    <cb>   DW_AT_sibling     : <0x106>
 <2><cf>: Abbrev Number: 6 (DW_TAG_member)
    <d0>   DW_AT_name        : CCR
    <d4>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 406
    <d6>   DW_AT_decl_column : 17
    <d6>   DW_AT_type        : <0xc2>
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 3 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0xa1d22): CNDTR
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 407
    <e3>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xc2>
    <e8>   DW_AT_data_member_location: 4
 <2><e9>: Abbrev Number: 3 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0xee4b7): CPAR
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 408
    <f1>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xc2>
    <f6>   DW_AT_data_member_location: 8
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x8866b): CMAR
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 409
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 12
 <2><105>: Abbrev Number: 0
 <1><106>: Abbrev Number: 15 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xe8827): DMA_Channel_TypeDef
    <10b>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 410
    <10e>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xc7>
 <1><112>: Abbrev Number: 17 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 8
    <114>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 412
    <116>   DW_AT_decl_column : 9
    <116>   DW_AT_sibling     : <0x135>
 <2><11a>: Abbrev Number: 6 (DW_TAG_member)
    <11b>   DW_AT_name        : ISR
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 414
    <121>   DW_AT_decl_column : 17
    <121>   DW_AT_type        : <0xc2>
    <125>   DW_AT_data_member_location: 0
 <2><126>: Abbrev Number: 3 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0xacb25): IFCR
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 415
    <12e>   DW_AT_decl_column : 17
    <12f>   DW_AT_type        : <0xc2>
    <133>   DW_AT_data_member_location: 4
 <2><134>: Abbrev Number: 0
 <1><135>: Abbrev Number: 15 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x5966c): DMA_TypeDef
    <13a>   DW_AT_decl_file   : 4
    <13b>   DW_AT_decl_line   : 416
    <13d>   DW_AT_decl_column : 3
    <13d>   DW_AT_type        : <0x112>
 <1><141>: Abbrev Number: 17 (DW_TAG_structure_type)
    <142>   DW_AT_byte_size   : 44
    <143>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 950
    <145>   DW_AT_decl_column : 9
    <145>   DW_AT_sibling     : <0x20a>
 <2><149>: Abbrev Number: 6 (DW_TAG_member)
    <14a>   DW_AT_name        : CR1
    <14e>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 952
    <150>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xc2>
    <154>   DW_AT_data_member_location: 0
 <2><155>: Abbrev Number: 6 (DW_TAG_member)
    <156>   DW_AT_name        : CR2
    <15a>   DW_AT_decl_file   : 4
    <15a>   DW_AT_decl_line   : 953
    <15c>   DW_AT_decl_column : 17
    <15c>   DW_AT_type        : <0xc2>
    <160>   DW_AT_data_member_location: 4
 <2><161>: Abbrev Number: 6 (DW_TAG_member)
    <162>   DW_AT_name        : CR3
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 954
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 6 (DW_TAG_member)
    <16e>   DW_AT_name        : BRR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 955
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xc2>
    <178>   DW_AT_data_member_location: 12
 <2><179>: Abbrev Number: 3 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x442cb): GTPR
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 956
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xb1>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 3 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xe86b2): RESERVED2
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 957
    <18f>   DW_AT_decl_column : 13
    <190>   DW_AT_type        : <0xa5>
    <194>   DW_AT_data_member_location: 18
 <2><195>: Abbrev Number: 3 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x91480): RTOR
    <19a>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 958
    <19d>   DW_AT_decl_column : 17
    <19e>   DW_AT_type        : <0xc2>
    <1a2>   DW_AT_data_member_location: 20
 <2><1a3>: Abbrev Number: 6 (DW_TAG_member)
    <1a4>   DW_AT_name        : RQR
    <1a8>   DW_AT_decl_file   : 4
    <1a8>   DW_AT_decl_line   : 959
    <1aa>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xb1>
    <1ae>   DW_AT_data_member_location: 24
 <2><1af>: Abbrev Number: 3 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xe86bc): RESERVED3
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 960
    <1b7>   DW_AT_decl_column : 13
    <1b8>   DW_AT_type        : <0xa5>
    <1bc>   DW_AT_data_member_location: 26
 <2><1bd>: Abbrev Number: 6 (DW_TAG_member)
    <1be>   DW_AT_name        : ISR
    <1c2>   DW_AT_decl_file   : 4
    <1c2>   DW_AT_decl_line   : 961
    <1c4>   DW_AT_decl_column : 17
    <1c4>   DW_AT_type        : <0xc2>
    <1c8>   DW_AT_data_member_location: 28
 <2><1c9>: Abbrev Number: 6 (DW_TAG_member)
    <1ca>   DW_AT_name        : ICR
    <1ce>   DW_AT_decl_file   : 4
    <1ce>   DW_AT_decl_line   : 962
    <1d0>   DW_AT_decl_column : 17
    <1d0>   DW_AT_type        : <0xc2>
    <1d4>   DW_AT_data_member_location: 32
 <2><1d5>: Abbrev Number: 6 (DW_TAG_member)
    <1d6>   DW_AT_name        : RDR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 963
    <1dc>   DW_AT_decl_column : 17
    <1dc>   DW_AT_type        : <0xb1>
    <1e0>   DW_AT_data_member_location: 36
 <2><1e1>: Abbrev Number: 3 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xdec6c): RESERVED4
    <1e6>   DW_AT_decl_file   : 4
    <1e7>   DW_AT_decl_line   : 964
    <1e9>   DW_AT_decl_column : 13
    <1ea>   DW_AT_type        : <0xa5>
    <1ee>   DW_AT_data_member_location: 38
 <2><1ef>: Abbrev Number: 6 (DW_TAG_member)
    <1f0>   DW_AT_name        : TDR
    <1f4>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 965
    <1f6>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xb1>
    <1fa>   DW_AT_data_member_location: 40
 <2><1fb>: Abbrev Number: 3 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0xe86ea): RESERVED5
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 966
    <203>   DW_AT_decl_column : 13
    <204>   DW_AT_type        : <0xa5>
    <208>   DW_AT_data_member_location: 42
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0xf4889): USART_TypeDef
    <20f>   DW_AT_decl_file   : 4
    <210>   DW_AT_decl_line   : 967
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x141>
 <1><216>: Abbrev Number: 2 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xa16b): size_t
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 214
    <21d>   DW_AT_decl_column : 23
    <21e>   DW_AT_type        : <0x8d>
 <1><222>: Abbrev Number: 5 (DW_TAG_base_type)
    <223>   DW_AT_byte_size   : 8
    <224>   DW_AT_encoding    : 4	(float)
    <225>   DW_AT_name        : (indirect string, offset: 0x1681e): long double
 <1><229>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <22a>   DW_AT_encoding    : 7	(unsigned)
    <22a>   DW_AT_byte_size   : 1
    <22a>   DW_AT_type        : <0x3d>
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 50
    <230>   DW_AT_decl_column : 1
    <231>   DW_AT_sibling     : <0x242>
 <2><235>: Abbrev Number: 8 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0xb5c28): HAL_UNLOCKED
    <23a>   DW_AT_const_value : 0
 <2><23b>: Abbrev Number: 8 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0xf6786): HAL_LOCKED
    <240>   DW_AT_const_value : 1
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 2 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x913fd): HAL_LockTypeDef
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 53
    <249>   DW_AT_decl_column : 3
    <24a>   DW_AT_type        : <0x229>
 <1><24e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <24f>   DW_AT_byte_size   : 32
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 46
    <252>   DW_AT_decl_column : 9
    <252>   DW_AT_sibling     : <0x2bf>
 <2><256>: Abbrev Number: 1 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0xdcc71): Request
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 48
    <25d>   DW_AT_decl_column : 12
    <25e>   DW_AT_type        : <0xb6>
    <262>   DW_AT_data_member_location: 0
 <2><263>: Abbrev Number: 1 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x5b04c): Direction
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 51
    <26a>   DW_AT_decl_column : 12
    <26b>   DW_AT_type        : <0xb6>
    <26f>   DW_AT_data_member_location: 4
 <2><270>: Abbrev Number: 1 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x107c6): PeriphInc
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 55
    <277>   DW_AT_decl_column : 12
    <278>   DW_AT_type        : <0xb6>
    <27c>   DW_AT_data_member_location: 8
 <2><27d>: Abbrev Number: 1 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x26612): MemInc
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 58
    <284>   DW_AT_decl_column : 12
    <285>   DW_AT_type        : <0xb6>
    <289>   DW_AT_data_member_location: 12
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x7b04f): PeriphDataAlignment
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 61
    <291>   DW_AT_decl_column : 12
    <292>   DW_AT_type        : <0xb6>
    <296>   DW_AT_data_member_location: 16
 <2><297>: Abbrev Number: 1 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xde7ec): MemDataAlignment
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 64
    <29e>   DW_AT_decl_column : 12
    <29f>   DW_AT_type        : <0xb6>
    <2a3>   DW_AT_data_member_location: 20
 <2><2a4>: Abbrev Number: 1 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xfc7bb): Mode
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 67
    <2ab>   DW_AT_decl_column : 12
    <2ac>   DW_AT_type        : <0xb6>
    <2b0>   DW_AT_data_member_location: 24
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xfc0fe): Priority
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 72
    <2b8>   DW_AT_decl_column : 12
    <2b9>   DW_AT_type        : <0xb6>
    <2bd>   DW_AT_data_member_location: 28
 <2><2be>: Abbrev Number: 0
 <1><2bf>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x42191): DMA_InitTypeDef
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 74
    <2c6>   DW_AT_decl_column : 3
    <2c7>   DW_AT_type        : <0x24e>
 <1><2cb>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2cc>   DW_AT_encoding    : 7	(unsigned)
    <2cc>   DW_AT_byte_size   : 1
    <2cc>   DW_AT_type        : <0x3d>
    <2d0>   DW_AT_decl_file   : 7
    <2d1>   DW_AT_decl_line   : 80
    <2d2>   DW_AT_decl_column : 1
    <2d3>   DW_AT_sibling     : <0x2f0>
 <2><2d7>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2d8>   DW_AT_name        : (indirect string, offset: 0xb73aa): HAL_DMA_STATE_RESET
    <2dc>   DW_AT_const_value : 0
 <2><2dd>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2de>   DW_AT_name        : (indirect string, offset: 0x437dc): HAL_DMA_STATE_READY
    <2e2>   DW_AT_const_value : 1
 <2><2e3>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0xaafee): HAL_DMA_STATE_BUSY
    <2e8>   DW_AT_const_value : 2
 <2><2e9>: Abbrev Number: 8 (DW_TAG_enumerator)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xf2b17): HAL_DMA_STATE_TIMEOUT
    <2ee>   DW_AT_const_value : 3
 <2><2ef>: Abbrev Number: 0
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x87e53): HAL_DMA_StateTypeDef
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 85
    <2f7>   DW_AT_decl_column : 3
    <2f8>   DW_AT_type        : <0x2cb>
 <1><2fc>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <2fd>   DW_AT_type        : <0x2f0>
 <1><301>: Abbrev Number: 21 (DW_TAG_structure_type)
    <302>   DW_AT_name        : (indirect string, offset: 0xd1c29): __DMA_HandleTypeDef
    <306>   DW_AT_byte_size   : 72
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 112
    <309>   DW_AT_decl_column : 16
    <309>   DW_AT_sibling     : <0x3aa>
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xc8f72): Instance
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 114
    <314>   DW_AT_decl_column : 27
    <315>   DW_AT_type        : <0x3aa>
    <319>   DW_AT_data_member_location: 0
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xfcf37): Init
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 116
    <321>   DW_AT_decl_column : 25
    <322>   DW_AT_type        : <0x2bf>
    <326>   DW_AT_data_member_location: 4
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0xaf8ec): Lock
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 118
    <32e>   DW_AT_decl_column : 25
    <32f>   DW_AT_type        : <0x242>
    <333>   DW_AT_data_member_location: 36
 <2><334>: Abbrev Number: 1 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xfe513): State
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 120
    <33b>   DW_AT_decl_column : 30
    <33c>   DW_AT_type        : <0x2fc>
    <340>   DW_AT_data_member_location: 37
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x4d093): Parent
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 122
    <348>   DW_AT_decl_column : 26
    <349>   DW_AT_type        : <0x3af>
    <34d>   DW_AT_data_member_location: 40
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xf5744): XferCpltCallback
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 124
    <355>   DW_AT_decl_column : 11
    <356>   DW_AT_type        : <0x3c1>
    <35a>   DW_AT_data_member_location: 44
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0xbf3ec): XferHalfCpltCallback
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 126
    <362>   DW_AT_decl_column : 11
    <363>   DW_AT_type        : <0x3c1>
    <367>   DW_AT_data_member_location: 48
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x2308d): XferErrorCallback
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 128
    <36f>   DW_AT_decl_column : 11
    <370>   DW_AT_type        : <0x3c1>
    <374>   DW_AT_data_member_location: 52
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0xe623a): XferAbortCallback
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 130
    <37c>   DW_AT_decl_column : 11
    <37d>   DW_AT_type        : <0x3c1>
    <381>   DW_AT_data_member_location: 56
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf1181): ErrorCode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 132
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0xc2>
    <38e>   DW_AT_data_member_location: 60
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x63869): DmaBaseAddress
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 134
    <396>   DW_AT_decl_column : 26
    <397>   DW_AT_type        : <0x3c6>
    <39b>   DW_AT_data_member_location: 64
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x32d9c): ChannelIndex
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 136
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0xb6>
    <3a8>   DW_AT_data_member_location: 68
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3ab>   DW_AT_byte_size   : 4
    <3ab>   DW_AT_type        : <0x106>
 <1><3af>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
 <1><3b1>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <3b2>   DW_AT_prototyped  : 1
    <3b2>   DW_AT_sibling     : <0x3bc>
 <2><3b6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <3b7>   DW_AT_type        : <0x3bc>
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x301>
 <1><3c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c2>   DW_AT_type        : <0x3b1>
 <1><3c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x135>
 <1><3cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xd1c2b): DMA_HandleTypeDef
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 153
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x301>
 <1><3d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_type        : <0x94>
 <1><3dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3dd>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3cb>
 <1><3e1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <3e2>   DW_AT_byte_size   : 32
    <3e3>   DW_AT_decl_file   : 8
    <3e4>   DW_AT_decl_line   : 46
    <3e5>   DW_AT_decl_column : 9
    <3e5>   DW_AT_sibling     : <0x452>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xe163b): BaudRate
    <3ee>   DW_AT_decl_file   : 8
    <3ef>   DW_AT_decl_line   : 48
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xb6>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x6c53): WordLength
    <3fb>   DW_AT_decl_file   : 8
    <3fc>   DW_AT_decl_line   : 68
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xb6>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xe19b3): StopBits
    <408>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 71
    <40a>   DW_AT_decl_column : 12
    <40b>   DW_AT_type        : <0xb6>
    <40f>   DW_AT_data_member_location: 8
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x46238): Parity
    <415>   DW_AT_decl_file   : 8
    <416>   DW_AT_decl_line   : 74
    <417>   DW_AT_decl_column : 12
    <418>   DW_AT_type        : <0xb6>
    <41c>   DW_AT_data_member_location: 12
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xfc7bb): Mode
    <422>   DW_AT_decl_file   : 8
    <423>   DW_AT_decl_line   : 81
    <424>   DW_AT_decl_column : 12
    <425>   DW_AT_type        : <0xb6>
    <429>   DW_AT_data_member_location: 16
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x84820): HwFlowCtl
    <42f>   DW_AT_decl_file   : 8
    <430>   DW_AT_decl_line   : 84
    <431>   DW_AT_decl_column : 12
    <432>   DW_AT_type        : <0xb6>
    <436>   DW_AT_data_member_location: 20
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xcebab): OverSampling
    <43c>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 88
    <43e>   DW_AT_decl_column : 12
    <43f>   DW_AT_type        : <0xb6>
    <443>   DW_AT_data_member_location: 24
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x31c4e): OneBitSampling
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 92
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb6>
    <450>   DW_AT_data_member_location: 28
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 2 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x44efc): UART_InitTypeDef
    <457>   DW_AT_decl_file   : 8
    <458>   DW_AT_decl_line   : 101
    <459>   DW_AT_decl_column : 3
    <45a>   DW_AT_type        : <0x3e1>
 <1><45e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <45f>   DW_AT_byte_size   : 40
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 106
    <462>   DW_AT_decl_column : 9
    <462>   DW_AT_sibling     : <0x4e9>
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x2faf5): AdvFeatureInit
    <46b>   DW_AT_decl_file   : 8
    <46c>   DW_AT_decl_line   : 108
    <46d>   DW_AT_decl_column : 12
    <46e>   DW_AT_type        : <0xb6>
    <472>   DW_AT_data_member_location: 0
 <2><473>: Abbrev Number: 1 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0xe5a67): TxPinLevelInvert
    <478>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 113
    <47a>   DW_AT_decl_column : 12
    <47b>   DW_AT_type        : <0xb6>
    <47f>   DW_AT_data_member_location: 4
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xcefd0): RxPinLevelInvert
    <485>   DW_AT_decl_file   : 8
    <486>   DW_AT_decl_line   : 116
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0xb6>
    <48c>   DW_AT_data_member_location: 8
 <2><48d>: Abbrev Number: 1 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0xa6874): DataInvert
    <492>   DW_AT_decl_file   : 8
    <493>   DW_AT_decl_line   : 119
    <494>   DW_AT_decl_column : 12
    <495>   DW_AT_type        : <0xb6>
    <499>   DW_AT_data_member_location: 12
 <2><49a>: Abbrev Number: 1 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x4dd86): Swap
    <49f>   DW_AT_decl_file   : 8
    <4a0>   DW_AT_decl_line   : 123
    <4a1>   DW_AT_decl_column : 12
    <4a2>   DW_AT_type        : <0xb6>
    <4a6>   DW_AT_data_member_location: 16
 <2><4a7>: Abbrev Number: 1 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xbeb39): OverrunDisable
    <4ac>   DW_AT_decl_file   : 8
    <4ad>   DW_AT_decl_line   : 126
    <4ae>   DW_AT_decl_column : 12
    <4af>   DW_AT_type        : <0xb6>
    <4b3>   DW_AT_data_member_location: 20
 <2><4b4>: Abbrev Number: 1 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x84de): DMADisableonRxError
    <4b9>   DW_AT_decl_file   : 8
    <4ba>   DW_AT_decl_line   : 129
    <4bb>   DW_AT_decl_column : 12
    <4bc>   DW_AT_type        : <0xb6>
    <4c0>   DW_AT_data_member_location: 24
 <2><4c1>: Abbrev Number: 1 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xf0b76): AutoBaudRateEnable
    <4c6>   DW_AT_decl_file   : 8
    <4c7>   DW_AT_decl_line   : 132
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xb6>
    <4cd>   DW_AT_data_member_location: 28
 <2><4ce>: Abbrev Number: 1 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xd1429): AutoBaudRateMode
    <4d3>   DW_AT_decl_file   : 8
    <4d4>   DW_AT_decl_line   : 135
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xb6>
    <4da>   DW_AT_data_member_location: 32
 <2><4db>: Abbrev Number: 1 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x6cd75): MSBFirst
    <4e0>   DW_AT_decl_file   : 8
    <4e1>   DW_AT_decl_line   : 139
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xb6>
    <4e7>   DW_AT_data_member_location: 36
 <2><4e8>: Abbrev Number: 0
 <1><4e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ea>   DW_AT_name        : (indirect string, offset: 0xb7149): UART_AdvFeatureInitTypeDef
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 141
    <4f0>   DW_AT_decl_column : 3
    <4f1>   DW_AT_type        : <0x45e>
 <1><4f5>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x4ab67): HAL_UART_StateTypeDef
    <4fa>   DW_AT_decl_file   : 8
    <4fb>   DW_AT_decl_line   : 183
    <4fc>   DW_AT_decl_column : 18
    <4fd>   DW_AT_type        : <0xb6>
 <1><501>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <502>   DW_AT_type        : <0x4f5>
 <1><506>: Abbrev Number: 2 (DW_TAG_typedef)
    <507>   DW_AT_name        : (indirect string, offset: 0x6485b): HAL_UART_RxTypeTypeDef
    <50b>   DW_AT_decl_file   : 8
    <50c>   DW_AT_decl_line   : 207
    <50d>   DW_AT_decl_column : 18
    <50e>   DW_AT_type        : <0xb6>
 <1><512>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <513>   DW_AT_type        : <0x506>
 <1><517>: Abbrev Number: 2 (DW_TAG_typedef)
    <518>   DW_AT_name        : (indirect string, offset: 0x1e88a): HAL_UART_RxEventTypeTypeDef
    <51c>   DW_AT_decl_file   : 8
    <51d>   DW_AT_decl_line   : 218
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0xb6>
 <1><523>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <524>   DW_AT_type        : <0x517>
 <1><528>: Abbrev Number: 21 (DW_TAG_structure_type)
    <529>   DW_AT_name        : (indirect string, offset: 0x8eca1): __UART_HandleTypeDef
    <52d>   DW_AT_byte_size   : 136
    <52e>   DW_AT_decl_file   : 8
    <52f>   DW_AT_decl_line   : 223
    <530>   DW_AT_decl_column : 16
    <530>   DW_AT_sibling     : <0x642>
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0xc8f72): Instance
    <539>   DW_AT_decl_file   : 8
    <53a>   DW_AT_decl_line   : 225
    <53b>   DW_AT_decl_column : 29
    <53c>   DW_AT_type        : <0x642>
    <540>   DW_AT_data_member_location: 0
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0xfcf37): Init
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 227
    <548>   DW_AT_decl_column : 28
    <549>   DW_AT_type        : <0x452>
    <54d>   DW_AT_data_member_location: 4
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0xd8096): AdvancedInit
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 229
    <555>   DW_AT_decl_column : 30
    <556>   DW_AT_type        : <0x4e9>
    <55a>   DW_AT_data_member_location: 36
 <2><55b>: Abbrev Number: 1 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x7602b): pTxBuffPtr
    <560>   DW_AT_decl_file   : 8
    <561>   DW_AT_decl_line   : 231
    <562>   DW_AT_decl_column : 29
    <563>   DW_AT_type        : <0x647>
    <567>   DW_AT_data_member_location: 76
 <2><568>: Abbrev Number: 1 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x679d2): TxXferSize
    <56d>   DW_AT_decl_file   : 8
    <56e>   DW_AT_decl_line   : 233
    <56f>   DW_AT_decl_column : 28
    <570>   DW_AT_type        : <0xa5>
    <574>   DW_AT_data_member_location: 80
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xfd478): TxXferCount
    <57a>   DW_AT_decl_file   : 8
    <57b>   DW_AT_decl_line   : 235
    <57c>   DW_AT_decl_column : 28
    <57d>   DW_AT_type        : <0xb1>
    <581>   DW_AT_data_member_location: 82
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xe5028): pRxBuffPtr
    <587>   DW_AT_decl_file   : 8
    <588>   DW_AT_decl_line   : 237
    <589>   DW_AT_decl_column : 29
    <58a>   DW_AT_type        : <0x3d7>
    <58e>   DW_AT_data_member_location: 84
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x7b0ce): RxXferSize
    <594>   DW_AT_decl_file   : 8
    <595>   DW_AT_decl_line   : 239
    <596>   DW_AT_decl_column : 28
    <597>   DW_AT_type        : <0xa5>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 1 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xfcf44): RxXferCount
    <5a1>   DW_AT_decl_file   : 8
    <5a2>   DW_AT_decl_line   : 241
    <5a3>   DW_AT_decl_column : 28
    <5a4>   DW_AT_type        : <0xb1>
    <5a8>   DW_AT_data_member_location: 90
 <2><5a9>: Abbrev Number: 1 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xfea29): Mask
    <5ae>   DW_AT_decl_file   : 8
    <5af>   DW_AT_decl_line   : 243
    <5b0>   DW_AT_decl_column : 28
    <5b1>   DW_AT_type        : <0xa5>
    <5b5>   DW_AT_data_member_location: 92
 <2><5b6>: Abbrev Number: 1 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xcdb46): ReceptionType
    <5bb>   DW_AT_decl_file   : 8
    <5bc>   DW_AT_decl_line   : 254
    <5bd>   DW_AT_decl_column : 31
    <5be>   DW_AT_type        : <0x512>
    <5c2>   DW_AT_data_member_location: 96
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x1229a): RxEventType
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 256
    <5cb>   DW_AT_decl_column : 36
    <5cc>   DW_AT_type        : <0x523>
    <5d0>   DW_AT_data_member_location: 100
 <2><5d1>: Abbrev Number: 3 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xd46f0): RxISR
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 258
    <5d9>   DW_AT_decl_column : 10
    <5da>   DW_AT_type        : <0x65c>
    <5de>   DW_AT_data_member_location: 104
 <2><5df>: Abbrev Number: 3 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x7bfc6): TxISR
    <5e4>   DW_AT_decl_file   : 8
    <5e5>   DW_AT_decl_line   : 260
    <5e7>   DW_AT_decl_column : 10
    <5e8>   DW_AT_type        : <0x65c>
    <5ec>   DW_AT_data_member_location: 108
 <2><5ed>: Abbrev Number: 3 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xca2c9): hdmatx
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 262
    <5f5>   DW_AT_decl_column : 29
    <5f6>   DW_AT_type        : <0x3dc>
    <5fa>   DW_AT_data_member_location: 112
 <2><5fb>: Abbrev Number: 3 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xef4d1): hdmarx
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 264
    <603>   DW_AT_decl_column : 29
    <604>   DW_AT_type        : <0x3dc>
    <608>   DW_AT_data_member_location: 116
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xaf8ec): Lock
    <60e>   DW_AT_decl_file   : 8
    <60f>   DW_AT_decl_line   : 266
    <611>   DW_AT_decl_column : 29
    <612>   DW_AT_type        : <0x242>
    <616>   DW_AT_data_member_location: 120
 <2><617>: Abbrev Number: 3 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x63c00): gState
    <61c>   DW_AT_decl_file   : 8
    <61d>   DW_AT_decl_line   : 268
    <61f>   DW_AT_decl_column : 33
    <620>   DW_AT_type        : <0x501>
    <624>   DW_AT_data_member_location: 124
 <2><625>: Abbrev Number: 3 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xddc97): RxState
    <62a>   DW_AT_decl_file   : 8
    <62b>   DW_AT_decl_line   : 272
    <62d>   DW_AT_decl_column : 33
    <62e>   DW_AT_type        : <0x501>
    <632>   DW_AT_data_member_location: 128
 <2><633>: Abbrev Number: 3 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xf1181): ErrorCode
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 275
    <63b>   DW_AT_decl_column : 33
    <63c>   DW_AT_type        : <0xc2>
    <640>   DW_AT_data_member_location: 132
 <2><641>: Abbrev Number: 0
 <1><642>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <643>   DW_AT_byte_size   : 4
    <643>   DW_AT_type        : <0x20a>
 <1><647>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <648>   DW_AT_type        : <0xa0>
 <1><64c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <64d>   DW_AT_prototyped  : 1
    <64d>   DW_AT_sibling     : <0x657>
 <2><651>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <652>   DW_AT_type        : <0x657>
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <658>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x528>
 <1><65c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <65d>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x64c>
 <1><661>: Abbrev Number: 15 (DW_TAG_typedef)
    <662>   DW_AT_name        : (indirect string, offset: 0x8eca3): UART_HandleTypeDef
    <666>   DW_AT_decl_file   : 8
    <667>   DW_AT_decl_line   : 297
    <669>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x528>
 <1><66d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <66e>   DW_AT_byte_size   : 4
    <66e>   DW_AT_type        : <0x672>
 <1><672>: Abbrev Number: 5 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 1
    <674>   DW_AT_encoding    : 8	(unsigned char)
    <675>   DW_AT_name        : (indirect string, offset: 0x4f451): char
 <1><679>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <67a>   DW_AT_byte_size   : 4
    <67a>   DW_AT_type        : <0x67e>
 <1><67e>: Abbrev Number: 31 (DW_TAG_const_type)
 <1><67f>: Abbrev Number: 12 (DW_TAG_array_type)
    <680>   DW_AT_type        : <0x94>
    <684>   DW_AT_sibling     : <0x68f>
 <2><688>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <689>   DW_AT_type        : <0x8d>
    <68d>   DW_AT_upper_bound : 131
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 7 (DW_TAG_variable)
    <690>   DW_AT_name        : (indirect string, offset: 0xe2e6): commandSetGNSS_Config
    <694>   DW_AT_decl_file   : 9
    <695>   DW_AT_decl_line   : 30
    <696>   DW_AT_decl_column : 16
    <697>   DW_AT_type        : <0x67f>
    <69b>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6a1>: Abbrev Number: 12 (DW_TAG_array_type)
    <6a2>   DW_AT_type        : <0x94>
    <6a6>   DW_AT_sibling     : <0x6b1>
 <2><6aa>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6ab>   DW_AT_type        : <0x8d>
    <6af>   DW_AT_upper_bound : 26
 <2><6b0>: Abbrev Number: 0
 <1><6b1>: Abbrev Number: 7 (DW_TAG_variable)
    <6b2>   DW_AT_name        : (indirect string, offset: 0xe4f34): commandUart1Ouput
    <6b6>   DW_AT_decl_file   : 9
    <6b7>   DW_AT_decl_line   : 48
    <6b8>   DW_AT_decl_column : 16
    <6b9>   DW_AT_type        : <0x6a1>
    <6bd>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6c3>: Abbrev Number: 12 (DW_TAG_array_type)
    <6c4>   DW_AT_type        : <0x94>
    <6c8>   DW_AT_sibling     : <0x6d3>
 <2><6cc>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6cd>   DW_AT_type        : <0x8d>
    <6d1>   DW_AT_upper_bound : 10
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 7 (DW_TAG_variable)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x6ea40): commandUBXTimeUTC
    <6d8>   DW_AT_decl_file   : 9
    <6d9>   DW_AT_decl_line   : 57
    <6da>   DW_AT_decl_column : 16
    <6db>   DW_AT_type        : <0x6c3>
    <6df>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6e5>: Abbrev Number: 12 (DW_TAG_array_type)
    <6e6>   DW_AT_type        : <0x94>
    <6ea>   DW_AT_sibling     : <0x6f5>
 <2><6ee>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <6ef>   DW_AT_type        : <0x8d>
    <6f3>   DW_AT_upper_bound : 7
 <2><6f4>: Abbrev Number: 0
 <1><6f5>: Abbrev Number: 7 (DW_TAG_variable)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xa512f): pollUBXTimeUTC
    <6fa>   DW_AT_decl_file   : 9
    <6fb>   DW_AT_decl_line   : 60
    <6fc>   DW_AT_decl_column : 16
    <6fd>   DW_AT_type        : <0x6e5>
    <701>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><707>: Abbrev Number: 12 (DW_TAG_array_type)
    <708>   DW_AT_type        : <0x94>
    <70c>   DW_AT_sibling     : <0x717>
 <2><710>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <711>   DW_AT_type        : <0x8d>
    <715>   DW_AT_upper_bound : 92
 <2><716>: Abbrev Number: 0
 <1><717>: Abbrev Number: 7 (DW_TAG_variable)
    <718>   DW_AT_name        : (indirect string, offset: 0xbbb2e): commandSetTP1_atNVTRate
    <71c>   DW_AT_decl_file   : 9
    <71d>   DW_AT_decl_line   : 79
    <71e>   DW_AT_decl_column : 16
    <71f>   DW_AT_type        : <0x707>
    <723>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><729>: Abbrev Number: 12 (DW_TAG_array_type)
    <72a>   DW_AT_type        : <0x94>
    <72e>   DW_AT_sibling     : <0x739>
 <2><732>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <733>   DW_AT_type        : <0x8d>
    <737>   DW_AT_upper_bound : 100
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 7 (DW_TAG_variable)
    <73a>   DW_AT_name        : (indirect string, offset: 0xcfa83): commandSetTP2
    <73e>   DW_AT_decl_file   : 9
    <73f>   DW_AT_decl_line   : 105
    <740>   DW_AT_decl_column : 16
    <741>   DW_AT_type        : <0x729>
    <745>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><74b>: Abbrev Number: 12 (DW_TAG_array_type)
    <74c>   DW_AT_type        : <0x94>
    <750>   DW_AT_sibling     : <0x75b>
 <2><754>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <755>   DW_AT_type        : <0x8d>
    <759>   DW_AT_upper_bound : 28
 <2><75a>: Abbrev Number: 0
 <1><75b>: Abbrev Number: 7 (DW_TAG_variable)
    <75c>   DW_AT_name        : (indirect string, offset: 0xdfc9e): commandMeasureRate
    <760>   DW_AT_decl_file   : 9
    <761>   DW_AT_decl_line   : 122
    <762>   DW_AT_decl_column : 16
    <763>   DW_AT_type        : <0x74b>
    <767>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><76d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <76e>   DW_AT_encoding    : 7	(unsigned)
    <76e>   DW_AT_byte_size   : 1
    <76e>   DW_AT_type        : <0x3d>
    <772>   DW_AT_decl_file   : 10
    <773>   DW_AT_decl_line   : 27
    <774>   DW_AT_decl_column : 14
    <775>   DW_AT_sibling     : <0x78c>
 <2><779>: Abbrev Number: 8 (DW_TAG_enumerator)
    <77a>   DW_AT_name        : (indirect string, offset: 0xc7846): INIT
    <77e>   DW_AT_const_value : 0
 <2><77f>: Abbrev Number: 8 (DW_TAG_enumerator)
    <780>   DW_AT_name        : (indirect string, offset: 0x8fd20): NMEA
    <784>   DW_AT_const_value : 1
 <2><785>: Abbrev Number: 18 (DW_TAG_enumerator)
    <786>   DW_AT_name        : UBX
    <78a>   DW_AT_const_value : 2
 <2><78b>: Abbrev Number: 0
 <1><78c>: Abbrev Number: 2 (DW_TAG_typedef)
    <78d>   DW_AT_name        : (indirect string, offset: 0xd7814): OutputProtocol
    <791>   DW_AT_decl_file   : 10
    <792>   DW_AT_decl_line   : 31
    <793>   DW_AT_decl_column : 3
    <794>   DW_AT_type        : <0x76d>
 <1><798>: Abbrev Number: 11 (DW_TAG_structure_type)
    <799>   DW_AT_byte_size   : 8
    <79a>   DW_AT_decl_file   : 10
    <79b>   DW_AT_decl_line   : 32
    <79c>   DW_AT_decl_column : 9
    <79c>   DW_AT_sibling     : <0x7bb>
 <2><7a0>: Abbrev Number: 1 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x255af): buffer
    <7a5>   DW_AT_decl_file   : 10
    <7a6>   DW_AT_decl_line   : 33
    <7a7>   DW_AT_decl_column : 11
    <7a8>   DW_AT_type        : <0x3d7>
    <7ac>   DW_AT_data_member_location: 0
 <2><7ad>: Abbrev Number: 1 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0xfa4d1): size
    <7b2>   DW_AT_decl_file   : 10
    <7b3>   DW_AT_decl_line   : 34
    <7b4>   DW_AT_decl_column : 9
    <7b5>   DW_AT_type        : <0x216>
    <7b9>   DW_AT_data_member_location: 4
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x80d16): DynamicBuffer
    <7c0>   DW_AT_decl_file   : 10
    <7c1>   DW_AT_decl_line   : 35
    <7c2>   DW_AT_decl_column : 3
    <7c3>   DW_AT_type        : <0x798>
 <1><7c7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <7c8>   DW_AT_byte_size   : 8
    <7c9>   DW_AT_decl_file   : 10
    <7ca>   DW_AT_decl_line   : 37
    <7cb>   DW_AT_decl_column : 9
    <7cb>   DW_AT_sibling     : <0x803>
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xd7055): CLASS
    <7d4>   DW_AT_decl_file   : 10
    <7d5>   DW_AT_decl_line   : 38
    <7d6>   DW_AT_decl_column : 10
    <7d7>   DW_AT_type        : <0x94>
    <7db>   DW_AT_data_member_location: 0
 <2><7dc>: Abbrev Number: 23 (DW_TAG_member)
    <7dd>   DW_AT_name        : ID
    <7e0>   DW_AT_decl_file   : 10
    <7e1>   DW_AT_decl_line   : 39
    <7e2>   DW_AT_decl_column : 10
    <7e3>   DW_AT_type        : <0x94>
    <7e7>   DW_AT_data_member_location: 1
 <2><7e8>: Abbrev Number: 1 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x14b1): len_payload
    <7ed>   DW_AT_decl_file   : 10
    <7ee>   DW_AT_decl_line   : 40
    <7ef>   DW_AT_decl_column : 11
    <7f0>   DW_AT_type        : <0xa5>
    <7f4>   DW_AT_data_member_location: 2
 <2><7f5>: Abbrev Number: 1 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0xf2356): brute
    <7fa>   DW_AT_decl_file   : 10
    <7fb>   DW_AT_decl_line   : 41
    <7fc>   DW_AT_decl_column : 17
    <7fd>   DW_AT_type        : <0x803>
    <801>   DW_AT_data_member_location: 4
 <2><802>: Abbrev Number: 0
 <1><803>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <804>   DW_AT_byte_size   : 4
    <804>   DW_AT_type        : <0x7bb>
 <1><808>: Abbrev Number: 2 (DW_TAG_typedef)
    <809>   DW_AT_name        : (indirect string, offset: 0x6703d): UBXMessage_parsed
    <80d>   DW_AT_decl_file   : 10
    <80e>   DW_AT_decl_line   : 42
    <80f>   DW_AT_decl_column : 2
    <810>   DW_AT_type        : <0x7c7>
 <1><814>: Abbrev Number: 11 (DW_TAG_structure_type)
    <815>   DW_AT_byte_size   : 4
    <816>   DW_AT_decl_file   : 10
    <817>   DW_AT_decl_line   : 44
    <818>   DW_AT_decl_column : 9
    <818>   DW_AT_sibling     : <0x82a>
 <2><81c>: Abbrev Number: 1 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x75944): NMEA_Brute
    <821>   DW_AT_decl_file   : 10
    <822>   DW_AT_decl_line   : 45
    <823>   DW_AT_decl_column : 8
    <824>   DW_AT_type        : <0x66d>
    <828>   DW_AT_data_member_location: 0
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 2 (DW_TAG_typedef)
    <82b>   DW_AT_name        : (indirect string, offset: 0x75623): NMEAMessage_parsed
    <82f>   DW_AT_decl_file   : 10
    <830>   DW_AT_decl_line   : 46
    <831>   DW_AT_decl_column : 2
    <832>   DW_AT_type        : <0x814>
 <1><836>: Abbrev Number: 32 (DW_TAG_union_type)
    <837>   DW_AT_byte_size   : 4
    <838>   DW_AT_decl_file   : 10
    <839>   DW_AT_decl_line   : 48
    <83a>   DW_AT_decl_column : 9
    <83b>   DW_AT_sibling     : <0x856>
 <2><83f>: Abbrev Number: 24 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x4f1da): NMEAMessage
    <844>   DW_AT_decl_file   : 10
    <844>   DW_AT_decl_line   : 49
    <845>   DW_AT_decl_column : 22
    <846>   DW_AT_type        : <0x856>
 <2><84a>: Abbrev Number: 24 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x1799c): UBXMessage
    <84f>   DW_AT_decl_file   : 10
    <84f>   DW_AT_decl_line   : 50
    <850>   DW_AT_decl_column : 21
    <851>   DW_AT_type        : <0x85b>
 <2><855>: Abbrev Number: 0
 <1><856>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <857>   DW_AT_byte_size   : 4
    <857>   DW_AT_type        : <0x82a>
 <1><85b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <85c>   DW_AT_byte_size   : 4
    <85c>   DW_AT_type        : <0x808>
 <1><860>: Abbrev Number: 2 (DW_TAG_typedef)
    <861>   DW_AT_name        : (indirect string, offset: 0x7ec0f): MessageStruct
    <865>   DW_AT_decl_file   : 10
    <866>   DW_AT_decl_line   : 51
    <867>   DW_AT_decl_column : 2
    <868>   DW_AT_type        : <0x836>
 <1><86c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <86d>   DW_AT_byte_size   : 8
    <86e>   DW_AT_decl_file   : 10
    <86f>   DW_AT_decl_line   : 53
    <870>   DW_AT_decl_column : 9
    <870>   DW_AT_sibling     : <0x88f>
 <2><874>: Abbrev Number: 1 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x21cf6): typeMessage
    <879>   DW_AT_decl_file   : 10
    <87a>   DW_AT_decl_line   : 54
    <87b>   DW_AT_decl_column : 17
    <87c>   DW_AT_type        : <0x78c>
    <880>   DW_AT_data_member_location: 0
 <2><881>: Abbrev Number: 1 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0x4f1de): Message
    <886>   DW_AT_decl_file   : 10
    <887>   DW_AT_decl_line   : 55
    <888>   DW_AT_decl_column : 16
    <889>   DW_AT_type        : <0x860>
    <88d>   DW_AT_data_member_location: 4
 <2><88e>: Abbrev Number: 0
 <1><88f>: Abbrev Number: 2 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0x65ceb): GenericMessage
    <894>   DW_AT_decl_file   : 10
    <895>   DW_AT_decl_line   : 56
    <896>   DW_AT_decl_column : 2
    <897>   DW_AT_type        : <0x86c>
 <1><89b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <89c>   DW_AT_encoding    : 7	(unsigned)
    <89c>   DW_AT_byte_size   : 1
    <89c>   DW_AT_type        : <0x3d>
    <8a0>   DW_AT_decl_file   : 11
    <8a1>   DW_AT_decl_line   : 25
    <8a2>   DW_AT_decl_column : 14
    <8a3>   DW_AT_sibling     : <0x8ba>
 <2><8a7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : RAW
    <8ac>   DW_AT_const_value : 0
 <2><8ad>: Abbrev Number: 18 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : HEX
    <8b2>   DW_AT_const_value : 1
 <2><8b3>: Abbrev Number: 8 (DW_TAG_enumerator)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xbde61): ASCII
    <8b8>   DW_AT_const_value : 2
 <2><8b9>: Abbrev Number: 0
 <1><8ba>: Abbrev Number: 2 (DW_TAG_typedef)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xe2063): OutputType
    <8bf>   DW_AT_decl_file   : 11
    <8c0>   DW_AT_decl_line   : 29
    <8c1>   DW_AT_decl_column : 3
    <8c2>   DW_AT_type        : <0x89b>
 <1><8c6>: Abbrev Number: 25 (DW_TAG_variable)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xff90b): type
    <8cb>   DW_AT_decl_file   : 11
    <8cb>   DW_AT_decl_line   : 30
    <8cc>   DW_AT_decl_column : 19
    <8cd>   DW_AT_type        : <0x8ba>
    <8d1>   DW_AT_external    : 1
    <8d1>   DW_AT_declaration : 1
 <1><8d1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <8d2>   DW_AT_byte_size   : 12
    <8d3>   DW_AT_decl_file   : 11
    <8d4>   DW_AT_decl_line   : 32
    <8d5>   DW_AT_decl_column : 9
    <8d5>   DW_AT_sibling     : <0x900>
 <2><8d9>: Abbrev Number: 1 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0xae804): huart
    <8de>   DW_AT_decl_file   : 11
    <8df>   DW_AT_decl_line   : 33
    <8e0>   DW_AT_decl_column : 22
    <8e1>   DW_AT_type        : <0x900>
    <8e5>   DW_AT_data_member_location: 0
 <2><8e6>: Abbrev Number: 1 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x8b65d): huartDebug
    <8eb>   DW_AT_decl_file   : 11
    <8ec>   DW_AT_decl_line   : 34
    <8ed>   DW_AT_decl_column : 22
    <8ee>   DW_AT_type        : <0x900>
    <8f2>   DW_AT_data_member_location: 4
 <2><8f3>: Abbrev Number: 23 (DW_TAG_member)
    <8f4>   DW_AT_name        : Rx
    <8f7>   DW_AT_decl_file   : 11
    <8f8>   DW_AT_decl_line   : 35
    <8f9>   DW_AT_decl_column : 17
    <8fa>   DW_AT_type        : <0x803>
    <8fe>   DW_AT_data_member_location: 8
 <2><8ff>: Abbrev Number: 0
 <1><900>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <901>   DW_AT_byte_size   : 4
    <901>   DW_AT_type        : <0x661>
 <1><905>: Abbrev Number: 2 (DW_TAG_typedef)
    <906>   DW_AT_name        : (indirect string, offset: 0x3e682): GNSSCom_HandleTypeDef
    <90a>   DW_AT_decl_file   : 11
    <90b>   DW_AT_decl_line   : 36
    <90c>   DW_AT_decl_column : 3
    <90d>   DW_AT_type        : <0x8d1>
 <1><911>: Abbrev Number: 25 (DW_TAG_variable)
    <912>   DW_AT_name        : (indirect string, offset: 0x41574): hGNSSCom
    <916>   DW_AT_decl_file   : 11
    <916>   DW_AT_decl_line   : 37
    <917>   DW_AT_decl_column : 30
    <918>   DW_AT_type        : <0x905>
    <91c>   DW_AT_external    : 1
    <91c>   DW_AT_declaration : 1
 <1><91c>: Abbrev Number: 5 (DW_TAG_base_type)
    <91d>   DW_AT_byte_size   : 1
    <91e>   DW_AT_encoding    : 2	(boolean)
    <91f>   DW_AT_name        : (indirect string, offset: 0x6ffdb): _Bool
 <1><923>: Abbrev Number: 26 (DW_TAG_variable)
    <924>   DW_AT_specification: <0x911>
    <928>   DW_AT_decl_file   : 1
    <928>   DW_AT_decl_line   : 14
    <929>   DW_AT_decl_column : 23
    <92a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><930>: Abbrev Number: 26 (DW_TAG_variable)
    <931>   DW_AT_specification: <0x8c6>
    <935>   DW_AT_decl_file   : 1
    <935>   DW_AT_decl_line   : 15
    <936>   DW_AT_decl_column : 12
    <937>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><93d>: Abbrev Number: 33 (DW_TAG_variable)
    <93e>   DW_AT_name        : (indirect string, offset: 0x3b4b5): protocol
    <942>   DW_AT_decl_file   : 1
    <943>   DW_AT_decl_line   : 16
    <944>   DW_AT_decl_column : 16
    <945>   DW_AT_type        : <0x78c>
    <949>   DW_AT_external    : 1
    <949>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><94f>: Abbrev Number: 19 (DW_TAG_subprogram)
    <950>   DW_AT_external    : 1
    <950>   DW_AT_name        : (indirect string, offset: 0xbfb49): memcpy
    <954>   DW_AT_decl_file   : 12
    <955>   DW_AT_decl_line   : 31
    <956>   DW_AT_decl_column : 9
    <957>   DW_AT_prototyped  : 1
    <957>   DW_AT_type        : <0x3af>
    <95b>   DW_AT_declaration : 1
    <95b>   DW_AT_sibling     : <0x96f>
 <2><95f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <960>   DW_AT_type        : <0x3af>
 <2><964>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <965>   DW_AT_type        : <0x679>
 <2><969>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <96a>   DW_AT_type        : <0x216>
 <2><96e>: Abbrev Number: 0
 <1><96f>: Abbrev Number: 34 (DW_TAG_subprogram)
    <970>   DW_AT_external    : 1
    <970>   DW_AT_name        : (indirect string, offset: 0x5bb1d): updateMemoryUsage
    <974>   DW_AT_decl_file   : 15
    <975>   DW_AT_decl_line   : 31
    <976>   DW_AT_decl_column : 6
    <977>   DW_AT_prototyped  : 1
    <977>   DW_AT_declaration : 1
 <1><977>: Abbrev Number: 19 (DW_TAG_subprogram)
    <978>   DW_AT_external    : 1
    <978>   DW_AT_name        : (indirect string, offset: 0x697aa): realloc
    <97c>   DW_AT_decl_file   : 13
    <97d>   DW_AT_decl_line   : 145
    <97e>   DW_AT_decl_column : 7
    <97f>   DW_AT_prototyped  : 1
    <97f>   DW_AT_type        : <0x3af>
    <983>   DW_AT_declaration : 1
    <983>   DW_AT_sibling     : <0x992>
 <2><987>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <988>   DW_AT_type        : <0x3af>
 <2><98c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <98d>   DW_AT_type        : <0x216>
 <2><991>: Abbrev Number: 0
 <1><992>: Abbrev Number: 35 (DW_TAG_subprogram)
    <993>   DW_AT_external    : 1
    <993>   DW_AT_name        : (indirect string, offset: 0x407c7): vPortFree
    <997>   DW_AT_decl_file   : 14
    <998>   DW_AT_decl_line   : 164
    <999>   DW_AT_decl_column : 6
    <99a>   DW_AT_prototyped  : 1
    <99a>   DW_AT_declaration : 1
    <99a>   DW_AT_sibling     : <0x9a4>
 <2><99e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <99f>   DW_AT_type        : <0x3af>
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 19 (DW_TAG_subprogram)
    <9a5>   DW_AT_external    : 1
    <9a5>   DW_AT_name        : (indirect string, offset: 0x8bb2b): pvPortMalloc
    <9a9>   DW_AT_decl_file   : 14
    <9aa>   DW_AT_decl_line   : 163
    <9ab>   DW_AT_decl_column : 7
    <9ac>   DW_AT_prototyped  : 1
    <9ac>   DW_AT_type        : <0x3af>
    <9b0>   DW_AT_declaration : 1
    <9b0>   DW_AT_sibling     : <0x9ba>
 <2><9b4>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9b5>   DW_AT_type        : <0x216>
 <2><9b9>: Abbrev Number: 0
 <1><9ba>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9bb>   DW_AT_external    : 1
    <9bb>   DW_AT_name        : (indirect string, offset: 0x88ff4): GNSSCom_MessageAdapter
    <9bf>   DW_AT_decl_file   : 1
    <9bf>   DW_AT_decl_line   : 52
    <9c0>   DW_AT_decl_column : 6
    <9c0>   DW_AT_prototyped  : 1
    <9c0>   DW_AT_low_pc      : 0x8000f00
    <9c4>   DW_AT_high_pc     : 0xc4
    <9c8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ca>   DW_AT_call_all_tail_calls: 1
    <9ca>   DW_AT_sibling     : <0xa12>
 <2><9ce>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x255af): buffer
    <9d3>   DW_AT_decl_file   : 1
    <9d3>   DW_AT_decl_line   : 52
    <9d4>   DW_AT_decl_column : 38
    <9d5>   DW_AT_type        : <0x3d7>
    <9d9>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9dc>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9dd>   DW_AT_name        : (indirect string, offset: 0xfa4d1): size
    <9e1>   DW_AT_decl_file   : 1
    <9e1>   DW_AT_decl_line   : 52
    <9e2>   DW_AT_decl_column : 53
    <9e3>   DW_AT_type        : <0xa12>
    <9e7>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><9ea>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x5c9e3): genericMessage
    <9ef>   DW_AT_decl_file   : 1
    <9ef>   DW_AT_decl_line   : 52
    <9f0>   DW_AT_decl_column : 75
    <9f1>   DW_AT_type        : <0xa17>
    <9f5>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><9f8>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <9f9>   DW_AT_low_pc      : 0x8000fa8
    <9fd>   DW_AT_high_pc     : 0x14
 <3><a01>: Abbrev Number: 7 (DW_TAG_variable)
    <a02>   DW_AT_name        : (indirect string, offset: 0x4f1da): NMEAMessage
    <a06>   DW_AT_decl_file   : 1
    <a07>   DW_AT_decl_line   : 70
    <a08>   DW_AT_decl_column : 24
    <a09>   DW_AT_type        : <0x856>
    <a0d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><a10>: Abbrev Number: 0
 <2><a11>: Abbrev Number: 0
 <1><a12>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a13>   DW_AT_byte_size   : 4
    <a13>   DW_AT_type        : <0x216>
 <1><a17>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a18>   DW_AT_byte_size   : 4
    <a18>   DW_AT_type        : <0x88f>
 <1><a1c>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a1d>   DW_AT_external    : 1
    <a1d>   DW_AT_name        : (indirect string, offset: 0x5043a): freeBuffer
    <a21>   DW_AT_decl_file   : 1
    <a21>   DW_AT_decl_line   : 47
    <a22>   DW_AT_decl_column : 6
    <a22>   DW_AT_prototyped  : 1
    <a22>   DW_AT_low_pc      : 0x8000ee0
    <a26>   DW_AT_high_pc     : 0x20
    <a2a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a2c>   DW_AT_call_all_tail_calls: 1
    <a2c>   DW_AT_sibling     : <0xa3f>
 <2><a30>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a31>   DW_AT_name        : (indirect string, offset: 0xc4a73): bufferDynamic
    <a35>   DW_AT_decl_file   : 1
    <a35>   DW_AT_decl_line   : 47
    <a36>   DW_AT_decl_column : 32
    <a37>   DW_AT_type        : <0x803>
    <a3b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a3e>: Abbrev Number: 0
 <1><a3f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a40>   DW_AT_external    : 1
    <a40>   DW_AT_name        : (indirect string, offset: 0x71412): resizeBuffer
    <a44>   DW_AT_decl_file   : 1
    <a44>   DW_AT_decl_line   : 40
    <a45>   DW_AT_decl_column : 6
    <a45>   DW_AT_prototyped  : 1
    <a45>   DW_AT_low_pc      : 0
    <a49>   DW_AT_high_pc     : 0x32
    <a4d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a4f>   DW_AT_call_all_tail_calls: 1
    <a4f>   DW_AT_sibling     : <0xa7f>
 <2><a53>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a54>   DW_AT_name        : (indirect string, offset: 0xc4a73): bufferDynamic
    <a58>   DW_AT_decl_file   : 1
    <a58>   DW_AT_decl_line   : 40
    <a59>   DW_AT_decl_column : 34
    <a5a>   DW_AT_type        : <0x803>
    <a5e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a61>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a62>   DW_AT_name        : (indirect string, offset: 0x294ed): newSize
    <a66>   DW_AT_decl_file   : 1
    <a66>   DW_AT_decl_line   : 40
    <a67>   DW_AT_decl_column : 56
    <a68>   DW_AT_type        : <0x216>
    <a6c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a6f>: Abbrev Number: 7 (DW_TAG_variable)
    <a70>   DW_AT_name        : (indirect string, offset: 0x68a64): newData
    <a74>   DW_AT_decl_file   : 1
    <a75>   DW_AT_decl_line   : 41
    <a76>   DW_AT_decl_column : 11
    <a77>   DW_AT_type        : <0x3d7>
    <a7b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a7e>: Abbrev Number: 0
 <1><a7f>: Abbrev Number: 37 (DW_TAG_subprogram)
    <a80>   DW_AT_external    : 1
    <a80>   DW_AT_name        : (indirect string, offset: 0x2f60f): initializeBuffer
    <a84>   DW_AT_decl_file   : 1
    <a85>   DW_AT_decl_line   : 25
    <a86>   DW_AT_decl_column : 16
    <a87>   DW_AT_prototyped  : 1
    <a87>   DW_AT_type        : <0x803>
    <a8b>   DW_AT_low_pc      : 0x8000e98
    <a8f>   DW_AT_high_pc     : 0x48
    <a93>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a95>   DW_AT_call_all_tail_calls: 1
    <a95>   DW_AT_sibling     : <0xab7>
 <2><a99>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a9a>   DW_AT_name        : (indirect string, offset: 0xa5d7f): initialSize
    <a9e>   DW_AT_decl_file   : 1
    <a9e>   DW_AT_decl_line   : 25
    <a9f>   DW_AT_decl_column : 40
    <aa0>   DW_AT_type        : <0x216>
    <aa4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><aa7>: Abbrev Number: 7 (DW_TAG_variable)
    <aa8>   DW_AT_name        : (indirect string, offset: 0xc4a73): bufferDynamic
    <aac>   DW_AT_decl_file   : 1
    <aad>   DW_AT_decl_line   : 26
    <aae>   DW_AT_decl_column : 17
    <aaf>   DW_AT_type        : <0x803>
    <ab3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ab6>: Abbrev Number: 0
 <1><ab7>: Abbrev Number: 38 (DW_TAG_subprogram)
    <ab8>   DW_AT_external    : 1
    <ab8>   DW_AT_name        : (indirect string, offset: 0x9dcec): GNSSCom_Init
    <abc>   DW_AT_decl_file   : 1
    <abd>   DW_AT_decl_line   : 18
    <abe>   DW_AT_decl_column : 6
    <abf>   DW_AT_prototyped  : 1
    <abf>   DW_AT_low_pc      : 0
    <ac3>   DW_AT_high_pc     : 0x28
    <ac7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ac9>   DW_AT_call_all_calls: 1
 <2><ac9>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <aca>   DW_AT_name        : (indirect string, offset: 0xae804): huart
    <ace>   DW_AT_decl_file   : 1
    <ace>   DW_AT_decl_line   : 18
    <acf>   DW_AT_decl_column : 39
    <ad0>   DW_AT_type        : <0x900>
    <ad4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ad7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x8b65d): huartDebug
    <adc>   DW_AT_decl_file   : 1
    <adc>   DW_AT_decl_line   : 18
    <add>   DW_AT_decl_column : 65
    <ade>   DW_AT_type        : <0x900>
    <ae2>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ae5>: Abbrev Number: 0
 <1><ae6>: Abbrev Number: 0
  Compilation Unit @ offset 0xae7:
   Length:        0x58f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x245
   Pointer Size:  4
 <0><af3>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <af4>   DW_AT_producer    : (indirect string, offset: 0x405f9): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <af8>   DW_AT_language    : 29	(C11)
    <af9>   DW_AT_name        : (indirect string, offset: 0xf79c8): ../Core/Src/GNSS/debug_formatter.c
    <afd>   DW_AT_comp_dir    : (indirect string, offset: 0x4c09e): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <b01>   DW_AT_ranges      : 0x38
    <b05>   DW_AT_low_pc      : 0
    <b09>   DW_AT_stmt_list   : 0xd02
    <b0d>   DW_AT_macros      : 0x26b40
 <1><b11>: Abbrev Number: 8 (DW_TAG_typedef)
    <b12>   DW_AT_name        : (indirect string, offset: 0xf78d4): __int8_t
    <b16>   DW_AT_decl_file   : 2
    <b17>   DW_AT_decl_line   : 41
    <b18>   DW_AT_decl_column : 23
    <b19>   DW_AT_type        : <0xb1d>
 <1><b1d>: Abbrev Number: 3 (DW_TAG_base_type)
    <b1e>   DW_AT_byte_size   : 1
    <b1f>   DW_AT_encoding    : 6	(signed char)
    <b20>   DW_AT_name        : (indirect string, offset: 0x7bfda): signed char
 <1><b24>: Abbrev Number: 8 (DW_TAG_typedef)
    <b25>   DW_AT_name        : (indirect string, offset: 0x475bc): __uint8_t
    <b29>   DW_AT_decl_file   : 2
    <b2a>   DW_AT_decl_line   : 43
    <b2b>   DW_AT_decl_column : 24
    <b2c>   DW_AT_type        : <0xb30>
 <1><b30>: Abbrev Number: 3 (DW_TAG_base_type)
    <b31>   DW_AT_byte_size   : 1
    <b32>   DW_AT_encoding    : 8	(unsigned char)
    <b33>   DW_AT_name        : (indirect string, offset: 0xee2d5): unsigned char
 <1><b37>: Abbrev Number: 3 (DW_TAG_base_type)
    <b38>   DW_AT_byte_size   : 2
    <b39>   DW_AT_encoding    : 5	(signed)
    <b3a>   DW_AT_name        : (indirect string, offset: 0xb6eda): short int
 <1><b3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <b3f>   DW_AT_byte_size   : 2
    <b40>   DW_AT_encoding    : 7	(unsigned)
    <b41>   DW_AT_name        : (indirect string, offset: 0xec6e8): short unsigned int
 <1><b45>: Abbrev Number: 3 (DW_TAG_base_type)
    <b46>   DW_AT_byte_size   : 4
    <b47>   DW_AT_encoding    : 5	(signed)
    <b48>   DW_AT_name        : (indirect string, offset: 0x14a21): long int
 <1><b4c>: Abbrev Number: 3 (DW_TAG_base_type)
    <b4d>   DW_AT_byte_size   : 4
    <b4e>   DW_AT_encoding    : 7	(unsigned)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x5ddc9): long unsigned int
 <1><b53>: Abbrev Number: 3 (DW_TAG_base_type)
    <b54>   DW_AT_byte_size   : 8
    <b55>   DW_AT_encoding    : 5	(signed)
    <b56>   DW_AT_name        : (indirect string, offset: 0x705c4): long long int
 <1><b5a>: Abbrev Number: 3 (DW_TAG_base_type)
    <b5b>   DW_AT_byte_size   : 8
    <b5c>   DW_AT_encoding    : 7	(unsigned)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x331bf): long long unsigned int
 <1><b61>: Abbrev Number: 20 (DW_TAG_base_type)
    <b62>   DW_AT_byte_size   : 4
    <b63>   DW_AT_encoding    : 5	(signed)
    <b64>   DW_AT_name        : int
 <1><b68>: Abbrev Number: 3 (DW_TAG_base_type)
    <b69>   DW_AT_byte_size   : 4
    <b6a>   DW_AT_encoding    : 7	(unsigned)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x13f1d): unsigned int
 <1><b6f>: Abbrev Number: 8 (DW_TAG_typedef)
    <b70>   DW_AT_name        : (indirect string, offset: 0xa16b): size_t
    <b74>   DW_AT_decl_file   : 3
    <b75>   DW_AT_decl_line   : 214
    <b76>   DW_AT_decl_column : 23
    <b77>   DW_AT_type        : <0xb68>
 <1><b7b>: Abbrev Number: 3 (DW_TAG_base_type)
    <b7c>   DW_AT_byte_size   : 8
    <b7d>   DW_AT_encoding    : 4	(float)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x1681e): long double
 <1><b82>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b83>   DW_AT_byte_size   : 4
 <1><b84>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b85>   DW_AT_byte_size   : 4
    <b85>   DW_AT_type        : <0xb89>
 <1><b89>: Abbrev Number: 3 (DW_TAG_base_type)
    <b8a>   DW_AT_byte_size   : 1
    <b8b>   DW_AT_encoding    : 8	(unsigned char)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x4f451): char
 <1><b90>: Abbrev Number: 8 (DW_TAG_typedef)
    <b91>   DW_AT_name        : (indirect string, offset: 0xf78d6): int8_t
    <b95>   DW_AT_decl_file   : 4
    <b96>   DW_AT_decl_line   : 20
    <b97>   DW_AT_decl_column : 18
    <b98>   DW_AT_type        : <0xb11>
 <1><b9c>: Abbrev Number: 8 (DW_TAG_typedef)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x475be): uint8_t
    <ba1>   DW_AT_decl_file   : 4
    <ba2>   DW_AT_decl_line   : 24
    <ba3>   DW_AT_decl_column : 19
    <ba4>   DW_AT_type        : <0xb24>
 <1><ba8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ba9>   DW_AT_byte_size   : 4
    <ba9>   DW_AT_type        : <0xb9c>
 <1><bad>: Abbrev Number: 4 (DW_TAG_array_type)
    <bae>   DW_AT_type        : <0xb9c>
    <bb2>   DW_AT_sibling     : <0xbbd>
 <2><bb6>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <bb7>   DW_AT_type        : <0xb68>
    <bbb>   DW_AT_upper_bound : 1
 <2><bbc>: Abbrev Number: 0
 <1><bbd>: Abbrev Number: 4 (DW_TAG_array_type)
    <bbe>   DW_AT_type        : <0xb9c>
    <bc2>   DW_AT_sibling     : <0xbcd>
 <2><bc6>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <bc7>   DW_AT_type        : <0xb68>
    <bcb>   DW_AT_upper_bound : 131
 <2><bcc>: Abbrev Number: 0
 <1><bcd>: Abbrev Number: 2 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0xe2e6): commandSetGNSS_Config
    <bd2>   DW_AT_decl_file   : 5
    <bd3>   DW_AT_decl_line   : 30
    <bd4>   DW_AT_decl_column : 16
    <bd5>   DW_AT_type        : <0xbbd>
    <bd9>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><bdf>: Abbrev Number: 4 (DW_TAG_array_type)
    <be0>   DW_AT_type        : <0xb9c>
    <be4>   DW_AT_sibling     : <0xbef>
 <2><be8>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <be9>   DW_AT_type        : <0xb68>
    <bed>   DW_AT_upper_bound : 26
 <2><bee>: Abbrev Number: 0
 <1><bef>: Abbrev Number: 2 (DW_TAG_variable)
    <bf0>   DW_AT_name        : (indirect string, offset: 0xe4f34): commandUart1Ouput
    <bf4>   DW_AT_decl_file   : 5
    <bf5>   DW_AT_decl_line   : 48
    <bf6>   DW_AT_decl_column : 16
    <bf7>   DW_AT_type        : <0xbdf>
    <bfb>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c01>: Abbrev Number: 4 (DW_TAG_array_type)
    <c02>   DW_AT_type        : <0xb9c>
    <c06>   DW_AT_sibling     : <0xc11>
 <2><c0a>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <c0b>   DW_AT_type        : <0xb68>
    <c0f>   DW_AT_upper_bound : 10
 <2><c10>: Abbrev Number: 0
 <1><c11>: Abbrev Number: 2 (DW_TAG_variable)
    <c12>   DW_AT_name        : (indirect string, offset: 0x6ea40): commandUBXTimeUTC
    <c16>   DW_AT_decl_file   : 5
    <c17>   DW_AT_decl_line   : 57
    <c18>   DW_AT_decl_column : 16
    <c19>   DW_AT_type        : <0xc01>
    <c1d>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c23>: Abbrev Number: 4 (DW_TAG_array_type)
    <c24>   DW_AT_type        : <0xb9c>
    <c28>   DW_AT_sibling     : <0xc33>
 <2><c2c>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <c2d>   DW_AT_type        : <0xb68>
    <c31>   DW_AT_upper_bound : 7
 <2><c32>: Abbrev Number: 0
 <1><c33>: Abbrev Number: 2 (DW_TAG_variable)
    <c34>   DW_AT_name        : (indirect string, offset: 0xa512f): pollUBXTimeUTC
    <c38>   DW_AT_decl_file   : 5
    <c39>   DW_AT_decl_line   : 60
    <c3a>   DW_AT_decl_column : 16
    <c3b>   DW_AT_type        : <0xc23>
    <c3f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c45>: Abbrev Number: 4 (DW_TAG_array_type)
    <c46>   DW_AT_type        : <0xb9c>
    <c4a>   DW_AT_sibling     : <0xc55>
 <2><c4e>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <c4f>   DW_AT_type        : <0xb68>
    <c53>   DW_AT_upper_bound : 92
 <2><c54>: Abbrev Number: 0
 <1><c55>: Abbrev Number: 2 (DW_TAG_variable)
    <c56>   DW_AT_name        : (indirect string, offset: 0xbbb2e): commandSetTP1_atNVTRate
    <c5a>   DW_AT_decl_file   : 5
    <c5b>   DW_AT_decl_line   : 79
    <c5c>   DW_AT_decl_column : 16
    <c5d>   DW_AT_type        : <0xc45>
    <c61>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c67>: Abbrev Number: 4 (DW_TAG_array_type)
    <c68>   DW_AT_type        : <0xb9c>
    <c6c>   DW_AT_sibling     : <0xc77>
 <2><c70>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <c71>   DW_AT_type        : <0xb68>
    <c75>   DW_AT_upper_bound : 100
 <2><c76>: Abbrev Number: 0
 <1><c77>: Abbrev Number: 2 (DW_TAG_variable)
    <c78>   DW_AT_name        : (indirect string, offset: 0xcfa83): commandSetTP2
    <c7c>   DW_AT_decl_file   : 5
    <c7d>   DW_AT_decl_line   : 105
    <c7e>   DW_AT_decl_column : 16
    <c7f>   DW_AT_type        : <0xc67>
    <c83>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c89>: Abbrev Number: 4 (DW_TAG_array_type)
    <c8a>   DW_AT_type        : <0xb9c>
    <c8e>   DW_AT_sibling     : <0xc99>
 <2><c92>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <c93>   DW_AT_type        : <0xb68>
    <c97>   DW_AT_upper_bound : 28
 <2><c98>: Abbrev Number: 0
 <1><c99>: Abbrev Number: 2 (DW_TAG_variable)
    <c9a>   DW_AT_name        : (indirect string, offset: 0xdfc9e): commandMeasureRate
    <c9e>   DW_AT_decl_file   : 5
    <c9f>   DW_AT_decl_line   : 122
    <ca0>   DW_AT_decl_column : 16
    <ca1>   DW_AT_type        : <0xc89>
    <ca5>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><cab>: Abbrev Number: 3 (DW_TAG_base_type)
    <cac>   DW_AT_byte_size   : 1
    <cad>   DW_AT_encoding    : 2	(boolean)
    <cae>   DW_AT_name        : (indirect string, offset: 0x6ffdb): _Bool
 <1><cb2>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <cb3>   DW_AT_encoding    : 7	(unsigned)
    <cb4>   DW_AT_byte_size   : 1
    <cb5>   DW_AT_type        : <0xb30>
    <cb9>   DW_AT_decl_file   : 6
    <cba>   DW_AT_decl_line   : 13
    <cbb>   DW_AT_decl_column : 14
    <cbc>   DW_AT_sibling     : <0xcfd>
 <2><cc0>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xf7b5b): TYPE_BITFIELD
    <cc5>   DW_AT_const_value : 0
 <2><cc6>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cc7>   DW_AT_name        : (indirect string, offset: 0xf7a39): TYPE_U1
    <ccb>   DW_AT_const_value : 1
 <2><ccc>: Abbrev Number: 7 (DW_TAG_enumerator)
    <ccd>   DW_AT_name        : (indirect string, offset: 0xf79f6): TYPE_I1
    <cd1>   DW_AT_const_value : 2
 <2><cd2>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xf792c): TYPE_X1
    <cd7>   DW_AT_const_value : 3
 <2><cd8>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cd9>   DW_AT_name        : (indirect string, offset: 0xf7924): TYPE_U2
    <cdd>   DW_AT_const_value : 4
 <2><cde>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cdf>   DW_AT_name        : (indirect string, offset: 0xf78ec): TYPE_I2
    <ce3>   DW_AT_const_value : 5
 <2><ce4>: Abbrev Number: 7 (DW_TAG_enumerator)
    <ce5>   DW_AT_name        : (indirect string, offset: 0xf78f4): TYPE_X2
    <ce9>   DW_AT_const_value : 6
 <2><cea>: Abbrev Number: 7 (DW_TAG_enumerator)
    <ceb>   DW_AT_name        : (indirect string, offset: 0xf7a41): TYPE_U4
    <cef>   DW_AT_const_value : 7
 <2><cf0>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cf1>   DW_AT_name        : (indirect string, offset: 0xf79fe): TYPE_I4
    <cf5>   DW_AT_const_value : 8
 <2><cf6>: Abbrev Number: 7 (DW_TAG_enumerator)
    <cf7>   DW_AT_name        : (indirect string, offset: 0xf7934): TYPE_X4
    <cfb>   DW_AT_const_value : 9
 <2><cfc>: Abbrev Number: 0
 <1><cfd>: Abbrev Number: 8 (DW_TAG_typedef)
    <cfe>   DW_AT_name        : (indirect string, offset: 0xf78e3): DataType
    <d02>   DW_AT_decl_file   : 6
    <d03>   DW_AT_decl_line   : 25
    <d04>   DW_AT_decl_column : 3
    <d05>   DW_AT_type        : <0xcb2>
 <1><d09>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0a>   DW_AT_byte_size   : 1
    <d0b>   DW_AT_decl_file   : 6
    <d0b>   DW_AT_decl_line   : 27
    <d0c>   DW_AT_decl_column : 9
    <d0d>   DW_AT_sibling     : <0xd1d>
 <2><d11>: Abbrev Number: 13 (DW_TAG_member)
    <d12>   DW_AT_name        : (indirect string, offset: 0xf78dd): bytes
    <d16>   DW_AT_decl_file   : 6
    <d16>   DW_AT_decl_line   : 28
    <d17>   DW_AT_decl_column : 10
    <d18>   DW_AT_type        : <0xd1d>
    <d1c>   DW_AT_data_member_location: 0
 <2><d1c>: Abbrev Number: 0
 <1><d1d>: Abbrev Number: 4 (DW_TAG_array_type)
    <d1e>   DW_AT_type        : <0xb9c>
    <d22>   DW_AT_sibling     : <0xd2d>
 <2><d26>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <d27>   DW_AT_type        : <0xb68>
    <d2b>   DW_AT_upper_bound : 0
 <2><d2c>: Abbrev Number: 0
 <1><d2d>: Abbrev Number: 10 (DW_TAG_typedef)
    <d2e>   DW_AT_name        : U1
    <d31>   DW_AT_decl_file   : 6
    <d31>   DW_AT_decl_line   : 29
    <d32>   DW_AT_decl_column : 2
    <d32>   DW_AT_type        : <0xd09>
 <1><d36>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d37>   DW_AT_byte_size   : 1
    <d38>   DW_AT_decl_file   : 6
    <d38>   DW_AT_decl_line   : 31
    <d39>   DW_AT_decl_column : 9
    <d3a>   DW_AT_sibling     : <0xd4a>
 <2><d3e>: Abbrev Number: 13 (DW_TAG_member)
    <d3f>   DW_AT_name        : (indirect string, offset: 0xf78dd): bytes
    <d43>   DW_AT_decl_file   : 6
    <d43>   DW_AT_decl_line   : 32
    <d44>   DW_AT_decl_column : 9
    <d45>   DW_AT_type        : <0xd4a>
    <d49>   DW_AT_data_member_location: 0
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 4 (DW_TAG_array_type)
    <d4b>   DW_AT_type        : <0xb90>
    <d4f>   DW_AT_sibling     : <0xd5a>
 <2><d53>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <d54>   DW_AT_type        : <0xb68>
    <d58>   DW_AT_upper_bound : 0
 <2><d59>: Abbrev Number: 0
 <1><d5a>: Abbrev Number: 10 (DW_TAG_typedef)
    <d5b>   DW_AT_name        : I1
    <d5e>   DW_AT_decl_file   : 6
    <d5e>   DW_AT_decl_line   : 33
    <d5f>   DW_AT_decl_column : 2
    <d5f>   DW_AT_type        : <0xd36>
 <1><d63>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d64>   DW_AT_byte_size   : 1
    <d65>   DW_AT_decl_file   : 6
    <d65>   DW_AT_decl_line   : 38
    <d66>   DW_AT_decl_column : 2
    <d67>   DW_AT_sibling     : <0xdc4>
 <2><d6b>: Abbrev Number: 1 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0xf78fc): bit1
    <d70>   DW_AT_decl_file   : 6
    <d70>   DW_AT_decl_line   : 39
    <d71>   DW_AT_decl_column : 11
    <d71>   DW_AT_type        : <0xb9c>
    <d75>   DW_AT_bit_size    : 1
    <d75>   DW_AT_data_bit_offset: 0
 <2><d76>: Abbrev Number: 1 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0xf7901): bit2
    <d7b>   DW_AT_decl_file   : 6
    <d7b>   DW_AT_decl_line   : 40
    <d7c>   DW_AT_decl_column : 11
    <d7c>   DW_AT_type        : <0xb9c>
    <d80>   DW_AT_bit_size    : 1
    <d80>   DW_AT_data_bit_offset: 1
 <2><d81>: Abbrev Number: 1 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0xf7906): bit3
    <d86>   DW_AT_decl_file   : 6
    <d86>   DW_AT_decl_line   : 41
    <d87>   DW_AT_decl_column : 11
    <d87>   DW_AT_type        : <0xb9c>
    <d8b>   DW_AT_bit_size    : 1
    <d8b>   DW_AT_data_bit_offset: 2
 <2><d8c>: Abbrev Number: 1 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xf790b): bit4
    <d91>   DW_AT_decl_file   : 6
    <d91>   DW_AT_decl_line   : 42
    <d92>   DW_AT_decl_column : 11
    <d92>   DW_AT_type        : <0xb9c>
    <d96>   DW_AT_bit_size    : 1
    <d96>   DW_AT_data_bit_offset: 3
 <2><d97>: Abbrev Number: 1 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0xf79a9): bit5
    <d9c>   DW_AT_decl_file   : 6
    <d9c>   DW_AT_decl_line   : 43
    <d9d>   DW_AT_decl_column : 11
    <d9d>   DW_AT_type        : <0xb9c>
    <da1>   DW_AT_bit_size    : 1
    <da1>   DW_AT_data_bit_offset: 4
 <2><da2>: Abbrev Number: 1 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0xf7910): bit6
    <da7>   DW_AT_decl_file   : 6
    <da7>   DW_AT_decl_line   : 44
    <da8>   DW_AT_decl_column : 11
    <da8>   DW_AT_type        : <0xb9c>
    <dac>   DW_AT_bit_size    : 1
    <dac>   DW_AT_data_bit_offset: 5
 <2><dad>: Abbrev Number: 1 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0xf7915): bit7
    <db2>   DW_AT_decl_file   : 6
    <db2>   DW_AT_decl_line   : 45
    <db3>   DW_AT_decl_column : 11
    <db3>   DW_AT_type        : <0xb9c>
    <db7>   DW_AT_bit_size    : 1
    <db7>   DW_AT_data_bit_offset: 6
 <2><db8>: Abbrev Number: 1 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0xf791a): bit8
    <dbd>   DW_AT_decl_file   : 6
    <dbd>   DW_AT_decl_line   : 46
    <dbe>   DW_AT_decl_column : 11
    <dbe>   DW_AT_type        : <0xb9c>
    <dc2>   DW_AT_bit_size    : 1
    <dc2>   DW_AT_data_bit_offset: 7
 <2><dc3>: Abbrev Number: 0
 <1><dc4>: Abbrev Number: 15 (DW_TAG_union_type)
    <dc5>   DW_AT_byte_size   : 1
    <dc6>   DW_AT_decl_file   : 6
    <dc6>   DW_AT_decl_line   : 35
    <dc7>   DW_AT_decl_column : 9
    <dc7>   DW_AT_sibling     : <0xddb>
 <2><dcb>: Abbrev Number: 16 (DW_TAG_member)
    <dcc>   DW_AT_name        : (indirect string, offset: 0xf78dd): bytes
    <dd0>   DW_AT_decl_file   : 6
    <dd0>   DW_AT_decl_line   : 37
    <dd1>   DW_AT_decl_column : 10
    <dd1>   DW_AT_type        : <0xd1d>
 <2><dd5>: Abbrev Number: 17 (DW_TAG_member)
    <dd6>   DW_AT_type        : <0xd63>
 <2><dda>: Abbrev Number: 0
 <1><ddb>: Abbrev Number: 10 (DW_TAG_typedef)
    <ddc>   DW_AT_name        : X1
    <ddf>   DW_AT_decl_file   : 6
    <ddf>   DW_AT_decl_line   : 48
    <de0>   DW_AT_decl_column : 2
    <de0>   DW_AT_type        : <0xdc4>
 <1><de4>: Abbrev Number: 9 (DW_TAG_structure_type)
    <de5>   DW_AT_byte_size   : 2
    <de6>   DW_AT_decl_file   : 6
    <de6>   DW_AT_decl_line   : 50
    <de7>   DW_AT_decl_column : 9
    <de8>   DW_AT_sibling     : <0xdf8>
 <2><dec>: Abbrev Number: 13 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0xf78dd): bytes
    <df1>   DW_AT_decl_file   : 6
    <df1>   DW_AT_decl_line   : 51
    <df2>   DW_AT_decl_column : 10
    <df3>   DW_AT_type        : <0xbad>
    <df7>   DW_AT_data_member_location: 0
 <2><df7>: Abbrev Number: 0
 <1><df8>: Abbrev Number: 10 (DW_TAG_typedef)
    <df9>   DW_AT_name        : U2
    <dfc>   DW_AT_decl_file   : 6
    <dfc>   DW_AT_decl_line   : 52
    <dfd>   DW_AT_decl_column : 2
    <dfd>   DW_AT_type        : <0xde4>
 <1><e01>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e02>   DW_AT_byte_size   : 2
    <e03>   DW_AT_decl_file   : 6
    <e03>   DW_AT_decl_line   : 54
    <e04>   DW_AT_decl_column : 9
    <e05>   DW_AT_sibling     : <0xe15>
 <2><e09>: Abbrev Number: 13 (DW_TAG_member)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xf78dd): bytes
    <e0e>   DW_AT_decl_file   : 6
    <e0e>   DW_AT_decl_line   : 55
    <e0f>   DW_AT_decl_column : 9
    <e10>   DW_AT_type        : <0xe15>
    <e14>   DW_AT_data_member_location: 0
 <2><e14>: Abbrev Number: 0
 <1><e15>: Abbrev Number: 4 (DW_TAG_array_type)
    <e16>   DW_AT_type        : <0xb90>
    <e1a>   DW_AT_sibling     : <0xe25>
 <2><e1e>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e1f>   DW_AT_type        : <0xb68>
    <e23>   DW_AT_upper_bound : 1
 <2><e24>: Abbrev Number: 0
 <1><e25>: Abbrev Number: 10 (DW_TAG_typedef)
    <e26>   DW_AT_name        : I2
    <e29>   DW_AT_decl_file   : 6
    <e29>   DW_AT_decl_line   : 56
    <e2a>   DW_AT_decl_column : 2
    <e2a>   DW_AT_type        : <0xe01>
 <1><e2e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e2f>   DW_AT_byte_size   : 2
    <e30>   DW_AT_decl_file   : 6
    <e30>   DW_AT_decl_line   : 61
    <e31>   DW_AT_decl_column : 2
    <e32>   DW_AT_sibling     : <0xee7>
 <2><e36>: Abbrev Number: 1 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0xf78fc): bit1
    <e3b>   DW_AT_decl_file   : 6
    <e3b>   DW_AT_decl_line   : 62
    <e3c>   DW_AT_decl_column : 11
    <e3c>   DW_AT_type        : <0xb9c>
    <e40>   DW_AT_bit_size    : 1
    <e40>   DW_AT_data_bit_offset: 0
 <2><e41>: Abbrev Number: 1 (DW_TAG_member)
    <e42>   DW_AT_name        : (indirect string, offset: 0xf7901): bit2
    <e46>   DW_AT_decl_file   : 6
    <e46>   DW_AT_decl_line   : 63
    <e47>   DW_AT_decl_column : 11
    <e47>   DW_AT_type        : <0xb9c>
    <e4b>   DW_AT_bit_size    : 1
    <e4b>   DW_AT_data_bit_offset: 1
 <2><e4c>: Abbrev Number: 1 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0xf7906): bit3
    <e51>   DW_AT_decl_file   : 6
    <e51>   DW_AT_decl_line   : 64
    <e52>   DW_AT_decl_column : 11
    <e52>   DW_AT_type        : <0xb9c>
    <e56>   DW_AT_bit_size    : 1
    <e56>   DW_AT_data_bit_offset: 2
 <2><e57>: Abbrev Number: 1 (DW_TAG_member)
    <e58>   DW_AT_name        : (indirect string, offset: 0xf790b): bit4
    <e5c>   DW_AT_decl_file   : 6
    <e5c>   DW_AT_decl_line   : 65
    <e5d>   DW_AT_decl_column : 11
    <e5d>   DW_AT_type        : <0xb9c>
    <e61>   DW_AT_bit_size    : 1
    <e61>   DW_AT_data_bit_offset: 3
 <2><e62>: Abbrev Number: 1 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0xf79a9): bit5
    <e67>   DW_AT_decl_file   : 6
    <e67>   DW_AT_decl_line   : 66
    <e68>   DW_AT_decl_column : 11
    <e68>   DW_AT_type        : <0xb9c>
    <e6c>   DW_AT_bit_size    : 1
    <e6c>   DW_AT_data_bit_offset: 4
 <2><e6d>: Abbrev Number: 1 (DW_TAG_member)
    <e6e>   DW_AT_name        : (indirect string, offset: 0xf7910): bit6
    <e72>   DW_AT_decl_file   : 6
    <e72>   DW_AT_decl_line   : 67
    <e73>   DW_AT_decl_column : 11
    <e73>   DW_AT_type        : <0xb9c>
    <e77>   DW_AT_bit_size    : 1
    <e77>   DW_AT_data_bit_offset: 5
 <2><e78>: Abbrev Number: 1 (DW_TAG_member)
    <e79>   DW_AT_name        : (indirect string, offset: 0xf7915): bit7
    <e7d>   DW_AT_decl_file   : 6
    <e7d>   DW_AT_decl_line   : 68
    <e7e>   DW_AT_decl_column : 11
    <e7e>   DW_AT_type        : <0xb9c>
    <e82>   DW_AT_bit_size    : 1
    <e82>   DW_AT_data_bit_offset: 6
 <2><e83>: Abbrev Number: 1 (DW_TAG_member)
    <e84>   DW_AT_name        : (indirect string, offset: 0xf791a): bit8
    <e88>   DW_AT_decl_file   : 6
    <e88>   DW_AT_decl_line   : 69
    <e89>   DW_AT_decl_column : 11
    <e89>   DW_AT_type        : <0xb9c>
    <e8d>   DW_AT_bit_size    : 1
    <e8d>   DW_AT_data_bit_offset: 7
 <2><e8e>: Abbrev Number: 1 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0xf791f): bit9
    <e93>   DW_AT_decl_file   : 6
    <e93>   DW_AT_decl_line   : 70
    <e94>   DW_AT_decl_column : 11
    <e94>   DW_AT_type        : <0xb9c>
    <e98>   DW_AT_bit_size    : 1
    <e98>   DW_AT_data_bit_offset: 8
 <2><e99>: Abbrev Number: 1 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xf78b6): bit10
    <e9e>   DW_AT_decl_file   : 6
    <e9e>   DW_AT_decl_line   : 71
    <e9f>   DW_AT_decl_column : 11
    <e9f>   DW_AT_type        : <0xb9c>
    <ea3>   DW_AT_bit_size    : 1
    <ea3>   DW_AT_data_bit_offset: 9
 <2><ea4>: Abbrev Number: 1 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xf78bc): bit11
    <ea9>   DW_AT_decl_file   : 6
    <ea9>   DW_AT_decl_line   : 72
    <eaa>   DW_AT_decl_column : 11
    <eaa>   DW_AT_type        : <0xb9c>
    <eae>   DW_AT_bit_size    : 1
    <eae>   DW_AT_data_bit_offset: 10
 <2><eaf>: Abbrev Number: 1 (DW_TAG_member)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xf78c2): bit12
    <eb4>   DW_AT_decl_file   : 6
    <eb4>   DW_AT_decl_line   : 73
    <eb5>   DW_AT_decl_column : 11
    <eb5>   DW_AT_type        : <0xb9c>
    <eb9>   DW_AT_bit_size    : 1
    <eb9>   DW_AT_data_bit_offset: 11
 <2><eba>: Abbrev Number: 1 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0xf78c8): bit13
    <ebf>   DW_AT_decl_file   : 6
    <ebf>   DW_AT_decl_line   : 74
    <ec0>   DW_AT_decl_column : 11
    <ec0>   DW_AT_type        : <0xb9c>
    <ec4>   DW_AT_bit_size    : 1
    <ec4>   DW_AT_data_bit_offset: 12
 <2><ec5>: Abbrev Number: 1 (DW_TAG_member)
    <ec6>   DW_AT_name        : (indirect string, offset: 0xf7a63): bit14
    <eca>   DW_AT_decl_file   : 6
    <eca>   DW_AT_decl_line   : 75
    <ecb>   DW_AT_decl_column : 11
    <ecb>   DW_AT_type        : <0xb9c>
    <ecf>   DW_AT_bit_size    : 1
    <ecf>   DW_AT_data_bit_offset: 13
 <2><ed0>: Abbrev Number: 1 (DW_TAG_member)
    <ed1>   DW_AT_name        : (indirect string, offset: 0xf78ce): bit15
    <ed5>   DW_AT_decl_file   : 6
    <ed5>   DW_AT_decl_line   : 76
    <ed6>   DW_AT_decl_column : 11
    <ed6>   DW_AT_type        : <0xb9c>
    <eda>   DW_AT_bit_size    : 1
    <eda>   DW_AT_data_bit_offset: 14
 <2><edb>: Abbrev Number: 1 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0xf78a4): bit16
    <ee0>   DW_AT_decl_file   : 6
    <ee0>   DW_AT_decl_line   : 77
    <ee1>   DW_AT_decl_column : 11
    <ee1>   DW_AT_type        : <0xb9c>
    <ee5>   DW_AT_bit_size    : 1
    <ee5>   DW_AT_data_bit_offset: 15
 <2><ee6>: Abbrev Number: 0
 <1><ee7>: Abbrev Number: 15 (DW_TAG_union_type)
    <ee8>   DW_AT_byte_size   : 2
    <ee9>   DW_AT_decl_file   : 6
    <ee9>   DW_AT_decl_line   : 58
    <eea>   DW_AT_decl_column : 9
    <eea>   DW_AT_sibling     : <0xefe>
 <2><eee>: Abbrev Number: 16 (DW_TAG_member)
    <eef>   DW_AT_name        : (indirect string, offset: 0xf78dd): bytes
    <ef3>   DW_AT_decl_file   : 6
    <ef3>   DW_AT_decl_line   : 60
    <ef4>   DW_AT_decl_column : 10
    <ef4>   DW_AT_type        : <0xbad>
 <2><ef8>: Abbrev Number: 17 (DW_TAG_member)
    <ef9>   DW_AT_type        : <0xe2e>
 <2><efd>: Abbrev Number: 0
 <1><efe>: Abbrev Number: 10 (DW_TAG_typedef)
    <eff>   DW_AT_name        : X2
    <f02>   DW_AT_decl_file   : 6
    <f02>   DW_AT_decl_line   : 79
    <f03>   DW_AT_decl_column : 2
    <f03>   DW_AT_type        : <0xee7>
 <1><f07>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f08>   DW_AT_external    : 1
    <f08>   DW_AT_name        : (indirect string, offset: 0xf786c): int8ArrayToString
    <f0c>   DW_AT_decl_file   : 7
    <f0c>   DW_AT_decl_line   : 27
    <f0d>   DW_AT_decl_column : 7
    <f0d>   DW_AT_prototyped  : 1
    <f0d>   DW_AT_type        : <0xb84>
    <f11>   DW_AT_declaration : 1
    <f11>   DW_AT_sibling     : <0xf20>
 <2><f15>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <f16>   DW_AT_type        : <0xf20>
 <2><f1a>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <f1b>   DW_AT_type        : <0xb6f>
 <2><f1f>: Abbrev Number: 0
 <1><f20>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f21>   DW_AT_byte_size   : 4
    <f21>   DW_AT_type        : <0xb90>
 <1><f25>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f26>   DW_AT_external    : 1
    <f26>   DW_AT_name        : (indirect string, offset: 0xf786b): uint8ArrayToString
    <f2a>   DW_AT_decl_file   : 7
    <f2a>   DW_AT_decl_line   : 26
    <f2b>   DW_AT_decl_column : 7
    <f2b>   DW_AT_prototyped  : 1
    <f2b>   DW_AT_type        : <0xb84>
    <f2f>   DW_AT_declaration : 1
    <f2f>   DW_AT_sibling     : <0xf3e>
 <2><f33>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <f34>   DW_AT_type        : <0xba8>
 <2><f38>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <f39>   DW_AT_type        : <0xb6f>
 <2><f3d>: Abbrev Number: 0
 <1><f3e>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f3f>   DW_AT_external    : 1
    <f3f>   DW_AT_name        : (indirect string, offset: 0xf7947): UBX_format
    <f43>   DW_AT_decl_file   : 1
    <f44>   DW_AT_decl_line   : 9
    <f45>   DW_AT_decl_column : 7
    <f46>   DW_AT_prototyped  : 1
    <f46>   DW_AT_type        : <0xb84>
    <f4a>   DW_AT_low_pc      : 0x8000fc4
    <f4e>   DW_AT_high_pc     : 0x138
    <f52>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f54>   DW_AT_call_all_tail_calls: 1
    <f54>   DW_AT_sibling     : <0x1047>
 <2><f58>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <f59>   DW_AT_name        : (indirect string, offset: 0xf799c): fieldToDebug
    <f5d>   DW_AT_decl_file   : 1
    <f5d>   DW_AT_decl_line   : 9
    <f5d>   DW_AT_decl_column : 24
    <f5e>   DW_AT_type        : <0xb82>
    <f62>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><f65>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <f66>   DW_AT_name        : (indirect string, offset: 0xff90b): type
    <f6a>   DW_AT_decl_file   : 1
    <f6a>   DW_AT_decl_line   : 9
    <f6a>   DW_AT_decl_column : 47
    <f6b>   DW_AT_type        : <0xcfd>
    <f6f>   DW_AT_location    : 2 byte block: 91 53 	(DW_OP_fbreg: -45)
 <2><f72>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <f73>   DW_AT_name        : (indirect string, offset: 0xf7a5b): funcSpe
    <f77>   DW_AT_decl_file   : 1
    <f77>   DW_AT_decl_line   : 9
    <f77>   DW_AT_decl_column : 61
    <f78>   DW_AT_type        : <0x1056>
    <f7c>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><f7f>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <f80>   DW_AT_low_pc      : 0x8000ffc
    <f84>   DW_AT_high_pc     : 0x26
    <f88>   DW_AT_sibling     : <0xf9c>
 <3><f8c>: Abbrev Number: 2 (DW_TAG_variable)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <f91>   DW_AT_decl_file   : 1
    <f92>   DW_AT_decl_line   : 13
    <f93>   DW_AT_decl_column : 12
    <f94>   DW_AT_type        : <0xba8>
    <f98>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><f9b>: Abbrev Number: 0
 <2><f9c>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <f9d>   DW_AT_low_pc      : 0x8001022
    <fa1>   DW_AT_high_pc     : 0x22
    <fa5>   DW_AT_sibling     : <0xfb9>
 <3><fa9>: Abbrev Number: 2 (DW_TAG_variable)
    <faa>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <fae>   DW_AT_decl_file   : 1
    <faf>   DW_AT_decl_line   : 20
    <fb0>   DW_AT_decl_column : 7
    <fb1>   DW_AT_type        : <0x105b>
    <fb5>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><fb8>: Abbrev Number: 0
 <2><fb9>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <fba>   DW_AT_low_pc      : 0x8001044
    <fbe>   DW_AT_high_pc     : 0x22
    <fc2>   DW_AT_sibling     : <0xfd6>
 <3><fc6>: Abbrev Number: 2 (DW_TAG_variable)
    <fc7>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <fcb>   DW_AT_decl_file   : 1
    <fcc>   DW_AT_decl_line   : 27
    <fcd>   DW_AT_decl_column : 7
    <fce>   DW_AT_type        : <0x1060>
    <fd2>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><fd5>: Abbrev Number: 0
 <2><fd6>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <fd7>   DW_AT_low_pc      : 0x8001066
    <fdb>   DW_AT_high_pc     : 0x22
    <fdf>   DW_AT_sibling     : <0xff3>
 <3><fe3>: Abbrev Number: 2 (DW_TAG_variable)
    <fe4>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <fe8>   DW_AT_decl_file   : 1
    <fe9>   DW_AT_decl_line   : 34
    <fea>   DW_AT_decl_column : 7
    <feb>   DW_AT_type        : <0x1065>
    <fef>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><ff2>: Abbrev Number: 0
 <2><ff3>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <ff4>   DW_AT_low_pc      : 0x8001088
    <ff8>   DW_AT_high_pc     : 0x22
    <ffc>   DW_AT_sibling     : <0x1010>
 <3><1000>: Abbrev Number: 2 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <1005>   DW_AT_decl_file   : 1
    <1006>   DW_AT_decl_line   : 41
    <1007>   DW_AT_decl_column : 7
    <1008>   DW_AT_type        : <0x106a>
    <100c>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><100f>: Abbrev Number: 0
 <2><1010>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <1011>   DW_AT_low_pc      : 0x80010aa
    <1015>   DW_AT_high_pc     : 0x22
    <1019>   DW_AT_sibling     : <0x102d>
 <3><101d>: Abbrev Number: 2 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <1022>   DW_AT_decl_file   : 1
    <1023>   DW_AT_decl_line   : 48
    <1024>   DW_AT_decl_column : 7
    <1025>   DW_AT_type        : <0x106f>
    <1029>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><102c>: Abbrev Number: 0
 <2><102d>: Abbrev Number: 24 (DW_TAG_lexical_block)
    <102e>   DW_AT_low_pc      : 0x80010cc
    <1032>   DW_AT_high_pc     : 0x22
 <3><1036>: Abbrev Number: 2 (DW_TAG_variable)
    <1037>   DW_AT_name        : (indirect string, offset: 0xf78aa): fieldCasted
    <103b>   DW_AT_decl_file   : 1
    <103c>   DW_AT_decl_line   : 55
    <103d>   DW_AT_decl_column : 7
    <103e>   DW_AT_type        : <0x1074>
    <1042>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><1045>: Abbrev Number: 0
 <2><1046>: Abbrev Number: 0
 <1><1047>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <1048>   DW_AT_prototyped  : 1
    <1048>   DW_AT_type        : <0xb84>
    <104c>   DW_AT_sibling     : <0x1056>
 <2><1050>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <1051>   DW_AT_type        : <0xb82>
 <2><1055>: Abbrev Number: 0
 <1><1056>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1057>   DW_AT_byte_size   : 4
    <1057>   DW_AT_type        : <0x1047>
 <1><105b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <105c>   DW_AT_byte_size   : 4
    <105c>   DW_AT_type        : <0xd2d>
 <1><1060>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1061>   DW_AT_byte_size   : 4
    <1061>   DW_AT_type        : <0xd5a>
 <1><1065>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1066>   DW_AT_byte_size   : 4
    <1066>   DW_AT_type        : <0xddb>
 <1><106a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <106b>   DW_AT_byte_size   : 4
    <106b>   DW_AT_type        : <0xdf8>
 <1><106f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1070>   DW_AT_byte_size   : 4
    <1070>   DW_AT_type        : <0xe25>
 <1><1074>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1075>   DW_AT_byte_size   : 4
    <1075>   DW_AT_type        : <0xefe>
 <1><1079>: Abbrev Number: 0
  Compilation Unit @ offset 0x107a:
   Length:        0x3ba (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
