Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x976 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 25 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x40403): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x85a0d): ../Core/Src/GNSS/GNSSCom.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4bdfc): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x7bd74): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x47360): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 5 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xee0e9): unsigned char
 <1><44>: Abbrev Number: 5 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb6d29): short int
 <1><4b>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xc90d0): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 5 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xec4fc): short unsigned int
 <1><5e>: Abbrev Number: 5 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x1489c): long int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x9da2b): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 5 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5db2a): long unsigned int
 <1><78>: Abbrev Number: 5 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x70312): long long int
 <1><7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x32fac): long long unsigned int
 <1><86>: Abbrev Number: 26 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 5 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x13d98): unsigned int
 <1><94>: Abbrev Number: 2 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x47362): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 27 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xb4fdd): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x11317): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 16
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 404
    <cb>   DW_AT_decl_column : 9
    <cb>   DW_AT_sibling     : <0x106>
 <2><cf>: Abbrev Number: 6 (DW_TAG_member)
    <d0>   DW_AT_name        : CCR
    <d4>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 406
    <d6>   DW_AT_decl_column : 17
    <d6>   DW_AT_type        : <0xc2>
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 3 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0xa1a42): CNDTR
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 407
    <e3>   DW_AT_decl_column : 17
    <e4>   DW_AT_type        : <0xc2>
    <e8>   DW_AT_data_member_location: 4
 <2><e9>: Abbrev Number: 3 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0xee2cb): CPAR
    <ee>   DW_AT_decl_file   : 4
    <ef>   DW_AT_decl_line   : 408
    <f1>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xc2>
    <f6>   DW_AT_data_member_location: 8
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x883e6): CMAR
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 409
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 12
 <2><105>: Abbrev Number: 0
 <1><106>: Abbrev Number: 15 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0xe863d): DMA_Channel_TypeDef
    <10b>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 410
    <10e>   DW_AT_decl_column : 3
    <10e>   DW_AT_type        : <0xc7>
 <1><112>: Abbrev Number: 17 (DW_TAG_structure_type)
    <113>   DW_AT_byte_size   : 8
    <114>   DW_AT_decl_file   : 4
    <114>   DW_AT_decl_line   : 412
    <116>   DW_AT_decl_column : 9
    <116>   DW_AT_sibling     : <0x135>
 <2><11a>: Abbrev Number: 6 (DW_TAG_member)
    <11b>   DW_AT_name        : ISR
    <11f>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 414
    <121>   DW_AT_decl_column : 17
    <121>   DW_AT_type        : <0xc2>
    <125>   DW_AT_data_member_location: 0
 <2><126>: Abbrev Number: 3 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0xac8b7): IFCR
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 415
    <12e>   DW_AT_decl_column : 17
    <12f>   DW_AT_type        : <0xc2>
    <133>   DW_AT_data_member_location: 4
 <2><134>: Abbrev Number: 0
 <1><135>: Abbrev Number: 15 (DW_TAG_typedef)
    <136>   DW_AT_name        : (indirect string, offset: 0x593fa): DMA_TypeDef
    <13a>   DW_AT_decl_file   : 4
    <13b>   DW_AT_decl_line   : 416
    <13d>   DW_AT_decl_column : 3
    <13d>   DW_AT_type        : <0x112>
 <1><141>: Abbrev Number: 17 (DW_TAG_structure_type)
    <142>   DW_AT_byte_size   : 44
    <143>   DW_AT_decl_file   : 4
    <143>   DW_AT_decl_line   : 950
    <145>   DW_AT_decl_column : 9
    <145>   DW_AT_sibling     : <0x20a>
 <2><149>: Abbrev Number: 6 (DW_TAG_member)
    <14a>   DW_AT_name        : CR1
    <14e>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 952
    <150>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xc2>
    <154>   DW_AT_data_member_location: 0
 <2><155>: Abbrev Number: 6 (DW_TAG_member)
    <156>   DW_AT_name        : CR2
    <15a>   DW_AT_decl_file   : 4
    <15a>   DW_AT_decl_line   : 953
    <15c>   DW_AT_decl_column : 17
    <15c>   DW_AT_type        : <0xc2>
    <160>   DW_AT_data_member_location: 4
 <2><161>: Abbrev Number: 6 (DW_TAG_member)
    <162>   DW_AT_name        : CR3
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 954
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 6 (DW_TAG_member)
    <16e>   DW_AT_name        : BRR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 955
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xc2>
    <178>   DW_AT_data_member_location: 12
 <2><179>: Abbrev Number: 3 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x440b6): GTPR
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 956
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xb1>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 3 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xe84c8): RESERVED2
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 957
    <18f>   DW_AT_decl_column : 13
    <190>   DW_AT_type        : <0xa5>
    <194>   DW_AT_data_member_location: 18
 <2><195>: Abbrev Number: 3 (DW_TAG_member)
    <196>   DW_AT_name        : (indirect string, offset: 0x911d1): RTOR
    <19a>   DW_AT_decl_file   : 4
    <19b>   DW_AT_decl_line   : 958
    <19d>   DW_AT_decl_column : 17
    <19e>   DW_AT_type        : <0xc2>
    <1a2>   DW_AT_data_member_location: 20
 <2><1a3>: Abbrev Number: 6 (DW_TAG_member)
    <1a4>   DW_AT_name        : RQR
    <1a8>   DW_AT_decl_file   : 4
    <1a8>   DW_AT_decl_line   : 959
    <1aa>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xb1>
    <1ae>   DW_AT_data_member_location: 24
 <2><1af>: Abbrev Number: 3 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xe84d2): RESERVED3
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 960
    <1b7>   DW_AT_decl_column : 13
    <1b8>   DW_AT_type        : <0xa5>
    <1bc>   DW_AT_data_member_location: 26
 <2><1bd>: Abbrev Number: 6 (DW_TAG_member)
    <1be>   DW_AT_name        : ISR
    <1c2>   DW_AT_decl_file   : 4
    <1c2>   DW_AT_decl_line   : 961
    <1c4>   DW_AT_decl_column : 17
    <1c4>   DW_AT_type        : <0xc2>
    <1c8>   DW_AT_data_member_location: 28
 <2><1c9>: Abbrev Number: 6 (DW_TAG_member)
    <1ca>   DW_AT_name        : ICR
    <1ce>   DW_AT_decl_file   : 4
    <1ce>   DW_AT_decl_line   : 962
    <1d0>   DW_AT_decl_column : 17
    <1d0>   DW_AT_type        : <0xc2>
    <1d4>   DW_AT_data_member_location: 32
 <2><1d5>: Abbrev Number: 6 (DW_TAG_member)
    <1d6>   DW_AT_name        : RDR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 963
    <1dc>   DW_AT_decl_column : 17
    <1dc>   DW_AT_type        : <0xb1>
    <1e0>   DW_AT_data_member_location: 36
 <2><1e1>: Abbrev Number: 3 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0xdea0b): RESERVED4
    <1e6>   DW_AT_decl_file   : 4
    <1e7>   DW_AT_decl_line   : 964
    <1e9>   DW_AT_decl_column : 13
    <1ea>   DW_AT_type        : <0xa5>
    <1ee>   DW_AT_data_member_location: 38
 <2><1ef>: Abbrev Number: 6 (DW_TAG_member)
    <1f0>   DW_AT_name        : TDR
    <1f4>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 965
    <1f6>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xb1>
    <1fa>   DW_AT_data_member_location: 40
 <2><1fb>: Abbrev Number: 3 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0xe8500): RESERVED5
    <200>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 966
    <203>   DW_AT_decl_column : 13
    <204>   DW_AT_type        : <0xa5>
    <208>   DW_AT_data_member_location: 42
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0xf467e): USART_TypeDef
    <20f>   DW_AT_decl_file   : 4
    <210>   DW_AT_decl_line   : 967
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x141>
 <1><216>: Abbrev Number: 2 (DW_TAG_typedef)
    <217>   DW_AT_name        : (indirect string, offset: 0xa0d8): size_t
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 214
    <21d>   DW_AT_decl_column : 23
    <21e>   DW_AT_type        : <0x8d>
 <1><222>: Abbrev Number: 5 (DW_TAG_base_type)
    <223>   DW_AT_byte_size   : 8
    <224>   DW_AT_encoding    : 4	(float)
    <225>   DW_AT_name        : (indirect string, offset: 0x16703): long double
 <1><229>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <22a>   DW_AT_encoding    : 7	(unsigned)
    <22a>   DW_AT_byte_size   : 1
    <22a>   DW_AT_type        : <0x3d>
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 50
    <230>   DW_AT_decl_column : 1
    <231>   DW_AT_sibling     : <0x242>
 <2><235>: Abbrev Number: 7 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0xb5a4c): HAL_UNLOCKED
    <23a>   DW_AT_const_value : 0
 <2><23b>: Abbrev Number: 7 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0xf657b): HAL_LOCKED
    <240>   DW_AT_const_value : 1
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 2 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x9114e): HAL_LockTypeDef
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 53
    <249>   DW_AT_decl_column : 3
    <24a>   DW_AT_type        : <0x229>
 <1><24e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <24f>   DW_AT_byte_size   : 32
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 46
    <252>   DW_AT_decl_column : 9
    <252>   DW_AT_sibling     : <0x2bf>
 <2><256>: Abbrev Number: 1 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0xdca23): Request
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 48
    <25d>   DW_AT_decl_column : 12
    <25e>   DW_AT_type        : <0xb6>
    <262>   DW_AT_data_member_location: 0
 <2><263>: Abbrev Number: 1 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x5add6): Direction
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 51
    <26a>   DW_AT_decl_column : 12
    <26b>   DW_AT_type        : <0xb6>
    <26f>   DW_AT_data_member_location: 4
 <2><270>: Abbrev Number: 1 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x10718): PeriphInc
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 55
    <277>   DW_AT_decl_column : 12
    <278>   DW_AT_type        : <0xb6>
    <27c>   DW_AT_data_member_location: 8
 <2><27d>: Abbrev Number: 1 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x26469): MemInc
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 58
    <284>   DW_AT_decl_column : 12
    <285>   DW_AT_type        : <0xb6>
    <289>   DW_AT_data_member_location: 12
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x7ade9): PeriphDataAlignment
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 61
    <291>   DW_AT_decl_column : 12
    <292>   DW_AT_type        : <0xb6>
    <296>   DW_AT_data_member_location: 16
 <2><297>: Abbrev Number: 1 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xde58b): MemDataAlignment
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 64
    <29e>   DW_AT_decl_column : 12
    <29f>   DW_AT_type        : <0xb6>
    <2a3>   DW_AT_data_member_location: 20
 <2><2a4>: Abbrev Number: 1 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xfbe84): Mode
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 67
    <2ab>   DW_AT_decl_column : 12
    <2ac>   DW_AT_type        : <0xb6>
    <2b0>   DW_AT_data_member_location: 24
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xfb7b4): Priority
    <2b6>   DW_AT_decl_file   : 7
    <2b7>   DW_AT_decl_line   : 72
    <2b8>   DW_AT_decl_column : 12
    <2b9>   DW_AT_type        : <0xb6>
    <2bd>   DW_AT_data_member_location: 28
 <2><2be>: Abbrev Number: 0
 <1><2bf>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x41f9b): DMA_InitTypeDef
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 74
    <2c6>   DW_AT_decl_column : 3
    <2c7>   DW_AT_type        : <0x24e>
 <1><2cb>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2cc>   DW_AT_encoding    : 7	(unsigned)
    <2cc>   DW_AT_byte_size   : 1
    <2cc>   DW_AT_type        : <0x3d>
    <2d0>   DW_AT_decl_file   : 7
    <2d1>   DW_AT_decl_line   : 80
    <2d2>   DW_AT_decl_column : 1
    <2d3>   DW_AT_sibling     : <0x2f0>
 <2><2d7>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2d8>   DW_AT_name        : (indirect string, offset: 0xb71f9): HAL_DMA_STATE_RESET
    <2dc>   DW_AT_const_value : 0
 <2><2dd>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2de>   DW_AT_name        : (indirect string, offset: 0x435c7): HAL_DMA_STATE_READY
    <2e2>   DW_AT_const_value : 1
 <2><2e3>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2e4>   DW_AT_name        : (indirect string, offset: 0xaad80): HAL_DMA_STATE_BUSY
    <2e8>   DW_AT_const_value : 2
 <2><2e9>: Abbrev Number: 7 (DW_TAG_enumerator)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xf290c): HAL_DMA_STATE_TIMEOUT
    <2ee>   DW_AT_const_value : 3
 <2><2ef>: Abbrev Number: 0
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x87bce): HAL_DMA_StateTypeDef
    <2f5>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 85
    <2f7>   DW_AT_decl_column : 3
    <2f8>   DW_AT_type        : <0x2cb>
 <1><2fc>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <2fd>   DW_AT_type        : <0x2f0>
 <1><301>: Abbrev Number: 19 (DW_TAG_structure_type)
    <302>   DW_AT_name        : (indirect string, offset: 0xd19f0): __DMA_HandleTypeDef
    <306>   DW_AT_byte_size   : 72
    <307>   DW_AT_decl_file   : 7
    <308>   DW_AT_decl_line   : 112
    <309>   DW_AT_decl_column : 16
    <309>   DW_AT_sibling     : <0x3aa>
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xc8daa): Instance
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 114
    <314>   DW_AT_decl_column : 27
    <315>   DW_AT_type        : <0x3aa>
    <319>   DW_AT_data_member_location: 0
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xfc600): Init
    <31f>   DW_AT_decl_file   : 7
    <320>   DW_AT_decl_line   : 116
    <321>   DW_AT_decl_column : 25
    <322>   DW_AT_type        : <0x2bf>
    <326>   DW_AT_data_member_location: 4
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0xaf675): Lock
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 118
    <32e>   DW_AT_decl_column : 25
    <32f>   DW_AT_type        : <0x242>
    <333>   DW_AT_data_member_location: 36
 <2><334>: Abbrev Number: 1 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xfdbdc): State
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 120
    <33b>   DW_AT_decl_column : 30
    <33c>   DW_AT_type        : <0x2fc>
    <340>   DW_AT_data_member_location: 37
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x4cdf1): Parent
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 122
    <348>   DW_AT_decl_column : 26
    <349>   DW_AT_type        : <0x3af>
    <34d>   DW_AT_data_member_location: 40
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xf5539): XferCpltCallback
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 124
    <355>   DW_AT_decl_column : 11
    <356>   DW_AT_type        : <0x3c1>
    <35a>   DW_AT_data_member_location: 44
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0xbf23c): XferHalfCpltCallback
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 126
    <362>   DW_AT_decl_column : 11
    <363>   DW_AT_type        : <0x3c1>
    <367>   DW_AT_data_member_location: 48
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x22f54): XferErrorCallback
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 128
    <36f>   DW_AT_decl_column : 11
    <370>   DW_AT_type        : <0x3c1>
    <374>   DW_AT_data_member_location: 52
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0xe6017): XferAbortCallback
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 130
    <37c>   DW_AT_decl_column : 11
    <37d>   DW_AT_type        : <0x3c1>
    <381>   DW_AT_data_member_location: 56
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xf0f95): ErrorCode
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 132
    <389>   DW_AT_decl_column : 25
    <38a>   DW_AT_type        : <0xc2>
    <38e>   DW_AT_data_member_location: 60
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x635e3): DmaBaseAddress
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 134
    <396>   DW_AT_decl_column : 26
    <397>   DW_AT_type        : <0x3c6>
    <39b>   DW_AT_data_member_location: 64
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x32b89): ChannelIndex
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 136
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0xb6>
    <3a8>   DW_AT_data_member_location: 68
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3ab>   DW_AT_byte_size   : 4
    <3ab>   DW_AT_type        : <0x106>
 <1><3af>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <3b0>   DW_AT_byte_size   : 4
 <1><3b1>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <3b2>   DW_AT_prototyped  : 1
    <3b2>   DW_AT_sibling     : <0x3bc>
 <2><3b6>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <3b7>   DW_AT_type        : <0x3bc>
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3bd>   DW_AT_byte_size   : 4
    <3bd>   DW_AT_type        : <0x301>
 <1><3c1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c2>   DW_AT_byte_size   : 4
    <3c2>   DW_AT_type        : <0x3b1>
 <1><3c6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3c7>   DW_AT_byte_size   : 4
    <3c7>   DW_AT_type        : <0x135>
 <1><3cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xd19f2): DMA_HandleTypeDef
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 153
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x301>
 <1><3d7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3d8>   DW_AT_byte_size   : 4
    <3d8>   DW_AT_type        : <0x94>
 <1><3dc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3dd>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x3cb>
 <1><3e1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e2>   DW_AT_byte_size   : 32
    <3e3>   DW_AT_decl_file   : 8
    <3e4>   DW_AT_decl_line   : 46
    <3e5>   DW_AT_decl_column : 9
    <3e5>   DW_AT_sibling     : <0x452>
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xe13ba): BaudRate
    <3ee>   DW_AT_decl_file   : 8
    <3ef>   DW_AT_decl_line   : 48
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xb6>
    <3f5>   DW_AT_data_member_location: 0
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x6bab): WordLength
    <3fb>   DW_AT_decl_file   : 8
    <3fc>   DW_AT_decl_line   : 68
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xb6>
    <402>   DW_AT_data_member_location: 4
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xe1732): StopBits
    <408>   DW_AT_decl_file   : 8
    <409>   DW_AT_decl_line   : 71
    <40a>   DW_AT_decl_column : 12
    <40b>   DW_AT_type        : <0xb6>
    <40f>   DW_AT_data_member_location: 8
 <2><410>: Abbrev Number: 1 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x45fdc): Parity
    <415>   DW_AT_decl_file   : 8
    <416>   DW_AT_decl_line   : 74
    <417>   DW_AT_decl_column : 12
    <418>   DW_AT_type        : <0xb6>
    <41c>   DW_AT_data_member_location: 12
 <2><41d>: Abbrev Number: 1 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xfbe84): Mode
    <422>   DW_AT_decl_file   : 8
    <423>   DW_AT_decl_line   : 81
    <424>   DW_AT_decl_column : 12
    <425>   DW_AT_type        : <0xb6>
    <429>   DW_AT_data_member_location: 16
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x845b3): HwFlowCtl
    <42f>   DW_AT_decl_file   : 8
    <430>   DW_AT_decl_line   : 84
    <431>   DW_AT_decl_column : 12
    <432>   DW_AT_type        : <0xb6>
    <436>   DW_AT_data_member_location: 20
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xce9a2): OverSampling
    <43c>   DW_AT_decl_file   : 8
    <43d>   DW_AT_decl_line   : 88
    <43e>   DW_AT_decl_column : 12
    <43f>   DW_AT_type        : <0xb6>
    <443>   DW_AT_data_member_location: 24
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x31a3b): OneBitSampling
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 92
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb6>
    <450>   DW_AT_data_member_location: 28
 <2><451>: Abbrev Number: 0
 <1><452>: Abbrev Number: 2 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x44ca0): UART_InitTypeDef
    <457>   DW_AT_decl_file   : 8
    <458>   DW_AT_decl_line   : 101
    <459>   DW_AT_decl_column : 3
    <45a>   DW_AT_type        : <0x3e1>
 <1><45e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <45f>   DW_AT_byte_size   : 40
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 106
    <462>   DW_AT_decl_column : 9
    <462>   DW_AT_sibling     : <0x4e9>
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x2f8a1): AdvFeatureInit
    <46b>   DW_AT_decl_file   : 8
    <46c>   DW_AT_decl_line   : 108
    <46d>   DW_AT_decl_column : 12
    <46e>   DW_AT_type        : <0xb6>
    <472>   DW_AT_data_member_location: 0
 <2><473>: Abbrev Number: 1 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0xe5815): TxPinLevelInvert
    <478>   DW_AT_decl_file   : 8
    <479>   DW_AT_decl_line   : 113
    <47a>   DW_AT_decl_column : 12
    <47b>   DW_AT_type        : <0xb6>
    <47f>   DW_AT_data_member_location: 4
 <2><480>: Abbrev Number: 1 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0xcedc7): RxPinLevelInvert
    <485>   DW_AT_decl_file   : 8
    <486>   DW_AT_decl_line   : 116
    <487>   DW_AT_decl_column : 12
    <488>   DW_AT_type        : <0xb6>
    <48c>   DW_AT_data_member_location: 8
 <2><48d>: Abbrev Number: 1 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0xa65f7): DataInvert
    <492>   DW_AT_decl_file   : 8
    <493>   DW_AT_decl_line   : 119
    <494>   DW_AT_decl_column : 12
    <495>   DW_AT_type        : <0xb6>
    <499>   DW_AT_data_member_location: 12
 <2><49a>: Abbrev Number: 1 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x4dae4): Swap
    <49f>   DW_AT_decl_file   : 8
    <4a0>   DW_AT_decl_line   : 123
    <4a1>   DW_AT_decl_column : 12
    <4a2>   DW_AT_type        : <0xb6>
    <4a6>   DW_AT_data_member_location: 16
 <2><4a7>: Abbrev Number: 1 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xbe989): OverrunDisable
    <4ac>   DW_AT_decl_file   : 8
    <4ad>   DW_AT_decl_line   : 126
    <4ae>   DW_AT_decl_column : 12
    <4af>   DW_AT_type        : <0xb6>
    <4b3>   DW_AT_data_member_location: 20
 <2><4b4>: Abbrev Number: 1 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x844b): DMADisableonRxError
    <4b9>   DW_AT_decl_file   : 8
    <4ba>   DW_AT_decl_line   : 129
    <4bb>   DW_AT_decl_column : 12
    <4bc>   DW_AT_type        : <0xb6>
    <4c0>   DW_AT_data_member_location: 24
 <2><4c1>: Abbrev Number: 1 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xf098a): AutoBaudRateEnable
    <4c6>   DW_AT_decl_file   : 8
    <4c7>   DW_AT_decl_line   : 132
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xb6>
    <4cd>   DW_AT_data_member_location: 28
 <2><4ce>: Abbrev Number: 1 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0xd1220): AutoBaudRateMode
    <4d3>   DW_AT_decl_file   : 8
    <4d4>   DW_AT_decl_line   : 135
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xb6>
    <4da>   DW_AT_data_member_location: 32
 <2><4db>: Abbrev Number: 1 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x6cad5): MSBFirst
    <4e0>   DW_AT_decl_file   : 8
    <4e1>   DW_AT_decl_line   : 139
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xb6>
    <4e7>   DW_AT_data_member_location: 36
 <2><4e8>: Abbrev Number: 0
 <1><4e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ea>   DW_AT_name        : (indirect string, offset: 0xb6f98): UART_AdvFeatureInitTypeDef
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 141
    <4f0>   DW_AT_decl_column : 3
    <4f1>   DW_AT_type        : <0x45e>
 <1><4f5>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x4a8c5): HAL_UART_StateTypeDef
    <4fa>   DW_AT_decl_file   : 8
    <4fb>   DW_AT_decl_line   : 183
    <4fc>   DW_AT_decl_column : 18
    <4fd>   DW_AT_type        : <0xb6>
 <1><501>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <502>   DW_AT_type        : <0x4f5>
 <1><506>: Abbrev Number: 2 (DW_TAG_typedef)
    <507>   DW_AT_name        : (indirect string, offset: 0x645d8): HAL_UART_RxTypeTypeDef
    <50b>   DW_AT_decl_file   : 8
    <50c>   DW_AT_decl_line   : 207
    <50d>   DW_AT_decl_column : 18
    <50e>   DW_AT_type        : <0xb6>
 <1><512>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <513>   DW_AT_type        : <0x506>
 <1><517>: Abbrev Number: 2 (DW_TAG_typedef)
    <518>   DW_AT_name        : (indirect string, offset: 0x1e77a): HAL_UART_RxEventTypeTypeDef
    <51c>   DW_AT_decl_file   : 8
    <51d>   DW_AT_decl_line   : 218
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0xb6>
 <1><523>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <524>   DW_AT_type        : <0x517>
 <1><528>: Abbrev Number: 19 (DW_TAG_structure_type)
    <529>   DW_AT_name        : (indirect string, offset: 0x8ea10): __UART_HandleTypeDef
    <52d>   DW_AT_byte_size   : 136
    <52e>   DW_AT_decl_file   : 8
    <52f>   DW_AT_decl_line   : 223
    <530>   DW_AT_decl_column : 16
    <530>   DW_AT_sibling     : <0x642>
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0xc8daa): Instance
    <539>   DW_AT_decl_file   : 8
    <53a>   DW_AT_decl_line   : 225
    <53b>   DW_AT_decl_column : 29
    <53c>   DW_AT_type        : <0x642>
    <540>   DW_AT_data_member_location: 0
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0xfc600): Init
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 227
    <548>   DW_AT_decl_column : 28
    <549>   DW_AT_type        : <0x452>
    <54d>   DW_AT_data_member_location: 4
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0xd7e64): AdvancedInit
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 229
    <555>   DW_AT_decl_column : 30
    <556>   DW_AT_type        : <0x4e9>
    <55a>   DW_AT_data_member_location: 36
 <2><55b>: Abbrev Number: 1 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x75d85): pTxBuffPtr
    <560>   DW_AT_decl_file   : 8
    <561>   DW_AT_decl_line   : 231
    <562>   DW_AT_decl_column : 29
    <563>   DW_AT_type        : <0x647>
    <567>   DW_AT_data_member_location: 76
 <2><568>: Abbrev Number: 1 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x6776c): TxXferSize
    <56d>   DW_AT_decl_file   : 8
    <56e>   DW_AT_decl_line   : 233
    <56f>   DW_AT_decl_column : 28
    <570>   DW_AT_type        : <0xa5>
    <574>   DW_AT_data_member_location: 80
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xfcb41): TxXferCount
    <57a>   DW_AT_decl_file   : 8
    <57b>   DW_AT_decl_line   : 235
    <57c>   DW_AT_decl_column : 28
    <57d>   DW_AT_type        : <0xb1>
    <581>   DW_AT_data_member_location: 82
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xe4dd6): pRxBuffPtr
    <587>   DW_AT_decl_file   : 8
    <588>   DW_AT_decl_line   : 237
    <589>   DW_AT_decl_column : 29
    <58a>   DW_AT_type        : <0x3d7>
    <58e>   DW_AT_data_member_location: 84
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x7ae68): RxXferSize
    <594>   DW_AT_decl_file   : 8
    <595>   DW_AT_decl_line   : 239
    <596>   DW_AT_decl_column : 28
    <597>   DW_AT_type        : <0xa5>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 1 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xfc60d): RxXferCount
    <5a1>   DW_AT_decl_file   : 8
    <5a2>   DW_AT_decl_line   : 241
    <5a3>   DW_AT_decl_column : 28
    <5a4>   DW_AT_type        : <0xb1>
    <5a8>   DW_AT_data_member_location: 90
 <2><5a9>: Abbrev Number: 1 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xfe0f2): Mask
    <5ae>   DW_AT_decl_file   : 8
    <5af>   DW_AT_decl_line   : 243
    <5b0>   DW_AT_decl_column : 28
    <5b1>   DW_AT_type        : <0xa5>
    <5b5>   DW_AT_data_member_location: 92
 <2><5b6>: Abbrev Number: 1 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xcd93d): ReceptionType
    <5bb>   DW_AT_decl_file   : 8
    <5bc>   DW_AT_decl_line   : 254
    <5bd>   DW_AT_decl_column : 31
    <5be>   DW_AT_type        : <0x512>
    <5c2>   DW_AT_data_member_location: 96
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x121ec): RxEventType
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 256
    <5cb>   DW_AT_decl_column : 36
    <5cc>   DW_AT_type        : <0x523>
    <5d0>   DW_AT_data_member_location: 100
 <2><5d1>: Abbrev Number: 3 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xd44a7): RxISR
    <5d6>   DW_AT_decl_file   : 8
    <5d7>   DW_AT_decl_line   : 258
    <5d9>   DW_AT_decl_column : 10
    <5da>   DW_AT_type        : <0x65c>
    <5de>   DW_AT_data_member_location: 104
 <2><5df>: Abbrev Number: 3 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x7bd60): TxISR
    <5e4>   DW_AT_decl_file   : 8
    <5e5>   DW_AT_decl_line   : 260
    <5e7>   DW_AT_decl_column : 10
    <5e8>   DW_AT_type        : <0x65c>
    <5ec>   DW_AT_data_member_location: 108
 <2><5ed>: Abbrev Number: 3 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0xca0e1): hdmatx
    <5f2>   DW_AT_decl_file   : 8
    <5f3>   DW_AT_decl_line   : 262
    <5f5>   DW_AT_decl_column : 29
    <5f6>   DW_AT_type        : <0x3dc>
    <5fa>   DW_AT_data_member_location: 112
 <2><5fb>: Abbrev Number: 3 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xef2e5): hdmarx
    <600>   DW_AT_decl_file   : 8
    <601>   DW_AT_decl_line   : 264
    <603>   DW_AT_decl_column : 29
    <604>   DW_AT_type        : <0x3dc>
    <608>   DW_AT_data_member_location: 116
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xaf675): Lock
    <60e>   DW_AT_decl_file   : 8
    <60f>   DW_AT_decl_line   : 266
    <611>   DW_AT_decl_column : 29
    <612>   DW_AT_type        : <0x242>
    <616>   DW_AT_data_member_location: 120
 <2><617>: Abbrev Number: 3 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x6397a): gState
    <61c>   DW_AT_decl_file   : 8
    <61d>   DW_AT_decl_line   : 268
    <61f>   DW_AT_decl_column : 33
    <620>   DW_AT_type        : <0x501>
    <624>   DW_AT_data_member_location: 124
 <2><625>: Abbrev Number: 3 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xdda36): RxState
    <62a>   DW_AT_decl_file   : 8
    <62b>   DW_AT_decl_line   : 272
    <62d>   DW_AT_decl_column : 33
    <62e>   DW_AT_type        : <0x501>
    <632>   DW_AT_data_member_location: 128
 <2><633>: Abbrev Number: 3 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xf0f95): ErrorCode
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 275
    <63b>   DW_AT_decl_column : 33
    <63c>   DW_AT_type        : <0xc2>
    <640>   DW_AT_data_member_location: 132
 <2><641>: Abbrev Number: 0
 <1><642>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <643>   DW_AT_byte_size   : 4
    <643>   DW_AT_type        : <0x20a>
 <1><647>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <648>   DW_AT_byte_size   : 4
    <648>   DW_AT_type        : <0xa0>
 <1><64c>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <64d>   DW_AT_prototyped  : 1
    <64d>   DW_AT_sibling     : <0x657>
 <2><651>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <652>   DW_AT_type        : <0x657>
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <658>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x528>
 <1><65c>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <65d>   DW_AT_byte_size   : 4
    <65d>   DW_AT_type        : <0x64c>
 <1><661>: Abbrev Number: 15 (DW_TAG_typedef)
    <662>   DW_AT_name        : (indirect string, offset: 0x8ea12): UART_HandleTypeDef
    <666>   DW_AT_decl_file   : 8
    <667>   DW_AT_decl_line   : 297
    <669>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x528>
 <1><66d>: Abbrev Number: 5 (DW_TAG_base_type)
    <66e>   DW_AT_byte_size   : 1
    <66f>   DW_AT_encoding    : 8	(unsigned char)
    <670>   DW_AT_name        : (indirect string, offset: 0x4f1d7): char
 <1><674>: Abbrev Number: 9 (DW_TAG_array_type)
    <675>   DW_AT_type        : <0x94>
    <679>   DW_AT_sibling     : <0x684>
 <2><67d>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <67e>   DW_AT_type        : <0x8d>
    <682>   DW_AT_upper_bound : 131
 <2><683>: Abbrev Number: 0
 <1><684>: Abbrev Number: 8 (DW_TAG_variable)
    <685>   DW_AT_name        : (indirect string, offset: 0xe253): commandSetGNSS_Config
    <689>   DW_AT_decl_file   : 9
    <68a>   DW_AT_decl_line   : 30
    <68b>   DW_AT_decl_column : 16
    <68c>   DW_AT_type        : <0x674>
    <690>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><696>: Abbrev Number: 9 (DW_TAG_array_type)
    <697>   DW_AT_type        : <0x94>
    <69b>   DW_AT_sibling     : <0x6a6>
 <2><69f>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6a0>   DW_AT_type        : <0x8d>
    <6a4>   DW_AT_upper_bound : 26
 <2><6a5>: Abbrev Number: 0
 <1><6a6>: Abbrev Number: 8 (DW_TAG_variable)
    <6a7>   DW_AT_name        : (indirect string, offset: 0xe4ce2): commandUart1Ouput
    <6ab>   DW_AT_decl_file   : 9
    <6ac>   DW_AT_decl_line   : 48
    <6ad>   DW_AT_decl_column : 16
    <6ae>   DW_AT_type        : <0x696>
    <6b2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6b8>: Abbrev Number: 9 (DW_TAG_array_type)
    <6b9>   DW_AT_type        : <0x94>
    <6bd>   DW_AT_sibling     : <0x6c8>
 <2><6c1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6c2>   DW_AT_type        : <0x8d>
    <6c6>   DW_AT_upper_bound : 10
 <2><6c7>: Abbrev Number: 0
 <1><6c8>: Abbrev Number: 8 (DW_TAG_variable)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x6e7a0): commandUBXTimeUTC
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 57
    <6cf>   DW_AT_decl_column : 16
    <6d0>   DW_AT_type        : <0x6b8>
    <6d4>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6da>: Abbrev Number: 9 (DW_TAG_array_type)
    <6db>   DW_AT_type        : <0x94>
    <6df>   DW_AT_sibling     : <0x6ea>
 <2><6e3>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6e4>   DW_AT_type        : <0x8d>
    <6e8>   DW_AT_upper_bound : 7
 <2><6e9>: Abbrev Number: 0
 <1><6ea>: Abbrev Number: 8 (DW_TAG_variable)
    <6eb>   DW_AT_name        : (indirect string, offset: 0xa4eb3): pollUBXTimeUTC
    <6ef>   DW_AT_decl_file   : 9
    <6f0>   DW_AT_decl_line   : 60
    <6f1>   DW_AT_decl_column : 16
    <6f2>   DW_AT_type        : <0x6da>
    <6f6>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><6fc>: Abbrev Number: 9 (DW_TAG_array_type)
    <6fd>   DW_AT_type        : <0x94>
    <701>   DW_AT_sibling     : <0x70c>
 <2><705>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <706>   DW_AT_type        : <0x8d>
    <70a>   DW_AT_upper_bound : 92
 <2><70b>: Abbrev Number: 0
 <1><70c>: Abbrev Number: 8 (DW_TAG_variable)
    <70d>   DW_AT_name        : (indirect string, offset: 0xbb97e): commandSetTP1_atNVTRate
    <711>   DW_AT_decl_file   : 9
    <712>   DW_AT_decl_line   : 79
    <713>   DW_AT_decl_column : 16
    <714>   DW_AT_type        : <0x6fc>
    <718>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><71e>: Abbrev Number: 9 (DW_TAG_array_type)
    <71f>   DW_AT_type        : <0x94>
    <723>   DW_AT_sibling     : <0x72e>
 <2><727>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <728>   DW_AT_type        : <0x8d>
    <72c>   DW_AT_upper_bound : 100
 <2><72d>: Abbrev Number: 0
 <1><72e>: Abbrev Number: 8 (DW_TAG_variable)
    <72f>   DW_AT_name        : (indirect string, offset: 0xcf87a): commandSetTP2
    <733>   DW_AT_decl_file   : 9
    <734>   DW_AT_decl_line   : 105
    <735>   DW_AT_decl_column : 16
    <736>   DW_AT_type        : <0x71e>
    <73a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><740>: Abbrev Number: 9 (DW_TAG_array_type)
    <741>   DW_AT_type        : <0x94>
    <745>   DW_AT_sibling     : <0x750>
 <2><749>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <74a>   DW_AT_type        : <0x8d>
    <74e>   DW_AT_upper_bound : 28
 <2><74f>: Abbrev Number: 0
 <1><750>: Abbrev Number: 8 (DW_TAG_variable)
    <751>   DW_AT_name        : (indirect string, offset: 0xdfa1d): commandMeasureRate
    <755>   DW_AT_decl_file   : 9
    <756>   DW_AT_decl_line   : 122
    <757>   DW_AT_decl_column : 16
    <758>   DW_AT_type        : <0x740>
    <75c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><762>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <763>   DW_AT_encoding    : 7	(unsigned)
    <763>   DW_AT_byte_size   : 1
    <763>   DW_AT_type        : <0x3d>
    <767>   DW_AT_decl_file   : 10
    <768>   DW_AT_decl_line   : 27
    <769>   DW_AT_decl_column : 14
    <76a>   DW_AT_sibling     : <0x781>
 <2><76e>: Abbrev Number: 7 (DW_TAG_enumerator)
    <76f>   DW_AT_name        : (indirect string, offset: 0xc767e): INIT
    <773>   DW_AT_const_value : 0
 <2><774>: Abbrev Number: 7 (DW_TAG_enumerator)
    <775>   DW_AT_name        : (indirect string, offset: 0x8fa8f): NMEA
    <779>   DW_AT_const_value : 1
 <2><77a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <77b>   DW_AT_name        : UBX
    <77f>   DW_AT_const_value : 2
 <2><780>: Abbrev Number: 0
 <1><781>: Abbrev Number: 2 (DW_TAG_typedef)
    <782>   DW_AT_name        : (indirect string, offset: 0xd75e2): OutputProtocol
    <786>   DW_AT_decl_file   : 10
    <787>   DW_AT_decl_line   : 31
    <788>   DW_AT_decl_column : 3
    <789>   DW_AT_type        : <0x762>
 <1><78d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <78e>   DW_AT_byte_size   : 8
    <78f>   DW_AT_decl_file   : 10
    <790>   DW_AT_decl_line   : 32
    <791>   DW_AT_decl_column : 9
    <791>   DW_AT_sibling     : <0x7b0>
 <2><795>: Abbrev Number: 1 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x25476): buffer
    <79a>   DW_AT_decl_file   : 10
    <79b>   DW_AT_decl_line   : 33
    <79c>   DW_AT_decl_column : 11
    <79d>   DW_AT_type        : <0x3d7>
    <7a1>   DW_AT_data_member_location: 0
 <2><7a2>: Abbrev Number: 1 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0xf9b87): size
    <7a7>   DW_AT_decl_file   : 10
    <7a8>   DW_AT_decl_line   : 34
    <7a9>   DW_AT_decl_column : 9
    <7aa>   DW_AT_type        : <0x216>
    <7ae>   DW_AT_data_member_location: 4
 <2><7af>: Abbrev Number: 0
 <1><7b0>: Abbrev Number: 2 (DW_TAG_typedef)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x80a8f): DynamicBuffer
    <7b5>   DW_AT_decl_file   : 10
    <7b6>   DW_AT_decl_line   : 35
    <7b7>   DW_AT_decl_column : 3
    <7b8>   DW_AT_type        : <0x78d>
 <1><7bc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <7bd>   DW_AT_byte_size   : 4
    <7bd>   DW_AT_type        : <0x7b0>
 <1><7c1>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <7c2>   DW_AT_encoding    : 7	(unsigned)
    <7c2>   DW_AT_byte_size   : 1
    <7c2>   DW_AT_type        : <0x3d>
    <7c6>   DW_AT_decl_file   : 11
    <7c7>   DW_AT_decl_line   : 25
    <7c8>   DW_AT_decl_column : 14
    <7c9>   DW_AT_sibling     : <0x7e0>
 <2><7cd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7ce>   DW_AT_name        : RAW
    <7d2>   DW_AT_const_value : 0
 <2><7d3>: Abbrev Number: 18 (DW_TAG_enumerator)
    <7d4>   DW_AT_name        : HEX
    <7d8>   DW_AT_const_value : 1
 <2><7d9>: Abbrev Number: 7 (DW_TAG_enumerator)
    <7da>   DW_AT_name        : (indirect string, offset: 0xbdcb1): ASCII
    <7de>   DW_AT_const_value : 2
 <2><7df>: Abbrev Number: 0
 <1><7e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xe1de2): OutputType
    <7e5>   DW_AT_decl_file   : 11
    <7e6>   DW_AT_decl_line   : 29
    <7e7>   DW_AT_decl_column : 3
    <7e8>   DW_AT_type        : <0x7c1>
 <1><7ec>: Abbrev Number: 21 (DW_TAG_variable)
    <7ed>   DW_AT_name        : (indirect string, offset: 0xff051): type
    <7f1>   DW_AT_decl_file   : 11
    <7f1>   DW_AT_decl_line   : 30
    <7f2>   DW_AT_decl_column : 19
    <7f3>   DW_AT_type        : <0x7e0>
    <7f7>   DW_AT_external    : 1
    <7f7>   DW_AT_declaration : 1
 <1><7f7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <7f8>   DW_AT_byte_size   : 12
    <7f9>   DW_AT_decl_file   : 11
    <7fa>   DW_AT_decl_line   : 32
    <7fb>   DW_AT_decl_column : 9
    <7fb>   DW_AT_sibling     : <0x826>
 <2><7ff>: Abbrev Number: 1 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0xae5a6): huart
    <804>   DW_AT_decl_file   : 11
    <805>   DW_AT_decl_line   : 33
    <806>   DW_AT_decl_column : 22
    <807>   DW_AT_type        : <0x826>
    <80b>   DW_AT_data_member_location: 0
 <2><80c>: Abbrev Number: 1 (DW_TAG_member)
    <80d>   DW_AT_name        : (indirect string, offset: 0x8b3f1): huartDebug
    <811>   DW_AT_decl_file   : 11
    <812>   DW_AT_decl_line   : 34
    <813>   DW_AT_decl_column : 22
    <814>   DW_AT_type        : <0x826>
    <818>   DW_AT_data_member_location: 4
 <2><819>: Abbrev Number: 29 (DW_TAG_member)
    <81a>   DW_AT_name        : Rx
    <81d>   DW_AT_decl_file   : 11
    <81e>   DW_AT_decl_line   : 35
    <81f>   DW_AT_decl_column : 17
    <820>   DW_AT_type        : <0x7bc>
    <824>   DW_AT_data_member_location: 8
 <2><825>: Abbrev Number: 0
 <1><826>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <827>   DW_AT_byte_size   : 4
    <827>   DW_AT_type        : <0x661>
 <1><82b>: Abbrev Number: 2 (DW_TAG_typedef)
    <82c>   DW_AT_name        : (indirect string, offset: 0x3e4a6): GNSSCom_HandleTypeDef
    <830>   DW_AT_decl_file   : 11
    <831>   DW_AT_decl_line   : 36
    <832>   DW_AT_decl_column : 3
    <833>   DW_AT_type        : <0x7f7>
 <1><837>: Abbrev Number: 21 (DW_TAG_variable)
    <838>   DW_AT_name        : (indirect string, offset: 0x4137e): hGNSSCom
    <83c>   DW_AT_decl_file   : 11
    <83c>   DW_AT_decl_line   : 37
    <83d>   DW_AT_decl_column : 30
    <83e>   DW_AT_type        : <0x82b>
    <842>   DW_AT_external    : 1
    <842>   DW_AT_declaration : 1
 <1><842>: Abbrev Number: 22 (DW_TAG_variable)
    <843>   DW_AT_specification: <0x837>
    <847>   DW_AT_decl_file   : 1
    <847>   DW_AT_decl_line   : 14
    <848>   DW_AT_decl_column : 23
    <849>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><84f>: Abbrev Number: 22 (DW_TAG_variable)
    <850>   DW_AT_specification: <0x7ec>
    <854>   DW_AT_decl_file   : 1
    <854>   DW_AT_decl_line   : 15
    <855>   DW_AT_decl_column : 12
    <856>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><85c>: Abbrev Number: 30 (DW_TAG_variable)
    <85d>   DW_AT_name        : (indirect string, offset: 0x3b2d9): protocol
    <861>   DW_AT_decl_file   : 1
    <862>   DW_AT_decl_line   : 16
    <863>   DW_AT_decl_column : 16
    <864>   DW_AT_type        : <0x781>
    <868>   DW_AT_external    : 1
    <868>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><86e>: Abbrev Number: 23 (DW_TAG_subprogram)
    <86f>   DW_AT_external    : 1
    <86f>   DW_AT_name        : (indirect string, offset: 0x6952d): realloc
    <873>   DW_AT_decl_file   : 12
    <874>   DW_AT_decl_line   : 145
    <875>   DW_AT_decl_column : 7
    <875>   DW_AT_prototyped  : 1
    <875>   DW_AT_type        : <0x3af>
    <879>   DW_AT_declaration : 1
    <879>   DW_AT_sibling     : <0x888>
 <2><87d>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <87e>   DW_AT_type        : <0x3af>
 <2><882>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <883>   DW_AT_type        : <0x216>
 <2><887>: Abbrev Number: 0
 <1><888>: Abbrev Number: 31 (DW_TAG_subprogram)
    <889>   DW_AT_external    : 1
    <889>   DW_AT_name        : (indirect string, offset: 0x405d1): vPortFree
    <88d>   DW_AT_decl_file   : 13
    <88e>   DW_AT_decl_line   : 164
    <88f>   DW_AT_decl_column : 6
    <890>   DW_AT_prototyped  : 1
    <890>   DW_AT_declaration : 1
    <890>   DW_AT_sibling     : <0x89a>
 <2><894>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <895>   DW_AT_type        : <0x3af>
 <2><899>: Abbrev Number: 0
 <1><89a>: Abbrev Number: 23 (DW_TAG_subprogram)
    <89b>   DW_AT_external    : 1
    <89b>   DW_AT_name        : (indirect string, offset: 0x8b8bf): pvPortMalloc
    <89f>   DW_AT_decl_file   : 13
    <8a0>   DW_AT_decl_line   : 163
    <8a1>   DW_AT_decl_column : 7
    <8a1>   DW_AT_prototyped  : 1
    <8a1>   DW_AT_type        : <0x3af>
    <8a5>   DW_AT_declaration : 1
    <8a5>   DW_AT_sibling     : <0x8af>
 <2><8a9>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <8aa>   DW_AT_type        : <0x216>
 <2><8ae>: Abbrev Number: 0
 <1><8af>: Abbrev Number: 24 (DW_TAG_subprogram)
    <8b0>   DW_AT_external    : 1
    <8b0>   DW_AT_name        : (indirect string, offset: 0x501c0): freeBuffer
    <8b4>   DW_AT_decl_file   : 1
    <8b4>   DW_AT_decl_line   : 47
    <8b5>   DW_AT_decl_column : 6
    <8b5>   DW_AT_prototyped  : 1
    <8b5>   DW_AT_low_pc      : 0x80005b8
    <8b9>   DW_AT_high_pc     : 0x20
    <8bd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8bf>   DW_AT_call_all_tail_calls: 1
    <8bf>   DW_AT_sibling     : <0x8d2>
 <2><8c3>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xc48d5): bufferDynamic
    <8c8>   DW_AT_decl_file   : 1
    <8c8>   DW_AT_decl_line   : 47
    <8c9>   DW_AT_decl_column : 32
    <8ca>   DW_AT_type        : <0x7bc>
    <8ce>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8d1>: Abbrev Number: 0
 <1><8d2>: Abbrev Number: 24 (DW_TAG_subprogram)
    <8d3>   DW_AT_external    : 1
    <8d3>   DW_AT_name        : (indirect string, offset: 0x71160): resizeBuffer
    <8d7>   DW_AT_decl_file   : 1
    <8d7>   DW_AT_decl_line   : 40
    <8d8>   DW_AT_decl_column : 6
    <8d8>   DW_AT_prototyped  : 1
    <8d8>   DW_AT_low_pc      : 0
    <8dc>   DW_AT_high_pc     : 0x32
    <8e0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8e2>   DW_AT_call_all_tail_calls: 1
    <8e2>   DW_AT_sibling     : <0x912>
 <2><8e6>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <8e7>   DW_AT_name        : (indirect string, offset: 0xc48d5): bufferDynamic
    <8eb>   DW_AT_decl_file   : 1
    <8eb>   DW_AT_decl_line   : 40
    <8ec>   DW_AT_decl_column : 34
    <8ed>   DW_AT_type        : <0x7bc>
    <8f1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8f4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x2932d): newSize
    <8f9>   DW_AT_decl_file   : 1
    <8f9>   DW_AT_decl_line   : 40
    <8fa>   DW_AT_decl_column : 56
    <8fb>   DW_AT_type        : <0x216>
    <8ff>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><902>: Abbrev Number: 8 (DW_TAG_variable)
    <903>   DW_AT_name        : (indirect string, offset: 0x687e7): newData
    <907>   DW_AT_decl_file   : 1
    <908>   DW_AT_decl_line   : 41
    <909>   DW_AT_decl_column : 11
    <90a>   DW_AT_type        : <0x3d7>
    <90e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><911>: Abbrev Number: 0
 <1><912>: Abbrev Number: 32 (DW_TAG_subprogram)
    <913>   DW_AT_external    : 1
    <913>   DW_AT_name        : (indirect string, offset: 0x2f3bb): initializeBuffer
    <917>   DW_AT_decl_file   : 1
    <918>   DW_AT_decl_line   : 25
    <919>   DW_AT_decl_column : 16
    <91a>   DW_AT_prototyped  : 1
    <91a>   DW_AT_type        : <0x7bc>
    <91e>   DW_AT_low_pc      : 0x8000570
    <922>   DW_AT_high_pc     : 0x48
    <926>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <928>   DW_AT_call_all_tail_calls: 1
    <928>   DW_AT_sibling     : <0x94a>
 <2><92c>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <92d>   DW_AT_name        : (indirect string, offset: 0xa5b03): initialSize
    <931>   DW_AT_decl_file   : 1
    <931>   DW_AT_decl_line   : 25
    <932>   DW_AT_decl_column : 40
    <933>   DW_AT_type        : <0x216>
    <937>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><93a>: Abbrev Number: 8 (DW_TAG_variable)
    <93b>   DW_AT_name        : (indirect string, offset: 0xc48d5): bufferDynamic
    <93f>   DW_AT_decl_file   : 1
    <940>   DW_AT_decl_line   : 26
    <941>   DW_AT_decl_column : 17
    <942>   DW_AT_type        : <0x7bc>
    <946>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><949>: Abbrev Number: 0
 <1><94a>: Abbrev Number: 33 (DW_TAG_subprogram)
    <94b>   DW_AT_external    : 1
    <94b>   DW_AT_name        : (indirect string, offset: 0x9da1e): GNSSCom_Init
    <94f>   DW_AT_decl_file   : 1
    <950>   DW_AT_decl_line   : 18
    <951>   DW_AT_decl_column : 6
    <952>   DW_AT_prototyped  : 1
    <952>   DW_AT_low_pc      : 0
    <956>   DW_AT_high_pc     : 0x28
    <95a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <95c>   DW_AT_call_all_calls: 1
 <2><95c>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <95d>   DW_AT_name        : (indirect string, offset: 0xae5a6): huart
    <961>   DW_AT_decl_file   : 1
    <961>   DW_AT_decl_line   : 18
    <962>   DW_AT_decl_column : 39
    <963>   DW_AT_type        : <0x826>
    <967>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><96a>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <96b>   DW_AT_name        : (indirect string, offset: 0x8b3f1): huartDebug
    <96f>   DW_AT_decl_file   : 1
    <96f>   DW_AT_decl_line   : 18
    <970>   DW_AT_decl_column : 65
    <971>   DW_AT_type        : <0x826>
    <975>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><978>: Abbrev Number: 0
 <1><979>: Abbrev Number: 0
  Compilation Unit @ offset 0x97a:
   Length:        0x95e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x206
   Pointer Size:  4
 <0><986>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <987>   DW_AT_producer    : (indirect string, offset: 0x40403): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <98b>   DW_AT_language    : 29	(C11)
    <98c>   DW_AT_name        : (indirect string, offset: 0xf779d): ../Core/Src/LORA/LORACom.c
    <990>   DW_AT_comp_dir    : (indirect string, offset: 0x4bdfc): C:/Users/romain.pace/Documents/GitHub/BASELIQ-Dev/LoRA_TC/Debug
    <994>   DW_AT_ranges      : 0x31
    <998>   DW_AT_low_pc      : 0
    <99c>   DW_AT_stmt_list   : 0xc5d
    <9a0>   DW_AT_macros      : 0x26adf
 <1><9a4>: Abbrev Number: 7 (DW_TAG_base_type)
    <9a5>   DW_AT_byte_size   : 1
    <9a6>   DW_AT_encoding    : 6	(signed char)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x7bd74): signed char
 <1><9ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x47360): __uint8_t
    <9b0>   DW_AT_decl_file   : 2
    <9b1>   DW_AT_decl_line   : 43
    <9b2>   DW_AT_decl_column : 24
    <9b3>   DW_AT_type        : <0x9b7>
 <1><9b7>: Abbrev Number: 7 (DW_TAG_base_type)
    <9b8>   DW_AT_byte_size   : 1
    <9b9>   DW_AT_encoding    : 8	(unsigned char)
    <9ba>   DW_AT_name        : (indirect string, offset: 0xee0e9): unsigned char
 <1><9be>: Abbrev Number: 7 (DW_TAG_base_type)
    <9bf>   DW_AT_byte_size   : 2
    <9c0>   DW_AT_encoding    : 5	(signed)
    <9c1>   DW_AT_name        : (indirect string, offset: 0xb6d29): short int
 <1><9c5>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c6>   DW_AT_name        : (indirect string, offset: 0xc90d0): __uint16_t
    <9ca>   DW_AT_decl_file   : 2
    <9cb>   DW_AT_decl_line   : 57
    <9cc>   DW_AT_decl_column : 25
    <9cd>   DW_AT_type        : <0x9d1>
 <1><9d1>: Abbrev Number: 7 (DW_TAG_base_type)
    <9d2>   DW_AT_byte_size   : 2
    <9d3>   DW_AT_encoding    : 7	(unsigned)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xec4fc): short unsigned int
 <1><9d8>: Abbrev Number: 7 (DW_TAG_base_type)
    <9d9>   DW_AT_byte_size   : 4
    <9da>   DW_AT_encoding    : 5	(signed)
    <9db>   DW_AT_name        : (indirect string, offset: 0x1489c): long int
 <1><9df>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x9da2b): __uint32_t
    <9e4>   DW_AT_decl_file   : 2
    <9e5>   DW_AT_decl_line   : 79
    <9e6>   DW_AT_decl_column : 25
    <9e7>   DW_AT_type        : <0x9eb>
 <1><9eb>: Abbrev Number: 7 (DW_TAG_base_type)
    <9ec>   DW_AT_byte_size   : 4
    <9ed>   DW_AT_encoding    : 7	(unsigned)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x5db2a): long unsigned int
 <1><9f2>: Abbrev Number: 7 (DW_TAG_base_type)
    <9f3>   DW_AT_byte_size   : 8
    <9f4>   DW_AT_encoding    : 5	(signed)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x70312): long long int
 <1><9f9>: Abbrev Number: 7 (DW_TAG_base_type)
    <9fa>   DW_AT_byte_size   : 8
    <9fb>   DW_AT_encoding    : 7	(unsigned)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x32fac): long long unsigned int
 <1><a00>: Abbrev Number: 18 (DW_TAG_base_type)
    <a01>   DW_AT_byte_size   : 4
    <a02>   DW_AT_encoding    : 5	(signed)
    <a03>   DW_AT_name        : int
 <1><a07>: Abbrev Number: 7 (DW_TAG_base_type)
    <a08>   DW_AT_byte_size   : 4
    <a09>   DW_AT_encoding    : 7	(unsigned)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x13d98): unsigned int
 <1><a0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x47362): uint8_t
    <a13>   DW_AT_decl_file   : 3
    <a14>   DW_AT_decl_line   : 24
    <a15>   DW_AT_decl_column : 19
    <a16>   DW_AT_type        : <0x9ab>
 <1><a1a>: Abbrev Number: 19 (DW_TAG_const_type)
    <a1b>   DW_AT_type        : <0xa0e>
 <1><a1f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a20>   DW_AT_name        : (indirect string, offset: 0xb4fdd): uint16_t
    <a24>   DW_AT_decl_file   : 3
    <a25>   DW_AT_decl_line   : 36
    <a26>   DW_AT_decl_column : 20
    <a27>   DW_AT_type        : <0x9c5>
 <1><a2b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a2c>   DW_AT_type        : <0xa1f>
 <1><a30>: Abbrev Number: 3 (DW_TAG_typedef)
    <a31>   DW_AT_name        : (indirect string, offset: 0x11317): uint32_t
    <a35>   DW_AT_decl_file   : 3
    <a36>   DW_AT_decl_line   : 48
    <a37>   DW_AT_decl_column : 20
    <a38>   DW_AT_type        : <0x9df>
 <1><a3c>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a3d>   DW_AT_type        : <0xa30>
 <1><a41>: Abbrev Number: 7 (DW_TAG_base_type)
    <a42>   DW_AT_byte_size   : 8
    <a43>   DW_AT_encoding    : 4	(float)
    <a44>   DW_AT_name        : (indirect string, offset: 0x16703): long double
 <1><a48>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <a49>   DW_AT_byte_size   : 4
 <1><a4a>: Abbrev Number: 7 (DW_TAG_base_type)
    <a4b>   DW_AT_byte_size   : 1
    <a4c>   DW_AT_encoding    : 8	(unsigned char)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x4f1d7): char
 <1><a51>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <a52>   DW_AT_byte_size   : 4
    <a52>   DW_AT_type        : <0xa0e>
 <1><a56>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a57>   DW_AT_byte_size   : 16
    <a58>   DW_AT_decl_file   : 4
    <a58>   DW_AT_decl_line   : 404
    <a5a>   DW_AT_decl_column : 9
    <a5a>   DW_AT_sibling     : <0xa95>
 <2><a5e>: Abbrev Number: 5 (DW_TAG_member)
    <a5f>   DW_AT_name        : CCR
    <a63>   DW_AT_decl_file   : 4
    <a63>   DW_AT_decl_line   : 406
    <a65>   DW_AT_decl_column : 17
    <a65>   DW_AT_type        : <0xa3c>
    <a69>   DW_AT_data_member_location: 0
 <2><a6a>: Abbrev Number: 2 (DW_TAG_member)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xa1a42): CNDTR
    <a6f>   DW_AT_decl_file   : 4
    <a70>   DW_AT_decl_line   : 407
    <a72>   DW_AT_decl_column : 17
    <a73>   DW_AT_type        : <0xa3c>
    <a77>   DW_AT_data_member_location: 4
 <2><a78>: Abbrev Number: 2 (DW_TAG_member)
    <a79>   DW_AT_name        : (indirect string, offset: 0xee2cb): CPAR
    <a7d>   DW_AT_decl_file   : 4
    <a7e>   DW_AT_decl_line   : 408
    <a80>   DW_AT_decl_column : 17
    <a81>   DW_AT_type        : <0xa3c>
    <a85>   DW_AT_data_member_location: 8
 <2><a86>: Abbrev Number: 2 (DW_TAG_member)
    <a87>   DW_AT_name        : (indirect string, offset: 0x883e6): CMAR
    <a8b>   DW_AT_decl_file   : 4
    <a8c>   DW_AT_decl_line   : 409
    <a8e>   DW_AT_decl_column : 17
    <a8f>   DW_AT_type        : <0xa3c>
    <a93>   DW_AT_data_member_location: 12
 <2><a94>: Abbrev Number: 0
 <1><a95>: Abbrev Number: 9 (DW_TAG_typedef)
    <a96>   DW_AT_name        : (indirect string, offset: 0xe863d): DMA_Channel_TypeDef
    <a9a>   DW_AT_decl_file   : 4
    <a9b>   DW_AT_decl_line   : 410
    <a9d>   DW_AT_decl_column : 3
    <a9d>   DW_AT_type        : <0xa56>
 <1><aa1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <aa2>   DW_AT_byte_size   : 8
    <aa3>   DW_AT_decl_file   : 4
    <aa3>   DW_AT_decl_line   : 412
    <aa5>   DW_AT_decl_column : 9
    <aa5>   DW_AT_sibling     : <0xac4>
 <2><aa9>: Abbrev Number: 5 (DW_TAG_member)
    <aaa>   DW_AT_name        : ISR
    <aae>   DW_AT_decl_file   : 4
    <aae>   DW_AT_decl_line   : 414
    <ab0>   DW_AT_decl_column : 17
    <ab0>   DW_AT_type        : <0xa3c>
    <ab4>   DW_AT_data_member_location: 0
 <2><ab5>: Abbrev Number: 2 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0xac8b7): IFCR
    <aba>   DW_AT_decl_file   : 4
    <abb>   DW_AT_decl_line   : 415
    <abd>   DW_AT_decl_column : 17
    <abe>   DW_AT_type        : <0xa3c>
    <ac2>   DW_AT_data_member_location: 4
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 9 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indirect string, offset: 0x593fa): DMA_TypeDef
    <ac9>   DW_AT_decl_file   : 4
    <aca>   DW_AT_decl_line   : 416
    <acc>   DW_AT_decl_column : 3
    <acc>   DW_AT_type        : <0xaa1>
 <1><ad0>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ad1>   DW_AT_byte_size   : 28
    <ad2>   DW_AT_decl_file   : 4
    <ad2>   DW_AT_decl_line   : 842
    <ad4>   DW_AT_decl_column : 9
    <ad4>   DW_AT_sibling     : <0xb31>
 <2><ad8>: Abbrev Number: 5 (DW_TAG_member)
    <ad9>   DW_AT_name        : CR1
    <add>   DW_AT_decl_file   : 4
    <add>   DW_AT_decl_line   : 844
    <adf>   DW_AT_decl_column : 17
    <adf>   DW_AT_type        : <0xa3c>
    <ae3>   DW_AT_data_member_location: 0
 <2><ae4>: Abbrev Number: 5 (DW_TAG_member)
    <ae5>   DW_AT_name        : CR2
    <ae9>   DW_AT_decl_file   : 4
    <ae9>   DW_AT_decl_line   : 845
    <aeb>   DW_AT_decl_column : 17
    <aeb>   DW_AT_type        : <0xa3c>
    <aef>   DW_AT_data_member_location: 4
 <2><af0>: Abbrev Number: 5 (DW_TAG_member)
    <af1>   DW_AT_name        : SR
    <af4>   DW_AT_decl_file   : 4
    <af4>   DW_AT_decl_line   : 846
    <af6>   DW_AT_decl_column : 17
    <af6>   DW_AT_type        : <0xa3c>
    <afa>   DW_AT_data_member_location: 8
 <2><afb>: Abbrev Number: 5 (DW_TAG_member)
    <afc>   DW_AT_name        : DR
    <aff>   DW_AT_decl_file   : 4
    <aff>   DW_AT_decl_line   : 847
    <b01>   DW_AT_decl_column : 17
    <b01>   DW_AT_type        : <0xa3c>
    <b05>   DW_AT_data_member_location: 12
 <2><b06>: Abbrev Number: 2 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0xf772e): CRCPR
    <b0b>   DW_AT_decl_file   : 4
    <b0c>   DW_AT_decl_line   : 848
    <b0e>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0xa3c>
    <b13>   DW_AT_data_member_location: 16
 <2><b14>: Abbrev Number: 2 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0xf7796): RXCRCR
    <b19>   DW_AT_decl_file   : 4
    <b1a>   DW_AT_decl_line   : 849
    <b1c>   DW_AT_decl_column : 17
    <b1d>   DW_AT_type        : <0xa3c>
    <b21>   DW_AT_data_member_location: 20
 <2><b22>: Abbrev Number: 2 (DW_TAG_member)
    <b23>   DW_AT_name        : (indirect string, offset: 0xf774e): TXCRCR
    <b27>   DW_AT_decl_file   : 4
    <b28>   DW_AT_decl_line   : 850
    <b2a>   DW_AT_decl_column : 17
    <b2b>   DW_AT_type        : <0xa3c>
    <b2f>   DW_AT_data_member_location: 24
 <2><b30>: Abbrev Number: 0
 <1><b31>: Abbrev Number: 9 (DW_TAG_typedef)
    <b32>   DW_AT_name        : (indirect string, offset: 0xf7722): SPI_TypeDef
    <b36>   DW_AT_decl_file   : 4
    <b37>   DW_AT_decl_line   : 851
    <b39>   DW_AT_decl_column : 3
    <b39>   DW_AT_type        : <0xad0>
 <1><b3d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b3e>   DW_AT_byte_size   : 44
    <b3f>   DW_AT_decl_file   : 4
    <b3f>   DW_AT_decl_line   : 950
    <b41>   DW_AT_decl_column : 9
    <b41>   DW_AT_sibling     : <0xc06>
 <2><b45>: Abbrev Number: 5 (DW_TAG_member)
    <b46>   DW_AT_name        : CR1
    <b4a>   DW_AT_decl_file   : 4
    <b4a>   DW_AT_decl_line   : 952
    <b4c>   DW_AT_decl_column : 17
    <b4c>   DW_AT_type        : <0xa3c>
    <b50>   DW_AT_data_member_location: 0
 <2><b51>: Abbrev Number: 5 (DW_TAG_member)
    <b52>   DW_AT_name        : CR2
    <b56>   DW_AT_decl_file   : 4
    <b56>   DW_AT_decl_line   : 953
    <b58>   DW_AT_decl_column : 17
    <b58>   DW_AT_type        : <0xa3c>
    <b5c>   DW_AT_data_member_location: 4
 <2><b5d>: Abbrev Number: 5 (DW_TAG_member)
    <b5e>   DW_AT_name        : CR3
    <b62>   DW_AT_decl_file   : 4
    <b62>   DW_AT_decl_line   : 954
    <b64>   DW_AT_decl_column : 17
    <b64>   DW_AT_type        : <0xa3c>
    <b68>   DW_AT_data_member_location: 8
 <2><b69>: Abbrev Number: 5 (DW_TAG_member)
    <b6a>   DW_AT_name        : BRR
    <b6e>   DW_AT_decl_file   : 4
    <b6e>   DW_AT_decl_line   : 955
    <b70>   DW_AT_decl_column : 17
    <b70>   DW_AT_type        : <0xa3c>
    <b74>   DW_AT_data_member_location: 12
 <2><b75>: Abbrev Number: 2 (DW_TAG_member)
    <b76>   DW_AT_name        : (indirect string, offset: 0x440b6): GTPR
    <b7a>   DW_AT_decl_file   : 4
    <b7b>   DW_AT_decl_line   : 956
    <b7d>   DW_AT_decl_column : 17
    <b7e>   DW_AT_type        : <0xa2b>
    <b82>   DW_AT_data_member_location: 16
 <2><b83>: Abbrev Number: 2 (DW_TAG_member)
    <b84>   DW_AT_name        : (indirect string, offset: 0xe84c8): RESERVED2
    <b88>   DW_AT_decl_file   : 4
    <b89>   DW_AT_decl_line   : 957
    <b8b>   DW_AT_decl_column : 13
    <b8c>   DW_AT_type        : <0xa1f>
    <b90>   DW_AT_data_member_location: 18
 <2><b91>: Abbrev Number: 2 (DW_TAG_member)
    <b92>   DW_AT_name        : (indirect string, offset: 0x911d1): RTOR
    <b96>   DW_AT_decl_file   : 4
    <b97>   DW_AT_decl_line   : 958
    <b99>   DW_AT_decl_column : 17
    <b9a>   DW_AT_type        : <0xa3c>
    <b9e>   DW_AT_data_member_location: 20
 <2><b9f>: Abbrev Number: 5 (DW_TAG_member)
    <ba0>   DW_AT_name        : RQR
    <ba4>   DW_AT_decl_file   : 4
    <ba4>   DW_AT_decl_line   : 959
    <ba6>   DW_AT_decl_column : 17
    <ba6>   DW_AT_type        : <0xa2b>
    <baa>   DW_AT_data_member_location: 24
 <2><bab>: Abbrev Number: 2 (DW_TAG_member)
    <bac>   DW_AT_name        : (indirect string, offset: 0xe84d2): RESERVED3
    <bb0>   DW_AT_decl_file   : 4
    <bb1>   DW_AT_decl_line   : 960
    <bb3>   DW_AT_decl_column : 13
    <bb4>   DW_AT_type        : <0xa1f>
    <bb8>   DW_AT_data_member_location: 26
 <2><bb9>: Abbrev Number: 5 (DW_TAG_member)
    <bba>   DW_AT_name        : ISR
    <bbe>   DW_AT_decl_file   : 4
    <bbe>   DW_AT_decl_line   : 961
    <bc0>   DW_AT_decl_column : 17
    <bc0>   DW_AT_type        : <0xa3c>
    <bc4>   DW_AT_data_member_location: 28
 <2><bc5>: Abbrev Number: 5 (DW_TAG_member)
    <bc6>   DW_AT_name        : ICR
    <bca>   DW_AT_decl_file   : 4
    <bca>   DW_AT_decl_line   : 962
    <bcc>   DW_AT_decl_column : 17
    <bcc>   DW_AT_type        : <0xa3c>
    <bd0>   DW_AT_data_member_location: 32
 <2><bd1>: Abbrev Number: 5 (DW_TAG_member)
    <bd2>   DW_AT_name        : RDR
    <bd6>   DW_AT_decl_file   : 4
    <bd6>   DW_AT_decl_line   : 963
    <bd8>   DW_AT_decl_column : 17
    <bd8>   DW_AT_type        : <0xa2b>
    <bdc>   DW_AT_data_member_location: 36
 <2><bdd>: Abbrev Number: 2 (DW_TAG_member)
    <bde>   DW_AT_name        : (indirect string, offset: 0xdea0b): RESERVED4
    <be2>   DW_AT_decl_file   : 4
    <be3>   DW_AT_decl_line   : 964
    <be5>   DW_AT_decl_column : 13
    <be6>   DW_AT_type        : <0xa1f>
    <bea>   DW_AT_data_member_location: 38
 <2><beb>: Abbrev Number: 5 (DW_TAG_member)
    <bec>   DW_AT_name        : TDR
    <bf0>   DW_AT_decl_file   : 4
    <bf0>   DW_AT_decl_line   : 965
    <bf2>   DW_AT_decl_column : 17
    <bf2>   DW_AT_type        : <0xa2b>
    <bf6>   DW_AT_data_member_location: 40
 <2><bf7>: Abbrev Number: 2 (DW_TAG_member)
    <bf8>   DW_AT_name        : (indirect string, offset: 0xe8500): RESERVED5
    <bfc>   DW_AT_decl_file   : 4
    <bfd>   DW_AT_decl_line   : 966
    <bff>   DW_AT_decl_column : 13
    <c00>   DW_AT_type        : <0xa1f>
    <c04>   DW_AT_data_member_location: 42
 <2><c05>: Abbrev Number: 0
 <1><c06>: Abbrev Number: 9 (DW_TAG_typedef)
    <c07>   DW_AT_name        : (indirect string, offset: 0xf467e): USART_TypeDef
    <c0b>   DW_AT_decl_file   : 4
    <c0c>   DW_AT_decl_line   : 967
    <c0e>   DW_AT_decl_column : 3
    <c0e>   DW_AT_type        : <0xb3d>
 <1><c12>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <c13>   DW_AT_encoding    : 7	(unsigned)
    <c13>   DW_AT_byte_size   : 1
    <c13>   DW_AT_type        : <0x9b7>
    <c17>   DW_AT_decl_file   : 5
    <c18>   DW_AT_decl_line   : 50
    <c19>   DW_AT_decl_column : 1
    <c19>   DW_AT_sibling     : <0xc2a>
 <2><c1d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c1e>   DW_AT_name        : (indirect string, offset: 0xb5a4c): HAL_UNLOCKED
    <c22>   DW_AT_const_value : 0
 <2><c23>: Abbrev Number: 6 (DW_TAG_enumerator)
    <c24>   DW_AT_name        : (indirect string, offset: 0xf657b): HAL_LOCKED
    <c28>   DW_AT_const_value : 1
 <2><c29>: Abbrev Number: 0
 <1><c2a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x9114e): HAL_LockTypeDef
    <c2f>   DW_AT_decl_file   : 5
    <c30>   DW_AT_decl_line   : 53
    <c31>   DW_AT_decl_column : 3
    <c32>   DW_AT_type        : <0xc12>
 <1><c36>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c37>   DW_AT_byte_size   : 32
    <c38>   DW_AT_decl_file   : 6
    <c39>   DW_AT_decl_line   : 46
    <c3a>   DW_AT_decl_column : 9
    <c3a>   DW_AT_sibling     : <0xca7>
 <2><c3e>: Abbrev Number: 1 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0xdca23): Request
    <c43>   DW_AT_decl_file   : 6
    <c44>   DW_AT_decl_line   : 48
    <c45>   DW_AT_decl_column : 12
    <c46>   DW_AT_type        : <0xa30>
    <c4a>   DW_AT_data_member_location: 0
 <2><c4b>: Abbrev Number: 1 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x5add6): Direction
    <c50>   DW_AT_decl_file   : 6
    <c51>   DW_AT_decl_line   : 51
    <c52>   DW_AT_decl_column : 12
    <c53>   DW_AT_type        : <0xa30>
    <c57>   DW_AT_data_member_location: 4
 <2><c58>: Abbrev Number: 1 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0x10718): PeriphInc
    <c5d>   DW_AT_decl_file   : 6
    <c5e>   DW_AT_decl_line   : 55
    <c5f>   DW_AT_decl_column : 12
    <c60>   DW_AT_type        : <0xa30>
    <c64>   DW_AT_data_member_location: 8
 <2><c65>: Abbrev Number: 1 (DW_TAG_member)
    <c66>   DW_AT_name        : (indirect string, offset: 0x26469): MemInc
    <c6a>   DW_AT_decl_file   : 6
    <c6b>   DW_AT_decl_line   : 58
    <c6c>   DW_AT_decl_column : 12
    <c6d>   DW_AT_type        : <0xa30>
    <c71>   DW_AT_data_member_location: 12
 <2><c72>: Abbrev Number: 1 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0x7ade9): PeriphDataAlignment
    <c77>   DW_AT_decl_file   : 6
    <c78>   DW_AT_decl_line   : 61
    <c79>   DW_AT_decl_column : 12
    <c7a>   DW_AT_type        : <0xa30>
    <c7e>   DW_AT_data_member_location: 16
 <2><c7f>: Abbrev Number: 1 (DW_TAG_member)
    <c80>   DW_AT_name        : (indirect string, offset: 0xde58b): MemDataAlignment
    <c84>   DW_AT_decl_file   : 6
    <c85>   DW_AT_decl_line   : 64
    <c86>   DW_AT_decl_column : 12
    <c87>   DW_AT_type        : <0xa30>
    <c8b>   DW_AT_data_member_location: 20
 <2><c8c>: Abbrev Number: 1 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xfbe84): Mode
    <c91>   DW_AT_decl_file   : 6
    <c92>   DW_AT_decl_line   : 67
    <c93>   DW_AT_decl_column : 12
    <c94>   DW_AT_type        : <0xa30>
    <c98>   DW_AT_data_member_location: 24
 <2><c99>: Abbrev Number: 1 (DW_TAG_member)
    <c9a>   DW_AT_name        : (indirect string, offset: 0xfb7b4): Priority
    <c9e>   DW_AT_decl_file   : 6
    <c9f>   DW_AT_decl_line   : 72
    <ca0>   DW_AT_decl_column : 12
    <ca1>   DW_AT_type        : <0xa30>
    <ca5>   DW_AT_data_member_location: 28
 <2><ca6>: Abbrev Number: 0
 <1><ca7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x41f9b): DMA_InitTypeDef
    <cac>   DW_AT_decl_file   : 6
    <cad>   DW_AT_decl_line   : 74
    <cae>   DW_AT_decl_column : 3
    <caf>   DW_AT_type        : <0xc36>
 <1><cb3>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <cb4>   DW_AT_encoding    : 7	(unsigned)
    <cb4>   DW_AT_byte_size   : 1
    <cb4>   DW_AT_type        : <0x9b7>
    <cb8>   DW_AT_decl_file   : 6
    <cb9>   DW_AT_decl_line   : 80
    <cba>   DW_AT_decl_column : 1
    <cba>   DW_AT_sibling     : <0xcd7>
 <2><cbe>: Abbrev Number: 6 (DW_TAG_enumerator)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xb71f9): HAL_DMA_STATE_RESET
    <cc3>   DW_AT_const_value : 0
 <2><cc4>: Abbrev Number: 6 (DW_TAG_enumerator)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x435c7): HAL_DMA_STATE_READY
    <cc9>   DW_AT_const_value : 1
 <2><cca>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ccb>   DW_AT_name        : (indirect string, offset: 0xaad80): HAL_DMA_STATE_BUSY
    <ccf>   DW_AT_const_value : 2
 <2><cd0>: Abbrev Number: 6 (DW_TAG_enumerator)
    <cd1>   DW_AT_name        : (indirect string, offset: 0xf290c): HAL_DMA_STATE_TIMEOUT
    <cd5>   DW_AT_const_value : 3
 <2><cd6>: Abbrev Number: 0
 <1><cd7>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x87bce): HAL_DMA_StateTypeDef
    <cdc>   DW_AT_decl_file   : 6
    <cdd>   DW_AT_decl_line   : 85
    <cde>   DW_AT_decl_column : 3
    <cdf>   DW_AT_type        : <0xcb3>
 <1><ce3>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ce4>   DW_AT_type        : <0xcd7>
 <1><ce8>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ce9>   DW_AT_name        : (indirect string, offset: 0xd19f0): __DMA_HandleTypeDef
    <ced>   DW_AT_byte_size   : 72
    <cee>   DW_AT_decl_file   : 6
    <cef>   DW_AT_decl_line   : 112
    <cf0>   DW_AT_decl_column : 16
    <cf0>   DW_AT_sibling     : <0xd91>
 <2><cf4>: Abbrev Number: 1 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0xc8daa): Instance
    <cf9>   DW_AT_decl_file   : 6
    <cfa>   DW_AT_decl_line   : 114
    <cfb>   DW_AT_decl_column : 27
    <cfc>   DW_AT_type        : <0xd91>
    <d00>   DW_AT_data_member_location: 0
 <2><d01>: Abbrev Number: 1 (DW_TAG_member)
    <d02>   DW_AT_name        : (indirect string, offset: 0xfc600): Init
    <d06>   DW_AT_decl_file   : 6
    <d07>   DW_AT_decl_line   : 116
    <d08>   DW_AT_decl_column : 25
    <d09>   DW_AT_type        : <0xca7>
    <d0d>   DW_AT_data_member_location: 4
 <2><d0e>: Abbrev Number: 1 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0xaf675): Lock
    <d13>   DW_AT_decl_file   : 6
    <d14>   DW_AT_decl_line   : 118
    <d15>   DW_AT_decl_column : 25
    <d16>   DW_AT_type        : <0xc2a>
    <d1a>   DW_AT_data_member_location: 36
 <2><d1b>: Abbrev Number: 1 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xfdbdc): State
    <d20>   DW_AT_decl_file   : 6
    <d21>   DW_AT_decl_line   : 120
    <d22>   DW_AT_decl_column : 30
    <d23>   DW_AT_type        : <0xce3>
    <d27>   DW_AT_data_member_location: 37
 <2><d28>: Abbrev Number: 1 (DW_TAG_member)
    <d29>   DW_AT_name        : (indirect string, offset: 0x4cdf1): Parent
    <d2d>   DW_AT_decl_file   : 6
    <d2e>   DW_AT_decl_line   : 122
    <d2f>   DW_AT_decl_column : 26
    <d30>   DW_AT_type        : <0xa48>
    <d34>   DW_AT_data_member_location: 40
 <2><d35>: Abbrev Number: 1 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0xf5539): XferCpltCallback
    <d3a>   DW_AT_decl_file   : 6
    <d3b>   DW_AT_decl_line   : 124
    <d3c>   DW_AT_decl_column : 11
    <d3d>   DW_AT_type        : <0xda6>
    <d41>   DW_AT_data_member_location: 44
 <2><d42>: Abbrev Number: 1 (DW_TAG_member)
    <d43>   DW_AT_name        : (indirect string, offset: 0xbf23c): XferHalfCpltCallback
    <d47>   DW_AT_decl_file   : 6
    <d48>   DW_AT_decl_line   : 126
    <d49>   DW_AT_decl_column : 11
    <d4a>   DW_AT_type        : <0xda6>
    <d4e>   DW_AT_data_member_location: 48
 <2><d4f>: Abbrev Number: 1 (DW_TAG_member)
    <d50>   DW_AT_name        : (indirect string, offset: 0x22f54): XferErrorCallback
    <d54>   DW_AT_decl_file   : 6
    <d55>   DW_AT_decl_line   : 128
    <d56>   DW_AT_decl_column : 11
    <d57>   DW_AT_type        : <0xda6>
    <d5b>   DW_AT_data_member_location: 52
 <2><d5c>: Abbrev Number: 1 (DW_TAG_member)
    <d5d>   DW_AT_name        : (indirect string, offset: 0xe6017): XferAbortCallback
    <d61>   DW_AT_decl_file   : 6
    <d62>   DW_AT_decl_line   : 130
    <d63>   DW_AT_decl_column : 11
    <d64>   DW_AT_type        : <0xda6>
    <d68>   DW_AT_data_member_location: 56
 <2><d69>: Abbrev Number: 1 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0xf0f95): ErrorCode
    <d6e>   DW_AT_decl_file   : 6
    <d6f>   DW_AT_decl_line   : 132
    <d70>   DW_AT_decl_column : 25
    <d71>   DW_AT_type        : <0xa3c>
    <d75>   DW_AT_data_member_location: 60
 <2><d76>: Abbrev Number: 1 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0x635e3): DmaBaseAddress
    <d7b>   DW_AT_decl_file   : 6
    <d7c>   DW_AT_decl_line   : 134
    <d7d>   DW_AT_decl_column : 26
    <d7e>   DW_AT_type        : <0xdab>
    <d82>   DW_AT_data_member_location: 64
 <2><d83>: Abbrev Number: 1 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x32b89): ChannelIndex
    <d88>   DW_AT_decl_file   : 6
    <d89>   DW_AT_decl_line   : 136
    <d8a>   DW_AT_decl_column : 25
    <d8b>   DW_AT_type        : <0xa30>
    <d8f>   DW_AT_data_member_location: 68
 <2><d90>: Abbrev Number: 0
 <1><d91>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <d92>   DW_AT_byte_size   : 4
    <d92>   DW_AT_type        : <0xa95>
 <1><d96>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <d97>   DW_AT_prototyped  : 1
    <d97>   DW_AT_sibling     : <0xda1>
 <2><d9b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <d9c>   DW_AT_type        : <0xda1>
 <2><da0>: Abbrev Number: 0
 <1><da1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da2>   DW_AT_byte_size   : 4
    <da2>   DW_AT_type        : <0xce8>
 <1><da6>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <da7>   DW_AT_byte_size   : 4
    <da7>   DW_AT_type        : <0xd96>
 <1><dab>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <dac>   DW_AT_byte_size   : 4
    <dac>   DW_AT_type        : <0xac4>
 <1><db0>: Abbrev Number: 3 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0xd19f2): DMA_HandleTypeDef
    <db5>   DW_AT_decl_file   : 6
    <db6>   DW_AT_decl_line   : 153
    <db7>   DW_AT_decl_column : 3
    <db8>   DW_AT_type        : <0xce8>
 <1><dbc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <dbd>   DW_AT_byte_size   : 52
    <dbe>   DW_AT_decl_file   : 7
    <dbf>   DW_AT_decl_line   : 46
    <dc0>   DW_AT_decl_column : 9
    <dc0>   DW_AT_sibling     : <0xe6e>
 <2><dc4>: Abbrev Number: 1 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xfbe84): Mode
    <dc9>   DW_AT_decl_file   : 7
    <dca>   DW_AT_decl_line   : 48
    <dcb>   DW_AT_decl_column : 12
    <dcc>   DW_AT_type        : <0xa30>
    <dd0>   DW_AT_data_member_location: 0
 <2><dd1>: Abbrev Number: 1 (DW_TAG_member)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x5add6): Direction
    <dd6>   DW_AT_decl_file   : 7
    <dd7>   DW_AT_decl_line   : 51
    <dd8>   DW_AT_decl_column : 12
    <dd9>   DW_AT_type        : <0xa30>
    <ddd>   DW_AT_data_member_location: 4
 <2><dde>: Abbrev Number: 1 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0xf7800): DataSize
    <de3>   DW_AT_decl_file   : 7
    <de4>   DW_AT_decl_line   : 54
    <de5>   DW_AT_decl_column : 12
    <de6>   DW_AT_type        : <0xa30>
    <dea>   DW_AT_data_member_location: 8
 <2><deb>: Abbrev Number: 1 (DW_TAG_member)
    <dec>   DW_AT_name        : (indirect string, offset: 0xf7716): CLKPolarity
    <df0>   DW_AT_decl_file   : 7
    <df1>   DW_AT_decl_line   : 57
    <df2>   DW_AT_decl_column : 12
    <df3>   DW_AT_type        : <0xa30>
    <df7>   DW_AT_data_member_location: 12
 <2><df8>: Abbrev Number: 1 (DW_TAG_member)
    <df9>   DW_AT_name        : (indirect string, offset: 0xf7734): CLKPhase
    <dfd>   DW_AT_decl_file   : 7
    <dfe>   DW_AT_decl_line   : 60
    <dff>   DW_AT_decl_column : 12
    <e00>   DW_AT_type        : <0xa30>
    <e04>   DW_AT_data_member_location: 16
 <2><e05>: Abbrev Number: 21 (DW_TAG_member)
    <e06>   DW_AT_name        : NSS
    <e0a>   DW_AT_decl_file   : 7
    <e0b>   DW_AT_decl_line   : 63
    <e0c>   DW_AT_decl_column : 12
    <e0d>   DW_AT_type        : <0xa30>
    <e11>   DW_AT_data_member_location: 20
 <2><e12>: Abbrev Number: 1 (DW_TAG_member)
    <e13>   DW_AT_name        : (indirect string, offset: 0xf7660): BaudRatePrescaler
    <e17>   DW_AT_decl_file   : 7
    <e18>   DW_AT_decl_line   : 67
    <e19>   DW_AT_decl_column : 12
    <e1a>   DW_AT_type        : <0xa30>
    <e1e>   DW_AT_data_member_location: 24
 <2><e1f>: Abbrev Number: 1 (DW_TAG_member)
    <e20>   DW_AT_name        : (indirect string, offset: 0xf783c): FirstBit
    <e24>   DW_AT_decl_file   : 7
    <e25>   DW_AT_decl_line   : 73
    <e26>   DW_AT_decl_column : 12
    <e27>   DW_AT_type        : <0xa30>
    <e2b>   DW_AT_data_member_location: 28
 <2><e2c>: Abbrev Number: 1 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xf778f): TIMode
    <e31>   DW_AT_decl_file   : 7
    <e32>   DW_AT_decl_line   : 76
    <e33>   DW_AT_decl_column : 12
    <e34>   DW_AT_type        : <0xa30>
    <e38>   DW_AT_data_member_location: 32
 <2><e39>: Abbrev Number: 1 (DW_TAG_member)
    <e3a>   DW_AT_name        : (indirect string, offset: 0xf77f1): CRCCalculation
    <e3e>   DW_AT_decl_file   : 7
    <e3f>   DW_AT_decl_line   : 79
    <e40>   DW_AT_decl_column : 12
    <e41>   DW_AT_type        : <0xa30>
    <e45>   DW_AT_data_member_location: 36
 <2><e46>: Abbrev Number: 1 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0xf776b): CRCPolynomial
    <e4b>   DW_AT_decl_file   : 7
    <e4c>   DW_AT_decl_line   : 82
    <e4d>   DW_AT_decl_column : 12
    <e4e>   DW_AT_type        : <0xa30>
    <e52>   DW_AT_data_member_location: 40
 <2><e53>: Abbrev Number: 1 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0xf77e7): CRCLength
    <e58>   DW_AT_decl_file   : 7
    <e59>   DW_AT_decl_line   : 85
    <e5a>   DW_AT_decl_column : 12
    <e5b>   DW_AT_type        : <0xa30>
    <e5f>   DW_AT_data_member_location: 44
 <2><e60>: Abbrev Number: 1 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0xf7745): NSSPMode
    <e65>   DW_AT_decl_file   : 7
    <e66>   DW_AT_decl_line   : 89
    <e67>   DW_AT_decl_column : 12
    <e68>   DW_AT_type        : <0xa30>
    <e6c>   DW_AT_data_member_location: 48
 <2><e6d>: Abbrev Number: 0
 <1><e6e>: Abbrev Number: 3 (DW_TAG_typedef)
    <e6f>   DW_AT_name        : (indirect string, offset: 0xf76f2): SPI_InitTypeDef
    <e73>   DW_AT_decl_file   : 7
    <e74>   DW_AT_decl_line   : 95
    <e75>   DW_AT_decl_column : 3
    <e76>   DW_AT_type        : <0xdbc>
 <1><e7a>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <e7b>   DW_AT_encoding    : 7	(unsigned)
    <e7b>   DW_AT_byte_size   : 1
    <e7b>   DW_AT_type        : <0x9b7>
    <e7f>   DW_AT_decl_file   : 7
    <e80>   DW_AT_decl_line   : 101
    <e81>   DW_AT_decl_column : 1
    <e81>   DW_AT_sibling     : <0xeb6>
 <2><e85>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e86>   DW_AT_name        : (indirect string, offset: 0xf77b8): HAL_SPI_STATE_RESET
    <e8a>   DW_AT_const_value : 0
 <2><e8b>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e8c>   DW_AT_name        : (indirect string, offset: 0xf7702): HAL_SPI_STATE_READY
    <e90>   DW_AT_const_value : 1
 <2><e91>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e92>   DW_AT_name        : (indirect string, offset: 0xf7690): HAL_SPI_STATE_BUSY
    <e96>   DW_AT_const_value : 2
 <2><e97>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e98>   DW_AT_name        : (indirect string, offset: 0xf7779): HAL_SPI_STATE_BUSY_TX
    <e9c>   DW_AT_const_value : 3
 <2><e9d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <e9e>   DW_AT_name        : (indirect string, offset: 0xf7755): HAL_SPI_STATE_BUSY_RX
    <ea2>   DW_AT_const_value : 4
 <2><ea3>: Abbrev Number: 6 (DW_TAG_enumerator)
    <ea4>   DW_AT_name        : (indirect string, offset: 0xf76d9): HAL_SPI_STATE_BUSY_TX_RX
    <ea8>   DW_AT_const_value : 5
 <2><ea9>: Abbrev Number: 6 (DW_TAG_enumerator)
    <eaa>   DW_AT_name        : (indirect string, offset: 0xf7809): HAL_SPI_STATE_ERROR
    <eae>   DW_AT_const_value : 6
 <2><eaf>: Abbrev Number: 6 (DW_TAG_enumerator)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xf76c5): HAL_SPI_STATE_ABORT
    <eb4>   DW_AT_const_value : 7
 <2><eb5>: Abbrev Number: 0
 <1><eb6>: Abbrev Number: 3 (DW_TAG_typedef)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xf76a3): HAL_SPI_StateTypeDef
    <ebb>   DW_AT_decl_file   : 7
    <ebc>   DW_AT_decl_line   : 110
    <ebd>   DW_AT_decl_column : 3
    <ebe>   DW_AT_type        : <0xe7a>
 <1><ec2>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ec3>   DW_AT_type        : <0xeb6>
 <1><ec7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xf7828): __SPI_HandleTypeDef
    <ecc>   DW_AT_byte_size   : 100
    <ecd>   DW_AT_decl_file   : 7
    <ece>   DW_AT_decl_line   : 115
    <ecf>   DW_AT_decl_column : 16
    <ecf>   DW_AT_sibling     : <0xfa4>
 <2><ed3>: Abbrev Number: 1 (DW_TAG_member)
    <ed4>   DW_AT_name        : (indirect string, offset: 0xc8daa): Instance
    <ed8>   DW_AT_decl_file   : 7
    <ed9>   DW_AT_decl_line   : 117
    <eda>   DW_AT_decl_column : 31
    <edb>   DW_AT_type        : <0xfa4>
    <edf>   DW_AT_data_member_location: 0
 <2><ee0>: Abbrev Number: 1 (DW_TAG_member)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xfc600): Init
    <ee5>   DW_AT_decl_file   : 7
    <ee6>   DW_AT_decl_line   : 119
    <ee7>   DW_AT_decl_column : 30
    <ee8>   DW_AT_type        : <0xe6e>
    <eec>   DW_AT_data_member_location: 4
 <2><eed>: Abbrev Number: 1 (DW_TAG_member)
    <eee>   DW_AT_name        : (indirect string, offset: 0x75d85): pTxBuffPtr
    <ef2>   DW_AT_decl_file   : 7
    <ef3>   DW_AT_decl_line   : 121
    <ef4>   DW_AT_decl_column : 31
    <ef5>   DW_AT_type        : <0xa51>
    <ef9>   DW_AT_data_member_location: 56
 <2><efa>: Abbrev Number: 1 (DW_TAG_member)
    <efb>   DW_AT_name        : (indirect string, offset: 0x6776c): TxXferSize
    <eff>   DW_AT_decl_file   : 7
    <f00>   DW_AT_decl_line   : 123
    <f01>   DW_AT_decl_column : 30
    <f02>   DW_AT_type        : <0xa1f>
    <f06>   DW_AT_data_member_location: 60
 <2><f07>: Abbrev Number: 1 (DW_TAG_member)
    <f08>   DW_AT_name        : (indirect string, offset: 0xfcb41): TxXferCount
    <f0c>   DW_AT_decl_file   : 7
    <f0d>   DW_AT_decl_line   : 125
    <f0e>   DW_AT_decl_column : 30
    <f0f>   DW_AT_type        : <0xa2b>
    <f13>   DW_AT_data_member_location: 62
 <2><f14>: Abbrev Number: 1 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0xe4dd6): pRxBuffPtr
    <f19>   DW_AT_decl_file   : 7
    <f1a>   DW_AT_decl_line   : 127
    <f1b>   DW_AT_decl_column : 31
    <f1c>   DW_AT_type        : <0xa51>
    <f20>   DW_AT_data_member_location: 64
 <2><f21>: Abbrev Number: 1 (DW_TAG_member)
    <f22>   DW_AT_name        : (indirect string, offset: 0x7ae68): RxXferSize
    <f26>   DW_AT_decl_file   : 7
    <f27>   DW_AT_decl_line   : 129
    <f28>   DW_AT_decl_column : 30
    <f29>   DW_AT_type        : <0xa1f>
    <f2d>   DW_AT_data_member_location: 68
 <2><f2e>: Abbrev Number: 1 (DW_TAG_member)
    <f2f>   DW_AT_name        : (indirect string, offset: 0xfc60d): RxXferCount
    <f33>   DW_AT_decl_file   : 7
    <f34>   DW_AT_decl_line   : 131
    <f35>   DW_AT_decl_column : 30
    <f36>   DW_AT_type        : <0xa2b>
    <f3a>   DW_AT_data_member_location: 70
 <2><f3b>: Abbrev Number: 1 (DW_TAG_member)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xf773d): CRCSize
    <f40>   DW_AT_decl_file   : 7
    <f41>   DW_AT_decl_line   : 133
    <f42>   DW_AT_decl_column : 30
    <f43>   DW_AT_type        : <0xa30>
    <f47>   DW_AT_data_member_location: 72
 <2><f48>: Abbrev Number: 1 (DW_TAG_member)
    <f49>   DW_AT_name        : (indirect string, offset: 0xd44a7): RxISR
    <f4d>   DW_AT_decl_file   : 7
    <f4e>   DW_AT_decl_line   : 135
    <f4f>   DW_AT_decl_column : 10
    <f50>   DW_AT_type        : <0xfb9>
    <f54>   DW_AT_data_member_location: 76
 <2><f55>: Abbrev Number: 1 (DW_TAG_member)
    <f56>   DW_AT_name        : (indirect string, offset: 0x7bd60): TxISR
    <f5a>   DW_AT_decl_file   : 7
    <f5b>   DW_AT_decl_line   : 137
    <f5c>   DW_AT_decl_column : 10
    <f5d>   DW_AT_type        : <0xfb9>
    <f61>   DW_AT_data_member_location: 80
 <2><f62>: Abbrev Number: 1 (DW_TAG_member)
    <f63>   DW_AT_name        : (indirect string, offset: 0xca0e1): hdmatx
    <f67>   DW_AT_decl_file   : 7
    <f68>   DW_AT_decl_line   : 139
    <f69>   DW_AT_decl_column : 31
    <f6a>   DW_AT_type        : <0xfbe>
    <f6e>   DW_AT_data_member_location: 84
 <2><f6f>: Abbrev Number: 1 (DW_TAG_member)
    <f70>   DW_AT_name        : (indirect string, offset: 0xef2e5): hdmarx
    <f74>   DW_AT_decl_file   : 7
    <f75>   DW_AT_decl_line   : 141
    <f76>   DW_AT_decl_column : 31
    <f77>   DW_AT_type        : <0xfbe>
    <f7b>   DW_AT_data_member_location: 88
 <2><f7c>: Abbrev Number: 1 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0xaf675): Lock
    <f81>   DW_AT_decl_file   : 7
    <f82>   DW_AT_decl_line   : 143
    <f83>   DW_AT_decl_column : 30
    <f84>   DW_AT_type        : <0xc2a>
    <f88>   DW_AT_data_member_location: 92
 <2><f89>: Abbrev Number: 1 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xfdbdc): State
    <f8e>   DW_AT_decl_file   : 7
    <f8f>   DW_AT_decl_line   : 145
    <f90>   DW_AT_decl_column : 30
    <f91>   DW_AT_type        : <0xec2>
    <f95>   DW_AT_data_member_location: 93
 <2><f96>: Abbrev Number: 1 (DW_TAG_member)
    <f97>   DW_AT_name        : (indirect string, offset: 0xf0f95): ErrorCode
    <f9b>   DW_AT_decl_file   : 7
    <f9c>   DW_AT_decl_line   : 147
    <f9d>   DW_AT_decl_column : 30
    <f9e>   DW_AT_type        : <0xa3c>
    <fa2>   DW_AT_data_member_location: 96
 <2><fa3>: Abbrev Number: 0
 <1><fa4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fa5>   DW_AT_byte_size   : 4
    <fa5>   DW_AT_type        : <0xb31>
 <1><fa9>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <faa>   DW_AT_prototyped  : 1
    <faa>   DW_AT_sibling     : <0xfb4>
 <2><fae>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <faf>   DW_AT_type        : <0xfb4>
 <2><fb3>: Abbrev Number: 0
 <1><fb4>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fb5>   DW_AT_byte_size   : 4
    <fb5>   DW_AT_type        : <0xec7>
 <1><fb9>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fba>   DW_AT_byte_size   : 4
    <fba>   DW_AT_type        : <0xfa9>
 <1><fbe>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <fbf>   DW_AT_byte_size   : 4
    <fbf>   DW_AT_type        : <0xdb0>
 <1><fc3>: Abbrev Number: 3 (DW_TAG_typedef)
    <fc4>   DW_AT_name        : (indirect string, offset: 0xf782a): SPI_HandleTypeDef
    <fc8>   DW_AT_decl_file   : 7
    <fc9>   DW_AT_decl_line   : 162
    <fca>   DW_AT_decl_column : 3
    <fcb>   DW_AT_type        : <0xec7>
 <1><fcf>: Abbrev Number: 10 (DW_TAG_structure_type)
    <fd0>   DW_AT_byte_size   : 32
    <fd1>   DW_AT_decl_file   : 8
    <fd2>   DW_AT_decl_line   : 46
    <fd3>   DW_AT_decl_column : 9
    <fd3>   DW_AT_sibling     : <0x1040>
 <2><fd7>: Abbrev Number: 1 (DW_TAG_member)
    <fd8>   DW_AT_name        : (indirect string, offset: 0xe13ba): BaudRate
    <fdc>   DW_AT_decl_file   : 8
    <fdd>   DW_AT_decl_line   : 48
    <fde>   DW_AT_decl_column : 12
    <fdf>   DW_AT_type        : <0xa30>
    <fe3>   DW_AT_data_member_location: 0
 <2><fe4>: Abbrev Number: 1 (DW_TAG_member)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x6bab): WordLength
    <fe9>   DW_AT_decl_file   : 8
    <fea>   DW_AT_decl_line   : 68
    <feb>   DW_AT_decl_column : 12
    <fec>   DW_AT_type        : <0xa30>
    <ff0>   DW_AT_data_member_location: 4
 <2><ff1>: Abbrev Number: 1 (DW_TAG_member)
    <ff2>   DW_AT_name        : (indirect string, offset: 0xe1732): StopBits
    <ff6>   DW_AT_decl_file   : 8
    <ff7>   DW_AT_decl_line   : 71
    <ff8>   DW_AT_decl_column : 12
    <ff9>   DW_AT_type        : <0xa30>
    <ffd>   DW_AT_data_member_location: 8
 <2><ffe>: Abbrev Number: 1 (DW_TAG_member)
    <fff>   DW_AT_name        : (indirect string, offset: 0x45fdc): Parity
    <1003>   DW_AT_decl_file   : 8
    <1004>   DW_AT_decl_line   : 74
    <1005>   DW_AT_decl_column : 12
    <1006>   DW_AT_type        : <0xa30>
    <100a>   DW_AT_data_member_location: 12
 <2><100b>: Abbrev Number: 1 (DW_TAG_member)
    <100c>   DW_AT_name        : (indirect string, offset: 0xfbe84): Mode
    <1010>   DW_AT_decl_file   : 8
    <1011>   DW_AT_decl_line   : 81
    <1012>   DW_AT_decl_column : 12
    <1013>   DW_AT_type        : <0xa30>
    <1017>   DW_AT_data_member_location: 16
 <2><1018>: Abbrev Number: 1 (DW_TAG_member)
    <1019>   DW_AT_name        : (indirect string, offset: 0x845b3): HwFlowCtl
    <101d>   DW_AT_decl_file   : 8
    <101e>   DW_AT_decl_line   : 84
    <101f>   DW_AT_decl_column : 12
    <1020>   DW_AT_type        : <0xa30>
    <1024>   DW_AT_data_member_location: 20
 <2><1025>: Abbrev Number: 1 (DW_TAG_member)
    <1026>   DW_AT_name        : (indirect string, offset: 0xce9a2): OverSampling
    <102a>   DW_AT_decl_file   : 8
    <102b>   DW_AT_decl_line   : 88
    <102c>   DW_AT_decl_column : 12
    <102d>   DW_AT_type        : <0xa30>
    <1031>   DW_AT_data_member_location: 24
 <2><1032>: Abbrev Number: 1 (DW_TAG_member)
    <1033>   DW_AT_name        : (indirect string, offset: 0x31a3b): OneBitSampling
    <1037>   DW_AT_decl_file   : 8
    <1038>   DW_AT_decl_line   : 92
    <1039>   DW_AT_decl_column : 12
    <103a>   DW_AT_type        : <0xa30>
    <103e>   DW_AT_data_member_location: 28
 <2><103f>: Abbrev Number: 0
 <1><1040>: Abbrev Number: 3 (DW_TAG_typedef)
    <1041>   DW_AT_name        : (indirect string, offset: 0x44ca0): UART_InitTypeDef
    <1045>   DW_AT_decl_file   : 8
    <1046>   DW_AT_decl_line   : 101
    <1047>   DW_AT_decl_column : 3
    <1048>   DW_AT_type        : <0xfcf>
 <1><104c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <104d>   DW_AT_byte_size   : 40
    <104e>   DW_AT_decl_file   : 8
    <104f>   DW_AT_decl_line   : 106
    <1050>   DW_AT_decl_column : 9
    <1050>   DW_AT_sibling     : <0x10d7>
 <2><1054>: Abbrev Number: 1 (DW_TAG_member)
    <1055>   DW_AT_name        : (indirect string, offset: 0x2f8a1): AdvFeatureInit
    <1059>   DW_AT_decl_file   : 8
    <105a>   DW_AT_decl_line   : 108
    <105b>   DW_AT_decl_column : 12
    <105c>   DW_AT_type        : <0xa30>
    <1060>   DW_AT_data_member_location: 0
 <2><1061>: Abbrev Number: 1 (DW_TAG_member)
    <1062>   DW_AT_name        : (indirect string, offset: 0xe5815): TxPinLevelInvert
    <1066>   DW_AT_decl_file   : 8
    <1067>   DW_AT_decl_line   : 113
    <1068>   DW_AT_decl_column : 12
    <1069>   DW_AT_type        : <0xa30>
    <106d>   DW_AT_data_member_location: 4
 <2><106e>: Abbrev Number: 1 (DW_TAG_member)
    <106f>   DW_AT_name        : (indirect string, offset: 0xcedc7): RxPinLevelInvert
    <1073>   DW_AT_decl_file   : 8
    <1074>   DW_AT_decl_line   : 116
    <1075>   DW_AT_decl_column : 12
    <1076>   DW_AT_type        : <0xa30>
    <107a>   DW_AT_data_member_location: 8
 <2><107b>: Abbrev Number: 1 (DW_TAG_member)
    <107c>   DW_AT_name        : (indirect string, offset: 0xa65f7): DataInvert
    <1080>   DW_AT_decl_file   : 8
    <1081>   DW_AT_decl_line   : 119
